
&НаСервере
Процедура ЗаполнитьТаблицуПоказателей()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Макет = ОбработкаОбъект.ПолучитьМакет("ПоказателиДляФормул");
	Область = Макет.ПолучитьОбласть("Показатели");
	
	ВсегоСтрок = Область.ВысотаТаблицы + 1;
	ТекущаяСтрока = 1;
	
	СписокПоказателей.Очистить();	
	Пока ТекущаяСтрока < ВсегоСтрок Цикл	
		ТекущаяСтрока = ТекущаяСтрока + 1;	
		
		мСтрока = "R"+Формат(ТекущаяСтрока,"ЧДЦ=0; ЧГ=");
		Показатель = Область.ПолучитьОбласть( мСтрока + "C1").ТекущаяОбласть.Текст;
		Если ПустаяСтрока(Показатель) Тогда
			Продолжить;
		КонецЕсли;
		Пометка = Область.ПолучитьОбласть( мСтрока + "C3").ТекущаяОбласть.Текст;	
		
		ДобавитьСтроку = СписокПоказателей.Добавить();
		ДобавитьСтроку.Показатель = Показатель;
		ДобавитьСтроку.Пояснение = Область.ПолучитьОбласть( мСтрока + "C2").ТекущаяОбласть.Текст;	
		ДобавитьСтроку.Особый = ?(Пометка = "1", Истина, Ложь);		
	КонецЦикла;
	
Конецпроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Алгоритм = Параметры.ТекстАлгоритма;

	ЗаполнитьТаблицуПоказателей();
	
	Если ПустаяСтрока(Алгоритм) Тогда
		Алгоритм = "//Главное возвращаемое значение: НоваяЦенаПродажи. 
		|НоваяЦенаПродажи = ;";
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
//  Работа подсистемы АЛГОРИТМЫ

&НаКлиенте
Процедура АлгоритмПрименить(Команда)
		
	Закрыть(Алгоритм);
	
КонецПроцедуры


