
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//мегапрайсНеХранитьИсториюПрайсов = Константы.мегапрайсНеХранитьИсториюПрайсов.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	мегапрайсРегистрацияПрайса.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.мегапрайсРегистрацияПрайса КАК мегапрайсРегистрацияПрайса
	|ГДЕ
	|	мегапрайсРегистрацияПрайса.Проведен = ИСТИНА
	|	И мегапрайсРегистрацияПрайса.ПрайсПартнера = &ПрайсПартнера
	|	И мегапрайсРегистрацияПрайса.ИдентификаторПрайса <> &ИдентификаторПрайса
	|	И мегапрайсРегистрацияПрайса.Ссылка <> &ТекущийДокумент";
	
	Запрос.УстановитьПараметр("ПрайсПартнера", ПрайсПартнера);
	Запрос.УстановитьПараметр("ИдентификаторПрайса", ИдентификаторПрайса);
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();	
	Пока РезультатЗапроса.Следующий() Цикл
		ПрайсПартнераОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		ПрайсПартнераОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);		
	КонецЦикла;
	
	Движения.мегапрайсЦеныНоменклатурыПоставщиков.Записывать = Истина;
	Движения.мегапрайсЦеныНоменклатурыПоставщиков.Очистить();

	//Если НЕ мегапрайсНеХранитьИсториюПрайсов Тогда 
	//	//Очистка значений предидущих прайсов о наличии товара	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	ИСТИНА КАК Актуальность,
	//	|	мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних.ПрайсПартнера,
	//	|	мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних.НоменклатураПоставщика КАК НоменклатураПоставщика,
	//	|	мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура КАК Номенклатура,
	//	|	мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//	|	мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних.Валюта КАК Валюта,
	//	|	мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних.СрокПоставки КАК СрокПоставки,
	//	|	мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних.Количество КАК Количество,
	//	|	мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних.Цена КАК Цена
	//	|ИЗ
	//	|	РегистрСведений.мегапрайсЦеныНоменклатурыПоставщиков.СрезПоследних(
	//	|			&ДатаДок,
	//	|			ПрайсПартнера = &ПрайсПартнера
	//	|				И НЕ Номенклатура В (&СписокНоменклатурыПоставщика)
	//	|				И Количество > 0) КАК мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних";
	//	
	//	Запрос.УстановитьПараметр("ДатаДок", ЭтотОбъект.Дата);
	//	Запрос.УстановитьПараметр("ПрайсПартнера", ПрайсПартнера);
	//	Запрос.УстановитьПараметр("СписокНоменклатурыПоставщика", Товары.ВыгрузитьКолонку("Номенклатура"));
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	ТаблицаЗаписей = РезультатЗапроса.Выгрузить();
	//	
	//	Для Каждого СтрокаТаблицы Из ТаблицаЗаписей Цикл
	//		НоваяЗапись = Движения.мегапрайсЦеныНоменклатурыПоставщиков.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТаблицы);
	//		НоваяЗапись.Регистратор  = Ссылка;
	//		НоваяЗапись.Период       = Дата;
	//		НоваяЗапись.Цена         = 0;
	//		НоваяЗапись.Количество   = 0;
	//		НоваяЗапись.СрокПоставки = 0;
	//	КонецЦикла;	
	//КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИСТИНА КАК Актуальность,
	|	ТаблицаЦены.Ссылка КАК ДокументРегистратор,
	|	ТаблицаЦены.Ссылка.Дата КАК Период,
	|	ТаблицаЦены.Ссылка.ПрайсПартнера КАК ПрайсПартнера,
	|	ТаблицаЦены.НоменклатураПоставщика КАК НоменклатураПоставщика,
	|	ТаблицаЦены.Номенклатура КАК Номенклатура,
	|	ТаблицаЦены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаЦены.Валюта КАК Валюта,
	|	МАКСИМУМ(ТаблицаЦены.СрокПоставки) КАК СрокПоставки,
	|	СУММА(ТаблицаЦены.Количество) КАК Количество,
	|	МАКСИМУМ(ТаблицаЦены.Цена) КАК Цена
	|ИЗ
	|	Документ.мегапрайсРегистрацияПрайса.Товары КАК ТаблицаЦены
	|ГДЕ
	|	ТаблицаЦены.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЦены.Ссылка.Дата,
	|	ТаблицаЦены.Ссылка.ПрайсПартнера,
	|	ТаблицаЦены.НоменклатураПоставщика,
	|	ТаблицаЦены.Номенклатура,
	|	ТаблицаЦены.ХарактеристикаНоменклатуры,
	|	ТаблицаЦены.Валюта,
	|	ТаблицаЦены.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗаписей = РезультатЗапроса.Выгрузить();
		
	Для Каждого СтрокаТаблицы Из ТаблицаЗаписей Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;

		НоваяЗапись = Движения.мегапрайсЦеныНоменклатурыПоставщиков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТаблицы);
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Валюта) Тогда
			НоваяЗапись.Валюта = ПрайсПартнера.Валюта;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
