Функция ПолучитьСписокПочтовыхАдресов(СписокПартнеров)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПартнерыКонтактнаяИнформация.Ссылка КАК Клиент,
	|	ПартнерыКонтактнаяИнформация.Представление КАК Кому
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|ГДЕ
	|	ПартнерыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И ПартнерыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПартнера)
	|	И ПартнерыКонтактнаяИнформация.Ссылка В(&Ссылка)");
	Запрос.УстановитьПараметр("Ссылка", СписокПартнеров);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ЗаписатьРассылкаГотова(Клиент)
	ДопРеквизитДатаРассылки = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Дата рассылки прайса (Общие)");
	
	ТекКлиентОбъект = Клиент.ПолучитьОбъект();
	//ТекКлиентОбъект = Справочники.Партнеры.СоздатьЭлемент();
	ПараметрыОтбора = Новый Структура("Свойство", ДопРеквизитДатаРассылки);
	СтрокиСвойств 	= ТекКлиентОбъект.ДополнительныеРеквизиты.НайтиСтроки(ПараметрыОтбора);
	
	Если СтрокиСвойств.Количество() = 0 Тогда
		НоваяСтрока = ТекКлиентОбъект.ДополнительныеРеквизиты.Добавить();
		НоваяСтрока.Свойство = ДопРеквизитДатаРассылки;
		НоваяСтрока.Значение = ТекущаяДата();
	Иначе
		НоваяСтрока = СтрокиСвойств[0];
		НоваяСтрока.Значение = ТекущаяДата();
	КонецЕсли;	
	
	ТекКлиентОбъект.Записать();
КонецПроцедуры

Процедура ЗаписатьСохранениеПрайсаГотово(Клиент)
	ДопРеквизитДатаРассылки = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Дата сохранения прайса на диск (Общие)");
	
	ТекКлиентОбъект = Клиент.ПолучитьОбъект();
	//ТекКлиентОбъект = Справочники.Партнеры.СоздатьЭлемент();
	ПараметрыОтбора = Новый Структура("Свойство", ДопРеквизитДатаРассылки);
	СтрокиСвойств 	= ТекКлиентОбъект.ДополнительныеРеквизиты.НайтиСтроки(ПараметрыОтбора);
	
	Если СтрокиСвойств.Количество() = 0 Тогда
		НоваяСтрока = ТекКлиентОбъект.ДополнительныеРеквизиты.Добавить();
		НоваяСтрока.Свойство = ДопРеквизитДатаРассылки;
		НоваяСтрока.Значение = ТекущаяДата();
	Иначе
		НоваяСтрока = СтрокиСвойств[0];
		НоваяСтрока.Значение = ТекущаяДата();
	КонецЕсли;	
	
	ТекКлиентОбъект.Записать();
КонецПроцедуры

Функция СформироватьПрайсы(Клиенты = Неопределено
								,СегментНоменклатуры 				= Неопределено
								,НаДиск 							= Ложь
								,УникальныйИдентификаторДляФайлов 	= Неопределено
								,СписокНоменклатурыДляРассылки 		= Неопределено
								,вхСписокЦен 						= Неопределено
								,ПредЗаказ 	 						= Ложь
								,Рассылать 							= Ложь
								,адреспочты							= Неопределено
								,сохрдиск							= Ложь
								,толькоШКПроизводителя				= Ложь) Экспорт

	Отладка = Истина;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЕСТЬNULL(НастройкиУчетныхЗаписейЭлектроннойПочты.УчетнаяЗаписьЭлектроннойПочты, ЗНАЧЕНИЕ(Справочник.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты)) КАК УчетнаяЗапись,
	|	НастройкиУчетныхЗаписейЭлектроннойПочты.ОтветственныйЗаОбработкуПисем как Менеджер
	|ИЗ
	|	РегистрСведений.НастройкиУчетныхЗаписейЭлектроннойПочты КАК НастройкиУчетныхЗаписейЭлектроннойПочты
	|");
	
	ТаблицаУчетокМенеджера 	= Запрос.Выполнить().Выгрузить();
    	
	ПроверкаДатаВыпуска = Дата(1900,01,01);
	ДанныеПрайсыКлиентов 	= Новый Структура("Клиенты, ПрайсыКлиентов");
	ПрайсыКлиентов 			= Новый Соответствие;
	ТаблицаКлиентов 		= ПолучитьСписокКлиентовДляРассылки(Клиенты, НаДиск, ПредЗаказ);
	МасКлиенты = ТаблицаКлиентов.ВыгрузитьКолонку("Клиент");
	ТаблицаПочтовыхАдресов 	= ПолучитьСписокПочтовыхАдресов(МасКлиенты);
	
	СтрокиМатрицыАппаратов 	= ПолучитьСтрокиДляМатрицыАппаратов();
	
	ЕстьВидыЦен = Ложь;
	
	Если вхСписокЦен = Неопределено и ТаблицаКлиентов.Количество() <> 0 Тогда
		СписокЦенВсехКлиентов 	= ПолучитьСписокЦенВсехКлиентов(ТаблицаКлиентов.ВыгрузитьКолонку("Клиент"), ПредЗаказ);
		Если СписокЦенВсехКлиентов.Количество() = 0 Тогда
			ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не найдены виды цен для всех клиентов в текущей выгрузке");
		Иначе
			ЕстьВидыЦен = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Если ТаблицаКлиентов.Количество() <> 0 И Отладка И ЕстьВидыЦен Тогда
		
		ExcelПриложение 				= Новый COMОбъект("Excel.Application");
		ExcelПриложение.Visible 		= 0;
		ExcelПриложение.DisplayAlerts 	= 0;
		ExcelПриложение.ScreenUpdating 	= 0;
		ExcelПриложение.EnableEvents 	= 0;
		ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовЕксель",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - открытие ексель.");
		
		
		СегментНоменклатуры 			= Неопределено;
		СписокНоменклатурыДляРассылки 	= Неопределено;
		МенеджерВременТаблиц 			= Неопределено;
		
		Для Каждого ТекСтрока Из ТаблицаКлиентов Цикл
			
			Если Рассылать Тогда
				Если Не ЕстьАдресДляРассылки(ТекСтрока.Клиент,адреспочты, ТаблицаПочтовыхАдресов) Тогда
				
					Продолжить;
				
				КонецЕсли;	
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - начало обработки клиента " + ТекСтрока.Клиент);
			
			Клиент 			= ТекСтрока.Клиент;
			ФайлДляРассылки = ТекСтрока.Файл;
			Если ФайлДляРассылки = Неопределено Тогда
				//Записать в лог файл
				ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не найден файл прайса для клиента" + ТекСтрока.Наименование);
				Продолжить;
			КонецЕсли;
			
			Если вхСписокЦен = Неопределено Тогда //edb 2016-02-11
				СписокЦен 	= ПолучитьСписокЦен(Клиент, ПредЗаказ, толькоШКПроизводителя);
			Иначе
				Если ТипЗнч(вхСписокЦен) = Тип("Массив") Тогда
					СписокЦен = Новый ТаблицаЗначений;
					СписокЦен.Колонки.Добавить("ВидЦены");
					СписокЦен.Колонки.Добавить("РассылкаСШКПроизводителя");
					
					Для Каждого ВидЦены из вхСписокЦен Цикл
						НоваяСтрока = СписокЦен.Добавить();
						НоваяСтрока.ВидЦены = ВидЦены;
						НоваяСтрока.РассылкаСШКПроизводителя = Ложь;
					КонецЦикла;	
				Иначе
				 	СписокЦен 	= вхСписокЦен;
				КонецЕсли;
			КонецЕсли;
			
			Если СписокНоменклатурыДляРассылки = Неопределено Тогда //edb 2016-02-11
				//ТекСегментНоменклатуры = ПолучитьСегментНоменклатуры(Клиент);
				ТекСегментНоменклатуры = ТекСтрока.Сегмент;
				//Если ТекСегментНоменклатуры = Неопределено Тогда
				Если Не ЗначениеЗаполнено(ТекСегментНоменклатуры) Тогда
					//Записать в лог файл
					ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не найдены сегменты номенклатуры для клиента" + ТекСтрока.Наименование);
					СписокНоменклатурыДляРассылки = Неопределено;
					Продолжить;
				Иначе 
					Если ТекСегментНоменклатуры <> СегментНоменклатуры Тогда
						СегментНоменклатуры 			= ТекСегментНоменклатуры;
						СписокНоменклатурыДляРассылки 	= ПолучитьСписокНоменклатурыДляРассылки(СегментНоменклатуры);
						
						//Если Клиент <> Справочники.Партнеры.РозничныйПокупатель Тогда
							Если МенеджерВременТаблиц <> Неопределено Тогда
								
								МенеджерВременТаблиц.Закрыть();
								
							КонецЕсли;
							
							МенеджерВременТаблиц			= ПолучитьВременныеТаблицы(ПредЗаказ, СписокНоменклатурыДляРассылки, Клиент);
						//КонецЕсли;
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			
			Если СписокНоменклатурыДляРассылки = Неопределено Тогда
				ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не найдены сегменты номенклатуры для клиента" + ТекСтрока.Наименование);
				Продолжить;
			КонецЕсли;	
			
			ДанныеФайла 		= ПрисоединенныеФайлы.ПолучитьДанныеФайла(ФайлДляРассылки);
			ДвоичныеДанные 		= ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ФайлДляРассылки);
			//АдресНаДискеШаблон 	= ПолучитьИмяВременногоФайла(ДанныеФайла.Расширение);
			//ДвоичныеДанные.Записать(АдресНаДискеШаблон);
					
			МассивПрайсов 		= Новый Массив;
			МассивПрайсовАдреса = Новый Массив;
			
			СоответствиеЦенаФайл 	= Новый Соответствие;
			EmailОсновногоМенеджера = "";
			
			ФорматДаты = "ДД.ММ.ГГГГ";
			
			Если СписокЦен.Количество() = 0 Тогда
				ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не найдены виды цен для клиента" + ТекСтрока.Наименование);
				Продолжить;
			Иначе
				//ExcelПриложение 		= Новый COMОбъект("Excel.Application");
				//ExcelПриложение.Visible = 0;
				//ExcelПриложение.DisplayAlerts = 0;
				//ExcelПриложение.ScreenUpdating = 0;
				//ExcelПриложение.EnableEvents = 0;    
				
				НаименованиеКлиента = Клиент.Наименование;
				//заменим спецсимволы \ / ? : * " > < |
				НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"\","_");
				НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"/","_");
				НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"?","_");
				НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,":","_");
				НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"*","_");
				НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"""","_");
				НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"<","_");
				НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,">","_");
				НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"|","_");
				НаименованиеКлиента 	= СокрЛП(НаименованиеКлиента);
				
				//Если Клиент <> Справочники.Партнеры.РозничныйПокупатель Тогда
					ВыборкаСРазбивкой	= ПолучитьСтрокиДляЗаполненияФайлаПрайсСРазбивкойНовый4(СписокНоменклатурыДляРассылки, СписокЦен, Клиент, ПредЗаказ, МенеджерВременТаблиц);
				//Иначе	
				//	ВыборкаСРазбивкой	= ПолучитьСтрокиДляЗаполненияФайлаПрайсСРазбивкойНовый3(СписокНоменклатурыДляРассылки, СписокЦен, Клиент, ПредЗаказ);
				//КонецЕсли;	
				
				Для Каждого СтрокаЦена Из СписокЦен Цикл
					Цена 						= СтрокаЦена.ВидЦены;
					РассылкаСШКПроизводителя 	= СтрокаЦена.РассылкаСШКПроизводителя;
					Если СписокНоменклатурыДляРассылки <> Неопределено Тогда
						//Данные для заполнения файла
						Заголовок = "Прайс-лист от ООО ""ДиджитСтайл"" от "+ Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
						ТелефонОсновногоМенеджера	= "вн.:" + ПолучитьТелефон(Клиент.ОсновнойМенеджер); 
						EmailОсновногоМенеджера 	= ПолучитьEmail(Клиент.ОсновнойМенеджер);
						
						АдресНаДискеШаблон 	= ПолучитьИмяВременногоФайла(ДанныеФайла.Расширение);
						ДвоичныеДанные.Записать(АдресНаДискеШаблон);
						
						Попытка
							Книга 						= ExcelПриложение.WorkBooks.Open(СокрЛП(АдресНаДискеШаблон));
						Исключение
							ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не удалось открыть шаблон для клиента " + Клиент);
							Продолжить;
						КонецПопытки;
						
						ЗаполнитьПрайсЕксель(EmailОсновногоМенеджера, ВыборкаСРазбивкой, ДанныеФайла, Заголовок, Клиент, Книга, МассивПрайсов, НаименованиеКлиента, ПредЗаказ, ПроверкаДатаВыпуска, СоответствиеЦенаФайл, сохрдиск, СписокНоменклатурыДляРассылки, СтрокиМатрицыАппаратов, ТекСтрока, ТелефонОсновногоМенеджера, Цена);

					Иначе
						//Записать в лог файл
						ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не найдены сегменты номенклатуры для клиента" + ТекСтрока.Наименование);
						Продолжить;
					КонецЕсли;
				КонецЦикла;
				
				Если Рассылать Тогда
					ОтправитьПрайсКлиенту(адреспочты, Клиент, МассивПрайсов, СоответствиеЦенаФайл, ТаблицаПочтовыхАдресов, ТаблицаУчетокМенеджера, ТекСтрока);
				Иначе
					СоответствиеЦенаФайлАдрес 	= Новый Соответствие;
					МассивПрайсовАдрес 			= Новый Массив;
					
					Для Каждого ТекЭлемент Из МассивПрайсов Цикл
						тт_Цена 	= СоответствиеЦенаФайл.Получить(ТекЭлемент);
						
						ДвоичныеДанныеФайл = Новый ДвоичныеДанные(ТекЭлемент); 
						Если УникальныйИдентификаторДляФайлов = Неопределено Тогда
							Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайл);
						Иначе	
							Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайл, УникальныйИдентификаторДляФайлов);
						КонецЕсли;	
						ДвоичныеДанныеФайл = Неопределено;
						МассивПрайсовАдрес.Добавить(Адрес);
						СоответствиеЦенаФайлАдрес.Вставить(Адрес, тт_Цена);
					КонецЦикла;
					
					ДанныеПоПрайсамКлиента = Новый Структура("МассивПрайсов, СоответствиеЦенаФайл, НаименованиеКлиента", МассивПрайсовАдрес, СоответствиеЦенаФайлАдрес, Клиент.Наименование);
					
					ПрайсыКлиентов.Вставить(Клиент, ДанныеПоПрайсамКлиента);
				КонецЕсли;			
			КонецЕсли;
			
			Для Каждого ТекЭлемент Из МассивПрайсов Цикл
				УдалитьФайлы(ТекЭлемент);
			КонецЦикла;
			
			МассивПрайсов = Неопределено;
			
			УдалитьФайлы(АдресНаДискеШаблон);
			
			ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - конец обработки клиента " + ТекСтрока.Клиент);
			
		КонецЦикла;
		
		Попытка
			//ExcelПриложение.DisplayAlerts = 0;
			//Книга.Close();
			ExcelПриложение.DisplayAlerts = 1;
			ExcelПриложение.Quit();
			ExcelПриложение = Неопределено;
			ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовЕксель",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - закрытие ексель");
		Исключение
			ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовЕксель",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не удалось закрыть Excel");
		КонецПопытки;
		
	Иначе
		//Записать в лог файл
		ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не найдены клиенты для рассылки");
	КонецЕсли;
	
	Если Клиенты = Неопределено Тогда
		Клиенты = ТаблицаКлиентов.ВыгрузитьКолонку("Клиент");
	КонецЕсли;	
	
	ДанныеПрайсыКлиентов.ПрайсыКлиентов = ПрайсыКлиентов;
	ДанныеПрайсыКлиентов.Клиенты 		= Клиенты;
	
	Возврат ДанныеПрайсыКлиентов;

КонецФункции

Процедура ЗаполнитьПрайсЕксель(Знач EmailОсновногоМенеджера, Знач ВыборкаСРазбивкой, Знач ДанныеФайла, Знач Заголовок, Знач Клиент, Знач Книга, Знач МассивПрайсов, Знач НаименованиеКлиента, Знач ПредЗаказ, Знач ПроверкаДатаВыпуска, Знач СоответствиеЦенаФайл, Знач сохрдиск, Знач СписокНоменклатурыДляРассылки, Знач СтрокиМатрицыАппаратов, Знач ТекСтрока, Знач ТелефонОсновногоМенеджера, Знач Цена)
	
	Перем АдресНаДиске, ВсегоКолонок, ВсегоСтрок, Выборка, ДД, ЕстьВыборкаПоЦене, ЕстьЛист, индСтрок, КлиентНаименование, КоличествоСтрок, Лист, МассивКОМ, НомерСтроки, Отсрочка, Ротация, СоответсвиеЦеновыхГрупп, Строка, СтрокаТаблицы, Строки, ТекБренд, ТекДата, ТекЛист, ТекНаименованиеЦеноваяГруппа, тт_Цена, тт_Цена_тт, ФормаДоговора, ЦеныПоЦеновымГруппам, Ячейка;
	
	#Область ЦеновоеПредложение
	
	ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - начало ценовое предложение клиента " + ТекСтрока.Клиент);
	
	Попытка
		Лист 						= Книга.WorkSheets("Ценовое_предложение");
		ЕстьЛист = Истина
	Исключение
		ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не удалось найти лист Ценовое предложение в шаблоне для клиента " + Клиент);
		ЕстьЛист = Ложь;
	КонецПопытки;
	
	Если ЕстьЛист ТОгда
		Лист.UnProtect();
		КлиентНаименование 	= Клиент.НаименованиеПолное;
		ФормаДоговора 		= ТекСтрока.ФормаДоговора;
		Отсрочка 			= ТекСтрока.Отсрочка;
		Ротация 			= ТекСтрока.Ротация;
		
		Если Не ПредЗаказ Тогда
			Ячейка = Лист.Cells(4, 3);
			Ячейка.Value = КлиентНаименование;
			Ячейка = Лист.Cells(5, 3);
			Ячейка.Value = Строка(ФормаДоговора);
			Ячейка = Лист.Cells(5, 8);
			Ячейка.Value = ТелефонОсновногоМенеджера;
			Ячейка = Лист.Cells(6, 3);
			Ячейка.Value = Отсрочка;
			Ячейка = Лист.Cells(6, 7);
			Ячейка.Value = EmailОсновногоМенеджера;
			Ячейка = Лист.Cells(7, 3);
			Ячейка.Value = ?(Ротация, "Да","Нет");
		Иначе
			Ячейка = Лист.Cells(12, 6);
			Ячейка.Value = Цена.Наименование;
		КонецЕсли;
		
		НомерСтроки = 13;
		//получим все варианты ценовых групп с привязкой к строке
		СоответсвиеЦеновыхГрупп = Новый Соответствие;
		
		ТекБренд = Лист.Cells(НомерСтроки, 2).Text;
		Пока ЗначениеЗаполнено(ТекБренд) Цикл
			ТекНаименованиеЦеноваяГруппа = СокрЛП(ТекБренд) + СокрЛП(Лист.Cells(НомерСтроки, 3).Text) 
			+ СокрЛП(Лист.Cells(НомерСтроки, 4).Text) + СокрЛП(Лист.Cells(НомерСтроки, 5).Text);	
			Если ЗначениеЗаполнено(ТекНаименованиеЦеноваяГруппа) Тогда										
				СоответсвиеЦеновыхГрупп.Вставить(ВРег(ТекНаименованиеЦеноваяГруппа),НомерСтроки);
			КонецЕсли;
			НомерСтроки = НомерСтроки + 1;
			ТекБренд = Лист.Cells(НомерСтроки, 2).Text;
			
		КонецЦикла;	
		//получаем цены по каждой из групп
		Если СоответсвиеЦеновыхГрупп.Количество() Тогда
			ЦеныПоЦеновымГруппам = ПолучитьЦеныЦеновыхГруппНовый(СоответсвиеЦеновыхГрупп, Цена);
		Иначе
			ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не удалось получить ценовые группы для листа Ценовое предложение");
		КонецЕсли;	
		//выводим данные в ексель
		Если ЦеныПоЦеновымГруппам.Количество() Тогда
			Для каждого СтрокаТаблицы из ЦеныПоЦеновымГруппам Цикл
				НомерСтроки = СоответсвиеЦеновыхГрупп.Получить(ВРЕГ(СокрЛП(СтрокаТаблицы.Наименование)));
				Лист.Cells(НомерСтроки, 6).Value = СтрокаТаблицы.Цена;	
			КонецЦикла; 
		Иначе
			ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - нет данных по ценовым группам для листа Ценовое предложение" + ТекСтрока.Наименование);
		КонецЕсли;	
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - конец ценовое предложение клиента " + ТекСтрока.Клиент);
	
	#КонецОбласти
	
	#Область Прайс
	//Попытка
	//	Лист 						= Книга.WorkSheets("Прайс");
	//	ЕстьЛист = Истина
	//Исключение
	//	ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не удалось найти лист Прайс в шаблоне для клиента " + Клиент);
	//	ЕстьЛист = Ложь;
	//КонецПопытки;
	
	ЕстьЛист = Ложь;
	
	Если ЕстьЛист Тогда
		
		ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - начало прайс клиента " + ТекСтрока.Клиент);
		
		
		Строки 						= ПолучитьСтрокиДляЗаполненияФайла(СписокНоменклатурыДляРассылки, Цена, Клиент);
		Если Строки = Неопределено Тогда
			ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - нет данных для формирования прайса");
		Иначе
			Лист.UnProtect();
			Ячейка = Лист.Cells(1, 5);
			Ячейка.Value = Заголовок;
			Ячейка = Лист.Cells(3, 6);
			Ячейка.Value = ТелефонОсновногоМенеджера;
			Ячейка = Лист.Cells(4, 5);
			Ячейка.Value = EmailОсновногоМенеджера;
			НомерСтроки = 8;
			
			КоличествоСтрок = НомерСтроки + Строки.Количество() -1;
			
			//Область = Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,16));
			
			ВсегоСтрок 		= Строки.Количество();
			ВсегоКолонок 	= 19;
			
			МассивКОМ = Новый COMSafeArray("VT_VARIANT", ВсегоКолонок, ВсегоСтрок);
			
			Для индСтрок = 0 По ВсегоСтрок - 1 Цикл
				
				СтрокаТаблицы = Строки[индСтрок];
				
				МассивКОМ.SetValue(0, индСтрок, Строка(СтрокаТаблицы.Артикул));
				МассивКОМ.SetValue(1, индСтрок, Строка(СтрокаТаблицы.ДляАппарата));
				МассивКОМ.SetValue(2, индСтрок, Строка(СтрокаТаблицы.ДляБренда));
				МассивКОМ.SetValue(3, индСтрок, Строка(СтрокаТаблицы.ДляМоделиУстройства));
				МассивКОМ.SetValue(4, индСтрок, Строка(СтрокаТаблицы.ТипАксессуара));
				МассивКОМ.SetValue(5, индСтрок, Строка(СтрокаТаблицы.Характеристика));
				МассивКОМ.SetValue(6, индСтрок, Строка(СтрокаТаблицы.Производитель));
				МассивКОМ.SetValue(7, индСтрок, Строка(СтрокаТаблицы.Серия));
				МассивКОМ.SetValue(8, индСтрок, Строка(СтрокаТаблицы.Распродажа));
				МассивКОМ.SetValue(9, индСтрок, Строка(СтрокаТаблицы.ДоступноеКоличество));
				МассивКОМ.SetValue(10, индСтрок, Число(СтрокаТаблицы.Стоимость));
				
				МассивКОМ.SetValue(13, индСтрок, ?(СтрокаТаблицы.ПродажиКоличество > 0,"Да","Нет"));
				МассивКОМ.SetValue(14, индСтрок, Формат(СтрокаТаблицы.ДатаВыпуска,"ДФ=dd.MM.yyyy; ДП=-"));
				
				МассивКОМ.SetValue(15, индСтрок, Строка(СтрокаТаблицы.Топ));
				МассивКОМ.SetValue(16, индСтрок, Строка(СтрокаТаблицы.Новинка));
				МассивКОМ.SetValue(17, индСтрок, Строка(СтрокаТаблицы.СсылкаWeb));   
				МассивКОМ.SetValue(18, индСтрок, Строка(СтрокаТаблицы.СсылкаНаАрхивФото)); 
			КонецЦикла;
			
			Лист.Range(Лист.Cells(НомерСтроки,15), Лист.Cells(КоличествоСтрок,15)).NumberFormat = "ДД.ММ.ГГГГ";  
			Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,1)).NumberFormat   = "@";  
			
			Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,19)).Value = МассивКОМ;  
			
			Лист.Range(Лист.Cells(НомерСтроки,13), Лист.Cells(КоличествоСтрок,13)).formulaLocal = "=ЕСЛИ([@[ЗАКАЗ (кол-во)]]>0;[@Стоимость]*[@[ЗАКАЗ (кол-во)]];"""")";
			//Добавить гиперссылку в 2 колонки
			//Добавить формулу
			Для Строка = 8 по КоличествоСтрок Цикл
				
				индСтрок = Строка - НомерСтроки;
				СтрокаТаблицы = Строки[индСтрок];
				Ячейка = Лист.Cells(Строка, 15);
				Если ЗначениеЗаполнено(СтрокаТаблицы.ДатаВыпуска) Тогда
					Попытка
						ТекДата = Дата(СтрокаТаблицы.ДатаВыпуска);
						Если ТекДата > ПроверкаДатаВыпуска Тогда
							Ячейка.Value = ТекДата;
						Иначе
							ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - Артикул:" + СтрокаТаблицы.Номенклатура.Артикул + ", некорректная дата выпуска");
						КонецЕсли;
					ИСключение
						ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - Артикул:" + СтрокаТаблицы.Номенклатура.Артикул + ", некорректная дата выпуска");
					КонецПопытки;	
				КонецЕсли;	
				
				Ячейка = Лист.Cells(Строка, 18);
				Ячейка.formulaLocal = "=ГИПЕРССЫЛКА("""+Ячейка.Value+""";""Ссылка на веб"")";
				//Лист.Hyperlinks.Add(Ячейка, Ячейка.Value);
				Ячейка = Лист.Cells(Строка, 19);
				Ячейка.formulaLocal = "=ГИПЕРССЫЛКА("""+Ячейка.Value+""";""Ссылка на архив фото"")";
				//Лист.Hyperlinks.Add(Ячейка, Ячейка.Value);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - конец прайс клиента " + ТекСтрока.Клиент);
	
	#КонецОбласти
	
	#Область РазбикаПрайсаПоЛистам
	
	ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - начало разбивка по листам клиента " + ТекСтрока.Клиент);
	
	//Выборка	= ПолучитьСтрокиДляЗаполненияФайлаПрайсСРазбивкойНовый2(СписокНоменклатурыДляРассылки, Цена, Клиент, ПредЗаказ);
	
	ВыборкаСРазбивкой.Сбросить();
	ЕстьВыборкаПоЦене = Ложь;
	Пока ВыборкаСРазбивкой.Следующий() Цикл
		Если ВыборкаСРазбивкой.ВидЦены = Цена Тогда
			Выборка = ВыборкаСРазбивкой.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ЕстьВыборкаПоЦене = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Если Не Выборка.Следующий() или Не ЕстьВыборкаПоЦене Тогда
		ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - нет данных для формирования прайса");
	Иначе
		ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - начало обработки выборки разбивка по листам клиента " + ТекСтрока.Клиент);
		Выборка.Сбросить();
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(""+Выборка.Количество());
		Пока Выборка.Следующий() Цикл
			ТекЛист = СокрЛП(Выборка.ЛистПрайса);
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ТекЛист "+ТекЛист);
			Если ТекЛист = "Не в прайсе" Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - получение листа ексель разбивка по листам клиента " + ТекСтрока.Клиент);
				Лист 						= Книга.WorkSheets(ТекЛист);
				ЕстьЛист = Истина
			Исключение
				ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не удалось найти лист "+ТекЛист+" в шаблоне для клиента " + Клиент);
				ЕстьЛист = Ложь;
			КонецПопытки;
			
			Если ЕстьЛист Тогда
				
				ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - заполнение листа ексель разбивка по листам клиента " + ТекСтрока.Клиент);
				
				Строки = Выборка.Выбрать();
				
				Лист.UnProtect();
				Ячейка = Лист.Cells(1, 5);
				Ячейка.Value = Заголовок;
				Ячейка = Лист.Cells(3, 6);
				Ячейка.Value = ТелефонОсновногоМенеджера;
				Ячейка = Лист.Cells(4, 5);
				Ячейка.Value = EmailОсновногоМенеджера;
				НомерСтроки = 8;
				
				//Область = Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,16));
				
				Если ТекЛист = "Аксессуары" Тогда
					ЗаполнитьАксессуары(Строки, Лист, НомерСтроки);
				ИначеЕсли ТекЛист = "Кабеля и прочее" Тогда
					Если ПредЗаказ Тогда
						ЗаполнитьКабеляПредЗаказ(Строки, Лист, НомерСтроки);	
					Иначе	
						ЗаполнитьКабеля(Строки, Лист, НомерСтроки);
					КонецЕсли;
				ИначеЕсли ТекЛист = "Чехлы, накладки, стекла" Тогда
					Книга.Worksheets("Чехлы, накладки, стекла").Activate();
					Если ПредЗаказ Тогда
						ЗаполнитьЧехлыПредЗаказ(Строки, Лист, НомерСтроки);
					Иначе											
						ЗаполнитьЧехлы(Строки, Лист, НомерСтроки);
					КонецЕсли;
				Иначе
					ЗаполнитьОстальные(Строки, Лист, НомерСтроки);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - конец разбивка по листам клиента " + ТекСтрока.Клиент);
	
	#КонецОбласти
	
	#Область РекомендацииПоРасширениюМатрицы
	
	ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - начало рекомендции клиента " + ТекСтрока.Клиент);
	
	
	//Попытка
	//	Лист 						= Книга.WorkSheets("Реком._по_расш._матрицы");
	//	ЕстьЛист = Истина
	//Исключение
	//	ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не удалось найти лист Реком._по_расш._матрицы в шаблоне для клиента " + Клиент);
	//	ЕстьЛист = Ложь;
	//КонецПопытки;
	
	ЕстьЛист = Ложь;
	
	Если ЕстьЛист Тогда
		Строки 						= ПолучитьСтрокиДляЗаполненияФайлаНовинки(СписокНоменклатурыДляРассылки, Цена, Клиент);
		Если Строки = Неопределено Тогда
			ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - нет данных для формирования листа Новинки для клиента " + Клиент);
		Иначе
			
			Лист.UnProtect();
			
			Ячейка = Лист.Cells(1, 5);
			Ячейка.Value = Заголовок;
			Ячейка = Лист.Cells(3, 6);
			Ячейка.Value = ТелефонОсновногоМенеджера;
			Ячейка = Лист.Cells(4, 5);
			Ячейка.Value = EmailОсновногоМенеджера;
			НомерСтроки = 8;
			
			КоличествоСтрок = НомерСтроки + Строки.Количество() -1;
			
			//Область = Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,16));
			
			ВсегоСтрок 		= Строки.Количество();
			ВсегоКолонок 	= 18;
			
			МассивКОМ = Новый COMSafeArray("VT_VARIANT", ВсегоКолонок, ВсегоСтрок);
			
			Для индСтрок = 0 По ВсегоСтрок - 1 Цикл
				
				СтрокаТаблицы = Строки[индСтрок];
				
				МассивКОМ.SetValue(0, индСтрок, Строка(СтрокаТаблицы.Артикул));
				МассивКОМ.SetValue(1, индСтрок, Строка(СтрокаТаблицы.ДляАппарата));
				МассивКОМ.SetValue(2, индСтрок, Строка(СтрокаТаблицы.ДляБренда));
				МассивКОМ.SetValue(3, индСтрок, Строка(СтрокаТаблицы.ДляМоделиУстройства));
				МассивКОМ.SetValue(4, индСтрок, Строка(СтрокаТаблицы.ТипАксессуара));
				МассивКОМ.SetValue(5, индСтрок, Строка(СтрокаТаблицы.Характеристика));
				МассивКОМ.SetValue(6, индСтрок, Строка(СтрокаТаблицы.Производитель));
				МассивКОМ.SetValue(7, индСтрок, Строка(СтрокаТаблицы.Серия));
				МассивКОМ.SetValue(8, индСтрок, Строка(СтрокаТаблицы.Распродажа));
				МассивКОМ.SetValue(9, индСтрок, Строка(СтрокаТаблицы.ДоступноеКоличество));
				МассивКОМ.SetValue(10, индСтрок, Число(СтрокаТаблицы.Стоимость));
				МассивКОМ.SetValue(13, индСтрок, Формат(СтрокаТаблицы.ДатаВыпуска,"ДФ=dd.MM.yyyy; ДП=-"));
				МассивКОМ.SetValue(14, индСтрок, Строка(СтрокаТаблицы.Топ));
				МассивКОМ.SetValue(15, индСтрок, Строка(СтрокаТаблицы.Новинка));
				МассивКОМ.SetValue(16, индСтрок, Строка(СтрокаТаблицы.СсылкаWeb));   
				МассивКОМ.SetValue(17, индСтрок, Строка(СтрокаТаблицы.СсылкаНаАрхивФото)); 
			КонецЦикла;
			
			Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,1)).NumberFormat   = "@";  							
			Лист.Range(Лист.Cells(НомерСтроки,14), Лист.Cells(КоличествоСтрок,14)).NumberFormat = "ДД.ММ.ГГГГ";  														
			
			Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,18)).Value = МассивКОМ;  
			Лист.Range(Лист.Cells(НомерСтроки,13), Лист.Cells(КоличествоСтрок,13)).formulaLocal = "=ЕСЛИ([@[ЗАКАЗ (кол-во)]]>0;[@Стоимость]*[@[ЗАКАЗ (кол-во)]];"""")";
			//Добавить гиперссылку в 2 колонки
			//Добавить формулу
			Для Строка = 8 по КоличествоСтрок Цикл
				
				индСтрок = Строка - 8;
				СтрокаТаблицы = Строки[индСтрок];
				Ячейка = Лист.Cells(Строка, 14);
				Если ЗначениеЗаполнено(СтрокаТаблицы.ДатаВыпуска) Тогда
					Попытка
						ТекДата = Дата(СтрокаТаблицы.ДатаВыпуска);
						Если ТекДата > ПроверкаДатаВыпуска Тогда
							Ячейка.Value = ТекДата;
						Иначе
							ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - Артикул:" + СтрокаТаблицы.Номенклатура.Артикул + ", некорректная дата выпуска");
						КонецЕсли;
					ИСключение
						ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - Артикул:" + СтрокаТаблицы.Номенклатура.Артикул + ", некорректная дата выпуска");
					КонецПопытки;	
				КонецЕсли;	
				
				
				Ячейка = Лист.Cells(Строка, 17);
				Ячейка.formulaLocal = "=ГИПЕРССЫЛКА("""+Ячейка.Value+""";""Ссылка на веб"")";
				//Лист.Hyperlinks.Add(Ячейка, Ячейка.Value);
				Ячейка = Лист.Cells(Строка, 18);
				Ячейка.formulaLocal = "=ГИПЕРССЫЛКА("""+Ячейка.Value+""";""Ссылка на архив фото"")";
				//Лист.Hyperlinks.Add(Ячейка, Ячейка.Value);                    								
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - конец рекомендации клиента " + ТекСтрока.Клиент);
	
	
	#КонецОбласти
	
	#Область Матрица_Аппаратов
	
	ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - начало матрица клиента " + ТекСтрока.Клиент);
	
	
	Попытка
		Лист 						= Книга.WorkSheets("Матрица_аппаратов");
		ЕстьЛист = Истина
	Исключение
		ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не удалось найти лист Матрица_аппаратов в шаблоне для клиента " + Клиент);
		ЕстьЛист = Ложь;
	КонецПопытки;
	
	Если ЕстьЛист Тогда
		//СтрокиМатрицыАппаратов 						= ПолучитьСтрокиДляМатрицыАппаратов();
		Если СтрокиМатрицыАппаратов = Неопределено Тогда
			ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - нет данных для формирования листа Матрица_аппаратов для клиента " + Клиент);
		Иначе
			Лист.UnProtect();
			
			НомерСтроки = 10;
			
			КоличествоСтрок = НомерСтроки + СтрокиМатрицыАппаратов.Количество() -1;
			
			//Область = Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,16));
			
			ВсегоСтрок 		= СтрокиМатрицыАппаратов.Количество();
			ВсегоКолонок 	= 7;
			
			МассивКОМ = Новый COMSafeArray("VT_VARIANT", ВсегоКолонок, ВсегоСтрок);
			
			Для индСтрок = 0 По ВсегоСтрок - 1 Цикл
				
				СтрокаТаблицы = СтрокиМатрицыАппаратов[индСтрок];
				МассивКОМ.SetValue(0, индСтрок, Строка(СтрокаТаблицы.Бренд));
				МассивКОМ.SetValue(1, индСтрок, Формат(СтрокаТаблицы.ТипАппарата));
				МассивКОМ.SetValue(2, индСтрок, Строка(СтрокаТаблицы.Наименование));
				МассивКОМ.SetValue(3, индСтрок, Формат(СтрокаТаблицы.Дата,"ДФ=dd.MM.yyyy; ДП=-"));
				//Тарас 
				МассивКОМ.SetValue(4, индСтрок, СтрокаТаблицы.Цена);
				//МассивКОМ.SetValue(2, индСтрок, Число(СтрокаТаблицы.Цена));
				//Тарас 25.12.15
				МассивКОМ.SetValue(5, индСтрок, Строка(СтрокаТаблицы.СсылкаНаМодель));
				МассивКОМ.SetValue(6, индСтрок, Строка(СтрокаТаблицы.СсылкаНаГрафикМоделиЯМ));
				
			КонецЦикла; 
			
			Лист.Range(Лист.Cells(НомерСтроки,4), Лист.Cells(КоличествоСтрок,4)).NumberFormat  = "ДД.ММ.ГГГГ";
			Лист.Range(Лист.Cells(НомерСтроки,2), Лист.Cells(КоличествоСтрок,8)).Value = МассивКОМ; 
			
			Для Строка = НомерСтроки По КоличествоСтрок Цикл
				
				индСтрок = Строка - НомерСтроки;
				СтрокаТаблицы = СтрокиМатрицыАппаратов[индСтрок]; 
				Ячейка = Лист.Cells(Строка, 5);
				Если ЗначениеЗаполнено(СтрокаТаблицы.Дата) Тогда
					Попытка
						ТекДата = Дата(СтрокаТаблицы.Дата);
						Если ТекДата > ПроверкаДатаВыпуска Тогда
							Ячейка.Value = ТекДата;
						Иначе
							ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - Матрица аппаратов:" + СтрокаТаблицы.Наименование + ", некорректная дата выпуска");
						КонецЕсли;	
					Исключение
						ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - Матрица аппаратов:" + СтрокаТаблицы.Наименование + ", некорректная дата выпуска");
					КонецПопытки	
				КонецЕсли;	
				
				Ячейка = Лист.Cells(Строка, 7);
				Ячейка.formulaLocal = "=ГИПЕРССЫЛКА("""+Ячейка.Value+""";""Ссылка на модель"")";
				Ячейка = Лист.Cells(Строка, 8);
				Ячейка.formulaLocal = "=ГИПЕРССЫЛКА("""+Ячейка.Value+""";""Ссылка на ЯМ"")";								
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - конец матрица клиента " + ТекСтрока.Клиент);
	
	
	#КонецОбласти
	
	//edb 2016-01-24 ставим фокус на вкладку - "Прайс"
	//Попытка						
	//	Книга.Worksheets("Прайс").Activate();
	//Исключение
	//КонецПопытки; 
	
	Попытка						
		Книга.Worksheets("Чехлы, накладки, стекла").Activate();
	Исключение
	КонецПопытки;
	
	АдресНаДиске 	= ПолучитьИмяВременногоФайла(ДанныеФайла.Расширение);
	Книга.SaveAs(АдресНаДиске);
	Книга.Close(Истина);
	
	Если сохрдиск Тогда
		
		тт_Цена 	= Цена;
		тт_Цена_тт 	= СтрЗаменить(тт_Цена,"\","_");
		ДД 			= Неопределено;
		ДД 			= Новый ДвоичныеДанные(АдресНаДиске);
		
		Если  Клиент = Справочники.Партнеры.РозничныйПокупатель Тогда
			Попытка
				ДД.Записать("C:\Price_auto\Прайс_" + тт_Цена_тт + ".xlsx");
				ЗаписатьСохранениеПрайсаГотово(Клиент);
			Исключение
				ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не удалось сохранить на диск" + ОписаниеОшибки());
			КонецПопытки;	
			//ДД.Записать("C:\Users\Administrator\Documents\Прайс_" + тт_Цена_тт + ".xlsx");
		Иначе	
			СоздатьКаталог("C:\Price_auto\"+НаименованиеКлиента);
			//СоздатьКаталог("C:\Users\Administrator\Documents\"+НаименованиеКлиента);
			Попытка
				ДД.Записать("C:\Price_auto\"+НаименованиеКлиента+"\Прайс_" + тт_Цена_тт + ".xlsx");
				ЗаписатьСохранениеПрайсаГотово(Клиент);
			Исключение
				ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не удалось сохранить на диск" + ОписаниеОшибки());
			КонецПопытки;
			//ДД.Записать("C:\Users\Administrator\Documents\"+НаименованиеКлиента+"\Прайс_" + тт_Цена_тт + ".xlsx");
		КонецЕсли;
		
	Иначе	
		МассивПрайсов.Добавить(АдресНаДиске);
		СоответствиеЦенаФайл.Вставить(АдресНаДиске, Цена);
	КонецЕсли;

КонецПроцедуры

Функция СформироватьПрайсыКосметика(Клиенты = Неопределено
								,СегментНоменклатуры 				= Неопределено
								,НаДиск 							= Ложь
								,УникальныйИдентификаторДляФайлов 	= Неопределено
								,СписокНоменклатурыДляРассылки 		= Неопределено
								,вхСписокЦен 						= Неопределено
								,ПредЗаказ 	 						= Ложь
								,Рассылать 							= Ложь
								,адреспочты							= Неопределено
								,сохрдиск							= Ложь) Экспорт

	Отладка = Истина;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЕСТЬNULL(НастройкиУчетныхЗаписейЭлектроннойПочты.УчетнаяЗаписьЭлектроннойПочты, ЗНАЧЕНИЕ(Справочник.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты)) КАК УчетнаяЗапись,
	|	НастройкиУчетныхЗаписейЭлектроннойПочты.ОтветственныйЗаОбработкуПисем как Менеджер
	|ИЗ
	|	РегистрСведений.НастройкиУчетныхЗаписейЭлектроннойПочты КАК НастройкиУчетныхЗаписейЭлектроннойПочты
	|");
	
	ТаблицаУчетокМенеджера 	= Запрос.Выполнить().Выгрузить();
    	
	ПроверкаДатаВыпуска = Дата(1900,01,01);
	ДанныеПрайсыКлиентов 	= Новый Структура("Клиенты, ПрайсыКлиентов");
	ПрайсыКлиентов 			= Новый Соответствие;
	ТаблицаКлиентов 		= ПолучитьСписокКлиентовДляРассылкиКосметика(Клиенты, НаДиск, ПредЗаказ);
	МасКлиенты = ТаблицаКлиентов.ВыгрузитьКолонку("Клиент");
	ТаблицаПочтовыхАдресов 	= ПолучитьСписокПочтовыхАдресов(МасКлиенты);
	
	ЕстьВидыЦен = Ложь;
	
	Если вхСписокЦен = Неопределено и ТаблицаКлиентов.Количество() <> 0 Тогда
		СписокЦенВсехКлиентов 	= ПолучитьСписокЦенВсехКлиентов(ТаблицаКлиентов.ВыгрузитьКолонку("Клиент"), ПредЗаказ);
		Если СписокЦенВсехКлиентов.Количество() = 0 Тогда
			ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовКосметика",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не найдены виды цен для всех клиентов в текущей выгрузке");
		Иначе
			ЕстьВидыЦен = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Если ТаблицаКлиентов.Количество() <> 0 И Отладка И ЕстьВидыЦен Тогда
		
		ExcelПриложение 				= Новый COMОбъект("Excel.Application");
		ExcelПриложение.Visible 		= 0;
		ExcelПриложение.DisplayAlerts 	= 0;
		ExcelПриложение.ScreenUpdating 	= 0;
		ExcelПриложение.EnableEvents 	= 0;
		ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовЕксельКосметика",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - открытие ексель.");
		
		
		СегментНоменклатуры 			= Неопределено;
		СписокНоменклатурыДляРассылки 	= Неопределено;
		МенеджерВременТаблиц 			= Неопределено;
		
		Для Каждого ТекСтрока Из ТаблицаКлиентов Цикл
			
			Если Рассылать Тогда
				Если Не ЕстьАдресДляРассылки(ТекСтрока.Клиент,адреспочты, ТаблицаПочтовыхАдресов) Тогда
				
					Продолжить;
				
				КонецЕсли;	
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовКосметика",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - начало обработки клиента " + ТекСтрока.Клиент);
			
			Клиент 			= ТекСтрока.Клиент;
			ФайлДляРассылки = ТекСтрока.Файл;
			Если ФайлДляРассылки = Неопределено Тогда
				//Записать в лог файл
				ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовКосметика",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не найден файл прайса для клиента" + ТекСтрока.Наименование);
				Продолжить;
			КонецЕсли;
			
			Если вхСписокЦен = Неопределено Тогда //edb 2016-02-11
				тСписокЦен  = ПолучитьСписокЦен(Клиент, ПредЗаказ);
				СписокЦен 	= тСписокЦен.ВыгрузитьКолонку("ВидЦены");
			Иначе
				СписокЦен 	= вхСписокЦен;
			КонецЕсли;
			
			Если СписокНоменклатурыДляРассылки = Неопределено Тогда //edb 2016-02-11
				//ТекСегментНоменклатуры = ПолучитьСегментНоменклатуры(Клиент);
				//ТекСегментНоменклатуры = ТекСтрока.Сегмент;
				ТекСегментНоменклатуры = "Косметика";
				//Если ТекСегментНоменклатуры = Неопределено Тогда
				Если Не ЗначениеЗаполнено(ТекСегментНоменклатуры) Тогда
					//Записать в лог файл
					ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовКосметика",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не найдены сегменты номенклатуры для клиента" + ТекСтрока.Наименование);
					СписокНоменклатурыДляРассылки = Неопределено;
					Продолжить;
				Иначе 
					Если ТекСегментНоменклатуры <> СегментНоменклатуры Тогда
						СегментНоменклатуры 			= ТекСегментНоменклатуры;
						СписокНоменклатурыДляРассылки 	= ПолучитьСписокНоменклатурыДляРассылкиКосметика(СегментНоменклатуры);
						
						//Если Клиент <> Справочники.Партнеры.РозничныйПокупатель Тогда
							Если МенеджерВременТаблиц <> Неопределено Тогда
								
								МенеджерВременТаблиц.Закрыть();
								
							КонецЕсли;
							
							МенеджерВременТаблиц			= ПолучитьВременныеТаблицыКосметика(ПредЗаказ, СписокНоменклатурыДляРассылки);
						//КонецЕсли;
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			
			Если СписокНоменклатурыДляРассылки = Неопределено Тогда
				ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовКосметика",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не найдены сегменты номенклатуры для клиента" + ТекСтрока.Наименование);
				Продолжить;
			КонецЕсли;	
			
			ДанныеФайла 		= ПрисоединенныеФайлы.ПолучитьДанныеФайла(ФайлДляРассылки);
			ДвоичныеДанные 		= ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ФайлДляРассылки);
			//АдресНаДискеШаблон 	= ПолучитьИмяВременногоФайла(ДанныеФайла.Расширение);
			//ДвоичныеДанные.Записать(АдресНаДискеШаблон);
					
			МассивПрайсов 		= Новый Массив;
			МассивПрайсовАдреса = Новый Массив;
			
			СоответствиеЦенаФайл 	= Новый Соответствие;
			EmailОсновногоМенеджера = "";
			
			ФорматДаты = "ДД.ММ.ГГГГ";
			
			Если СписокЦен.Количество() = 0 Тогда
				ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовКосметика",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не найдены виды цен для клиента" + ТекСтрока.Наименование);
				Продолжить;
			Иначе
				НаименованиеКлиента = Клиент.Наименование;
				//заменим спецсимволы \ / ? : * " > < |
				НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"\","_");
				НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"/","_");
				НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"?","_");
				НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,":","_");
				НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"*","_");
				НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"""","_");
				НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"<","_");
				НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,">","_");
				НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"|","_");
				НаименованиеКлиента 	= СокрЛП(НаименованиеКлиента);
				
				//ВыборкаСРазбивкой	= ПолучитьСтрокиДляЗаполненияФайлаПрайсСРазбивкойКосметика(СписокНоменклатурыДляРассылки, СписокЦен, Клиент, ПредЗаказ, МенеджерВременТаблиц);
				
				Для Каждого Цена Из СписокЦен Цикл
					Если СписокНоменклатурыДляРассылки <> Неопределено Тогда
						//Данные для заполнения файла
						Заголовок = "Прайс-лист от ООО ""ДиджитСтайл"" от "+ Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
						ТелефонОсновногоМенеджера	= "вн.:" + ПолучитьТелефон(Клиент.ОсновнойМенеджер); 
						EmailОсновногоМенеджера 	= ПолучитьEmail(Клиент.ОсновнойМенеджер);
						
						АдресНаДискеШаблон 	= ПолучитьИмяВременногоФайла(ДанныеФайла.Расширение);
						ДвоичныеДанные.Записать(АдресНаДискеШаблон);
						
						Попытка
							Книга 						= ExcelПриложение.WorkBooks.Open(СокрЛП(АдресНаДискеШаблон));
						Исключение
							ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовКосметика",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не удалось открыть шаблон для клиента " + Клиент);
							Продолжить;
						КонецПопытки;
				
						#Область ПрайсКосметика
						Попытка
							Лист 						= Книга.WorkSheets("Прайс косметика");
							ЕстьЛист = Истина
						Исключение
							ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовКосметика",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не удалось найти лист Прайс в шаблоне для клиента " + Клиент);
							ЕстьЛист = Ложь;
							Продолжить;
						КонецПопытки;
						
						Если ЕстьЛист Тогда
							
							ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовКосметика",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - начало прайс клиента " + ТекСтрока.Клиент);
			
							
							Строки 	= ПолучитьСтрокиДляЗаполненияФайлаКосметика(СписокНоменклатурыДляРассылки, Цена, Клиент,МенеджерВременТаблиц);
							Если Строки = Неопределено Тогда
								ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовКосметика",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - нет данных для формирования прайса");
							Иначе
								Лист.UnProtect();
								НомерСтроки = 2;
								
								КоличествоСтрок = НомерСтроки + Строки.Количество() -1;
								
								ВсегоСтрок 		= Строки.Количество();
								ВсегоКолонок 	= 18;
								
								МассивКОМ = Новый COMSafeArray("VT_VARIANT", ВсегоКолонок, ВсегоСтрок);
								
								Для индСтрок = 0 По ВсегоСтрок - 1 Цикл
									
									СтрокаТаблицы = Строки[индСтрок];
									
									МассивКОМ.SetValue(0, индСтрок, Строка(СтрокаТаблицы.ШтрихКод));
									МассивКОМ.SetValue(1, индСтрок, Строка(СтрокаТаблицы.Артикул));
									МассивКОМ.SetValue(2, индСтрок, Строка(СтрокаТаблицы.Страна));
									МассивКОМ.SetValue(3, индСтрок, Строка(СтрокаТаблицы.Категория));
									МассивКОМ.SetValue(4, индСтрок, Строка(СтрокаТаблицы.Назначение));
									МассивКОМ.SetValue(5, индСтрок, Строка(СтрокаТаблицы.ТипКосметики));
									МассивКОМ.SetValue(6, индСтрок, Строка(СтрокаТаблицы.Бренд));
									МассивКОМ.SetValue(7, индСтрок, Строка(СтрокаТаблицы.Наименование));
									//Если СтрокаТаблицы.ОбъемЗнаменатель Тогда
									//	МассивКОМ.SetValue(8, индСтрок, Число((СтрокаТаблицы.ОбъемЧислитель / СтрокаТаблицы.ОбъемЗнаменатель)*СтрокаТаблицы.ДоступноеКоличествоЧисло));
									//КонецЕсли;
									//объем берем из наименования характеристики
									МассивКОМ.SetValue(8, индСтрок, Строка(СтрокаТаблицы.Характеристика));
									МассивКОМ.SetValue(9, индСтрок, Число(СтрокаТаблицы.ДоступноеКоличествоЧисло));
									МассивКОМ.SetValue(10, индСтрок, Число(СтрокаТаблицы.Стоимость));
									МассивКОМ.SetValue(11, индСтрок, Число(СтрокаТаблицы.СтоимостьРРЦ));
									
									МассивКОМ.SetValue(14, индСтрок, Строка(СтрокаТаблицы.НаименованиеАнгл));
									МассивКОМ.SetValue(15, индСтрок, Строка(СтрокаТаблицы.Описание));
									
									МассивКОМ.SetValue(16, индСтрок, Строка(СтрокаТаблицы.Состав));
									//МассивКОМ.SetValue(17, индСтрок, Строка(СтрокаТаблицы.СсылкаWEB)); 
								КонецЦикла;
								
								Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,18)).Value = МассивКОМ;  
								
								Лист.Range(Лист.Cells(НомерСтроки,14), Лист.Cells(КоличествоСтрок,14)).formulaLocal = "=ЕСЛИ([@[Заказ (кол-во)]]>0;[@[Заказ (кол-во)]]*[@Цена];"""")";
								//Добавить гиперссылку в 2 колонки
								//Добавить формулу
								//Для Строка = 2 по КоличествоСтрок Цикл
								//	
								//	индСтрок = Строка - НомерСтроки;
								//	СтрокаТаблицы = Строки[индСтрок];
								//										
								//	Ячейка = Лист.Cells(Строка, 17);
								//	Ячейка.formulaLocal = "=ГИПЕРССЫЛКА("""+Ячейка.Value+""";""Ссылка на фото"")";
								//	
								//КонецЦикла;
							КонецЕсли;
						КонецЕсли;
						
						ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовКосметика",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - конец прайс клиента " + ТекСтрока.Клиент);
			
						#КонецОбласти
						
						Попытка						
							Книга.Worksheets("Прайс косметика").Activate();
						Исключение
						КонецПопытки;
						
						АдресНаДиске 	= ПолучитьИмяВременногоФайла(ДанныеФайла.Расширение);
						Книга.SaveAs(АдресНаДиске);
						Книга.Close(Истина);
						
						Если сохрдиск Тогда
													
							тт_Цена 	= Цена;
							тт_Цена_тт 	= СтрЗаменить(тт_Цена,"\","_");
							ДД 			= Неопределено;
							ДД 			= Новый ДвоичныеДанные(АдресНаДиске);
							
							Если  Клиент = Справочники.Партнеры.РозничныйПокупатель Тогда
								СоздатьКаталог("C:\Price_auto\Общая\Прайсы для всех");
								Попытка
									ДД.Записать("C:\Price_auto\Общая\Прайсы для всех\Прайс_косметика_" + тт_Цена_тт + ".xlsx");
									ЗаписатьСохранениеПрайсаГотово(Клиент);
								Исключение
									ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовКосметика",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не удалось сохранить на диск" + ОписаниеОшибки());
								КонецПопытки;	
								//ДД.Записать("C:\Users\Administrator\Documents\Прайс_" + тт_Цена_тт + ".xlsx");
							Иначе	
								НаименованиеОсновногоМенеджера = СокрЛП(Клиент.ОсновнойМенеджер);
								Если ЗначениеЗаполнено(НаименованиеОсновногоМенеджера) Тогда
									НаименованиеКаталога = "C:\Price_auto\"+НаименованиеОсновногоМенеджера+"\"+НаименованиеКлиента;
								Иначе
									НаименованиеКаталога = "C:\Price_auto\"+НаименованиеКлиента;
								КонецЕсли;	
								
								СоздатьКаталог(НаименованиеКаталога);
								
								//СоздатьКаталог("C:\Users\Administrator\Documents\"+НаименованиеКлиента);
								Попытка
									ДД.Записать(НаименованиеКаталога+"\Прайс_косметика_" + тт_Цена_тт + ".xlsx");
									ЗаписатьСохранениеПрайсаГотово(Клиент);
								Исключение
									ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовКосметика",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не удалось сохранить на диск" + ОписаниеОшибки());
								КонецПопытки;
								//ДД.Записать("C:\Users\Administrator\Documents\"+НаименованиеКлиента+"\Прайс_" + тт_Цена_тт + ".xlsx");
							КонецЕсли;
							
						Иначе	
							МассивПрайсов.Добавить(АдресНаДиске);
							СоответствиеЦенаФайл.Вставить(АдресНаДиске, Цена);
						КонецЕсли;
					Иначе
						//Записать в лог файл
						ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не найдены сегменты номенклатуры для клиента" + ТекСтрока.Наименование);
						Продолжить;
					КонецЕсли;
				КонецЦикла;
				
				Если Рассылать Тогда
					ОтправитьПрайсКлиенту(адреспочты, Клиент, МассивПрайсов, СоответствиеЦенаФайл, ТаблицаПочтовыхАдресов, ТаблицаУчетокМенеджера, ТекСтрока);
				ИначеЕсли сохрдиск Тогда
				Иначе
					СоответствиеЦенаФайлАдрес 	= Новый Соответствие;
					МассивПрайсовАдрес 			= Новый Массив;
					
					Для Каждого ТекЭлемент Из МассивПрайсов Цикл
						тт_Цена 	= СоответствиеЦенаФайл.Получить(ТекЭлемент);
						
						ДвоичныеДанныеФайл = Новый ДвоичныеДанные(ТекЭлемент); 
						Если УникальныйИдентификаторДляФайлов = Неопределено Тогда
							Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайл);
						Иначе	
							Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайл, УникальныйИдентификаторДляФайлов);
						КонецЕсли;	
						ДвоичныеДанныеФайл = Неопределено;
						МассивПрайсовАдрес.Добавить(Адрес);
						СоответствиеЦенаФайлАдрес.Вставить(Адрес, тт_Цена);
					КонецЦикла;
					
					ДанныеПоПрайсамКлиента = Новый Структура("МассивПрайсов, СоответствиеЦенаФайл, НаименованиеКлиента", МассивПрайсовАдрес, СоответствиеЦенаФайлАдрес, Клиент.Наименование);
					
					ПрайсыКлиентов.Вставить(Клиент, ДанныеПоПрайсамКлиента);
				КонецЕсли;			
			КонецЕсли;
			
			Для Каждого ТекЭлемент Из МассивПрайсов Цикл
				УдалитьФайлы(ТекЭлемент);
			КонецЦикла;
			
			МассивПрайсов = Неопределено;
			
			УдалитьФайлы(АдресНаДискеШаблон);
			
			ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовКосметика",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - конец обработки клиента " + ТекСтрока.Клиент);
			
		КонецЦикла;
		
		Попытка
			//ExcelПриложение.DisplayAlerts = 0;
			//Книга.Close();
			ExcelПриложение.DisplayAlerts = 1;
			ExcelПриложение.Quit();
			ExcelПриложение = Неопределено;
			ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовЕксельКосметика",УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - закрытие ексель");
		Исключение
			ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовЕксельКосметика",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не удалось закрыть Excel");
		КонецПопытки;
		
	Иначе
		//Записать в лог файл
		ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсовКосметика",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не найдены клиенты для рассылки");
	КонецЕсли;
	
	Если Клиенты = Неопределено Тогда
		Клиенты = ТаблицаКлиентов.ВыгрузитьКолонку("Клиент");
	КонецЕсли;	
	
	ДанныеПрайсыКлиентов.ПрайсыКлиентов = ПрайсыКлиентов;
	ДанныеПрайсыКлиентов.Клиенты 		= Клиенты;
	
	Возврат ДанныеПрайсыКлиентов;

КонецФункции

Функция ЕстьАдресДляРассылки(Знач Клиент,Знач адреспочты,Знач ТаблицаПочтовыхАдресов)
	НайденныеАдреса = ТаблицаПочтовыхАдресов.НайтиСтроки(Новый Структура("Клиент", Клиент));
	КомуПредставление = "";

	
	Если ЗначениеЗаполнено(адреспочты) Тогда
		КомуПредставление = КомуПредставление + СокрЛП(адреспочты) + "; "
	иначе	
		Для Каждого ТекЭлемент Из НайденныеАдреса Цикл
			КомуПредставление = КомуПредставление + СокрЛП(ТекЭлемент.Кому) + "; "
		КонецЦикла;
	КонецЕсли;	

	Если ЗначениеЗаполнено(КомуПредставление) Тогда
		Возврат Истина;
	Иначе
		ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не удалось отправить письмо, не указаны адреса для клиента " + Клиент);
		//ЗаписатьРассылкаГотова(Клиент);
		Возврат Ложь;
	КонецЕсли;	
КонецФункции // ЕстьАДресДляРАссылки()

Процедура ОтправитьПрайсКлиенту(Знач адреспочты, Знач Клиент, Знач МассивПрайсов, Знач СоответствиеЦенаФайл, Знач ТаблицаПочтовыхАдресов, Знач ТаблицаУчетокМенеджера, Знач ТекСтрока)
	
	Перем Вложения, ДД, КомуПредставление, НаименованиеКлиента, НайденныеАдреса, НайденныеУчетки, ПараметрыПисьма, ТекЭлемент, тт_Цена, тт_Цена_тт, УчетнаяЗапись;
	
	ПараметрыПисьма = Новый Структура;
	НайденныеАдреса = ТаблицаПочтовыхАдресов.НайтиСтроки(Новый Структура("Клиент", Клиент));
	КомуПредставление = "";
	
	Если ЗначениеЗаполнено(адреспочты) Тогда
		КомуПредставление = КомуПредставление + СокрЛП(адреспочты) + "; "
	иначе	
		Для Каждого ТекЭлемент Из НайденныеАдреса Цикл
			КомуПредставление = КомуПредставление + СокрЛП(ТекЭлемент.Кому) + "; "
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КомуПредставление) Тогда
		
		ПараметрыПисьма.Вставить("Кому", КомуПредставление);
		ПараметрыПисьма.Вставить("Тема", "Прайс-лист ООО ""ДиджитСтайл"" от "+Формат(ТекущаяДата(),"ДФ=dd.MM.yy"));
		ПараметрыПисьма.Вставить("Тело", "Добрый день!" + Символы.ПС + "Высылаем Вам актуальный прайс-лист от " + Формат(ТекущаяДата(),"ДФ=dd.MM.yy") + " (во вложении).");
		//Счетчик = 1;
		Вложения = Новый Соответствие;
		
		НаименованиеКлиента = Клиент.Наименование;
		//заменим спецсимволы \ / ? : * " > < |
		НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"\","_");
		НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"/","_");
		НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"?","_");
		НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,":","_");
		НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"*","_");
		НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"""","_");
		НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"<","_");
		НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,">","_");
		НаименованиеКлиента 	= СтрЗаменить(НаименованиеКлиента,"|","_");
		НаименованиеКлиента 	= СокрЛП(НаименованиеКлиента);
		
		Для Каждого ТекЭлемент Из МассивПрайсов Цикл
			//тт_Цена 	= Строка(Цена);
			тт_Цена 	= СоответствиеЦенаФайл.Получить(ТекЭлемент);
			тт_Цена_тт 	= СтрЗаменить(тт_Цена,"\","_");
			ДД 			= Неопределено;
			//ДД 		= ПолучитьИзВременногоХранилища(ТекЭлемент);
			ДД 			= Новый ДвоичныеДанные(ТекЭлемент);
			Вложения.Вставить("Прайс_" + тт_Цена_тт + ".xlsx", ДД);
		КонецЦикла;
		
		ПараметрыПисьма.Вставить("Вложения", Вложения);
		
		НайденныеУчетки = ТаблицаУчетокМенеджера.НайтиСтроки(Новый Структура("Менеджер", Клиент.ОсновнойМенеджер));
		
		Если НайденныеУчетки.Количество() = 0 Тогда
			УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
		Иначе
			УчетнаяЗапись = НайденныеУчетки[0].УчетнаяЗапись;
		КонецЕсли;
		
		Попытка
			РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			ЗаписатьРассылкаГотова(Клиент);
		Исключение
			ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не удалось отправить письмо" + ОписаниеОшибки());
		КонецПопытки;
	Иначе
		ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - не удалось отправить письмо, не указаны адреса для клиента " + ТекСтрока.Клиент);
	КонецЕсли;

КонецПроцедуры // СформироватьПрайсы()

Процедура ЗаполнитьАксессуары(СтрокаТаблицы, Лист, НомерСтроки)

	КоличествоСтрок = НомерСтроки + СтрокаТаблицы.Количество() -1;
	
	ВсегоСтрок 		= СтрокаТаблицы.Количество();
	ВсегоКолонок 	= 15;
	//ВсегоКолонок 	= 50;
	МассивКОМ = Новый COMSafeArray("VT_VARIANT", ВсегоКолонок, ВсегоСтрок);
	индСтрок = 0;
	//Для индСтрок = 0 По ВсегоСтрок - 1 Цикл
	Пока СтрокаТаблицы.Следующий() Цикл	
		//СтрокаТаблицы = Строки[индСтрок];
		
		МассивКОМ.SetValue(0, индСтрок, Строка(СтрокаТаблицы.Артикул));
		МассивКОМ.SetValue(1, индСтрок, Строка(СтрокаТаблицы.ТипАксессуара));
		МассивКОМ.SetValue(2, индСтрок, Строка(СтрокаТаблицы.Характеристика));
		МассивКОМ.SetValue(3, индСтрок, Строка(СтрокаТаблицы.Производитель));
		МассивКОМ.SetValue(4, индСтрок, Строка(СтрокаТаблицы.Серия));
		МассивКОМ.SetValue(5, индСтрок, Строка(СтрокаТаблицы.Распродажа));
		МассивКОМ.SetValue(6, индСтрок, Строка(СтрокаТаблицы.ДоступноеКоличество));
		МассивКОМ.SetValue(7, индСтрок, Число(СтрокаТаблицы.Стоимость));
		
		МассивКОМ.SetValue(10, индСтрок, ?(СтрокаТаблицы.ПродажиКоличество > 0 или СтрокаТаблицы.ОборотРелиз > 0,"Да","Нет"));
		МассивКОМ.SetValue(11, индСтрок, Строка(СтрокаТаблицы.Топ));
		МассивКОМ.SetValue(12, индСтрок, Строка(СтрокаТаблицы.Новинка));
		МассивКОМ.SetValue(13, индСтрок, Строка(СтрокаТаблицы.СсылкаWeb));   
		МассивКОМ.SetValue(14, индСтрок, Строка(СтрокаТаблицы.СсылкаНаАрхивФото)); 
		//МассивКОМ.SetValue(49, индСтрок, Число(СтрокаТаблицы.ЕстьВМатрицеКлиента));
		индСтрок = индСтрок + 1;
	КонецЦикла;
	
	Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,1)).NumberFormat   = "@";  
	
	Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,15)).Value = МассивКОМ;  
	
	Лист.Range(Лист.Cells(НомерСтроки,10), Лист.Cells(КоличествоСтрок,10)).formulaLocal = "=ЕСЛИ([@[ЗАКАЗ (кол-во)]]>0;[@Стоимость]*[@[ЗАКАЗ (кол-во)]];"""")";
	//Добавить гиперссылку в 2 колонки
	//Добавить формулу
	Для Строка = 8 по КоличествоСтрок Цикл
		Ячейка = Лист.Cells(Строка, 14);
		Ячейка.formulaLocal = "=ГИПЕРССЫЛКА("""+Ячейка.Value+""";""Ссылка на веб"")";
		//Лист.Hyperlinks.Add(Ячейка, Ячейка.Value);
		Ячейка = Лист.Cells(Строка, 15);
		Ячейка.formulaLocal = "=ГИПЕРССЫЛКА("""+Ячейка.Value+""";""Ссылка на архив фото"")";
		//Лист.Hyperlinks.Add(Ячейка, Ячейка.Value);
	КонецЦикла;
	
	Лист.Range(Лист.Cells(7,7), Лист.Cells(7,7)).AutoFilter(7,"<>ожид."); //указаваем столбец и значение фильтр
	
	//Лист.Range(Лист.Cells(7,7), Лист.Cells(7,7)).Select();  //выделение области  
	//Область = Worksheet.Range("A10:C15");
	//Область.FormatConditions.Delete();
	//Область.FormatConditions.Add(2, "=$A10>0");
	//Область.FormatConditions(1).Interior.ColorIndex = 35;	
КонецПроцедуры

Функция ПолучитьСписокЦенВсехКлиентов(Клиенты, ПредЗаказ)
	
	Если Не ПредЗаказ Тогда
		Запрос =  Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СоглашенияСКлиентами.ВидЦен
		|ИЗ
		|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
		|ГДЕ
		|	СоглашенияСКлиентами.Партнер В (&Клиенты)
		|	И НЕ СоглашенияСКлиентами.Типовое
		|	И СоглашенияСКлиентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
		|	И СоглашенияСКлиентами.ВидЦен <> ЗНАЧЕНИЕ(справочник.Видыцен.пустаяссылка)");
		
		Запрос.УстановитьПараметр("Клиенты", Клиенты);
		СписокКлиентов = Запрос.Выполнить().Выгрузить();
		Возврат СписокКлиентов.ВыгрузитьКолонку("ВидЦен");
	Иначе
		СписокЦен = Новый Массив;
		НайденнаяСсылка = Справочники.ВидыЦен.НайтиПоНаименованию("Цена без НДС (0 предоплаты)",Истина);
		Если НЕ НайденнаяСсылка.Пустая() Тогда
			СписокЦен.Добавить(НайденнаяСсылка);
		КонецЕсли;	
		
		НайденнаяСсылка = Справочники.ВидыЦен.НайтиПоНаименованию("Цена без НДС (100 предоплаты)",Истина);
		Если НЕ НайденнаяСсылка.Пустая() Тогда
			СписокЦен.Добавить(НайденнаяСсылка);
		КонецЕсли;	
		
		НайденнаяСсылка = Справочники.ВидыЦен.НайтиПоНаименованию("Цена с НДС (0 предоплаты)",Истина);
		Если НЕ НайденнаяСсылка.Пустая() Тогда
			СписокЦен.Добавить(НайденнаяСсылка);
		КонецЕсли;	
		
		НайденнаяСсылка = Справочники.ВидыЦен.НайтиПоНаименованию("Цена с НДС (100 предоплаты)",Истина);
		Если НЕ НайденнаяСсылка.Пустая() Тогда
			СписокЦен.Добавить(НайденнаяСсылка);
		КонецЕсли;	
		
		Возврат СписокЦен;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСписокЦен(Клиент, ПредЗаказ, толькоШКПроизводителя = Ложь)
	
	Если Не ПредЗаказ Тогда
		Запрос =  Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                       |	СоглашенияСКлиентами.ВидЦен КАК ВидЦены,
		                       |	МАКСИМУМ(ЕСТЬNULL(СоглашенияСКлиентамиДополнительныеРеквизиты.Значение, ЛОЖЬ)) КАК РассылкаСШКПроизводителя
		                       |ПОМЕСТИТЬ вт_Врем
		                       |ИЗ
		                       |	Справочник.СоглашенияСКлиентами.ДополнительныеРеквизиты КАК СоглашенияСКлиентамиДополнительныеРеквизиты
		                       |		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
		                       |		ПО СоглашенияСКлиентамиДополнительныеРеквизиты.Ссылка = СоглашенияСКлиентами.Ссылка
		                       |			И (СоглашенияСКлиентамиДополнительныеРеквизиты.Свойство = &ДопРеквизит)
		                       |ГДЕ
		                       |	СоглашенияСКлиентами.Партнер = &Клиент
		                       |	И НЕ СоглашенияСКлиентами.Типовое
		                       |	И СоглашенияСКлиентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
		                       |	И СоглашенияСКлиентами.ВидЦен <> ЗНАЧЕНИЕ(справочник.Видыцен.пустаяссылка)
		                       |
		                       |СГРУППИРОВАТЬ ПО
		                       |	СоглашенияСКлиентами.ВидЦен
		                       |;
		                       |
		                       |////////////////////////////////////////////////////////////////////////////////
		                       |ВЫБРАТЬ
		                       |	вт_Врем.ВидЦены,
		                       |	вт_Врем.РассылкаСШКПроизводителя
		                       |ИЗ
		                       |	вт_Врем КАК вт_Врем
		                       |ГДЕ
		                       |	ВЫБОР
		                       |			КОГДА &толькоШКПроизводителя
		                       |				ТОГДА вт_Врем.РассылкаСШКПроизводителя = &толькоШКПроизводителя
		                       |			ИНАЧЕ ИСТИНА
		                       |		КОНЕЦ");
		
		Запрос.УстановитьПараметр("Клиент", Клиент);
		Запрос.УстановитьПараметр("ДопРеквизит", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("рассылка с шк производителя (Соглашения об условиях продаж)",Истина));
		Запрос.УстановитьПараметр("толькоШКПроизводителя", толькоШКПроизводителя);
		СписокКлиентов = Запрос.Выполнить().Выгрузить();
		Возврат СписокКлиентов;
	Иначе
		СписокЦен = Новый ТаблицаЗначений;
		СписокЦен.Колонки.Добавить("ВидЦены");
		СписокЦен.Колонки.Добавить("РассылкаСШКПроизводителя");
		
		ТекНаименоваие = "Цена без НДС (0 предоплаты)";
		НайтиИДобавитьВидЦены(СписокЦен, ТекНаименоваие);
	
		
		ТекНаименоваие = "Цена без НДС (100 предоплаты)";
		НайтиИДобавитьВидЦены(СписокЦен, ТекНаименоваие);	
		
		ТекНаименоваие = "Цена с НДС (0 предоплаты)";
		НайтиИДобавитьВидЦены(СписокЦен, ТекНаименоваие);	
		
		ТекНаименоваие = "Цена с НДС (100 предоплаты)";
		НайтиИДобавитьВидЦены(СписокЦен, ТекНаименоваие);	
		
		Возврат СписокЦен;
	КонецЕсли;
	
КонецФункции

Процедура НайтиИДобавитьВидЦены(Знач СписокЦен, Знач ТекНаименоваие)
	
	Перем НайденнаяСсылка;
	
	НайденнаяСсылка = Справочники.ВидыЦен.НайтиПоНаименованию(ТекНаименоваие,Истина);
	Если НЕ НайденнаяСсылка.Пустая() Тогда
		ДобавитьЦенуВСписокЦен(НайденнаяСсылка, СписокЦен);
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьЦенуВСписокЦен(НайденнаяСсылка, Знач СписокЦен)
	
	Перем НоваяСтрока;
	
	НоваяСтрока = СписокЦен.Добавить(НайденнаяСсылка);
	НоваяСтрока.ВидЦены = НайденнаяСсылка;
	НоваяСтрока.РассылкаСШКПроизводителя = Ложь;

КонецПроцедуры

Функция ПолучитьСегментНоменклатуры(Клиент) Экспорт
	ДопРеквизитКлиента = Клиент.ДополнительныеРеквизиты.Найти(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Номенклатура для рассылки (Клиенты)"), "Свойство");
	Если  ДопРеквизитКлиента = Неопределено Тогда
		РозничныйПокупатель = Справочники.Партнеры.РозничныйПокупатель;
		ДопРеквизитРозничногоПокупетеля = РозничныйПокупатель.ДополнительныеРеквизиты.Найти(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Номенклатура для рассылки (Клиенты)"), "Свойство");
		Если ДопРеквизитРозничногоПокупетеля = Неопределено Тогда
			Возврат Неопределено;
		Иначе
			Возврат ДопРеквизитРозничногоПокупетеля.Значение;
		КонецЕсли;		
	Иначе
		Возврат ДопРеквизитКлиента.Значение;
	КонецЕсли;
КонецФункции                          

Функция ПолучитьСписокНоменклатурыДляРассылки(СегментНоменклатуры)
	СписокНоменклатуры = СегментыСервер.МассивЭлементов(СегментНоменклатуры);
	Если СписокНоменклатуры.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат СписокНоменклатуры;
	КонецЕсли;
КонецФункции

Функция ПолучитьСписокНоменклатурыДляРассылкиКосметика(СегментНоменклатуры)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураДополнительныеРеквизиты.Ссылка
		|ИЗ
		|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|ГДЕ
		|	НоменклатураДополнительныеРеквизиты.Свойство = &ЛистПрайса
		|	И НоменклатураДополнительныеРеквизиты.Значение.Наименование = ""Косметика""";
	
	Запрос.УстановитьПараметр("ЛистПрайса", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Лист прайса (Справочник ""Номенклатура"" (Общие))"));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда
		Возврат РезультатЗапроса.ВыгрузитьКолонку("Ссылка");	
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции

Функция ПолучитьТелефон(ОсновнойМенеджер)
	Телефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ОсновнойМенеджер,Справочники.ВидыКонтактнойИнформации.ПростыеЗвонкиТелефон); 
	Возврат Телефон;					
КонецФункции

Функция ПолучитьEmail(ОсновнойМенеджер)
	Почта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ОсновнойМенеджер,Справочники.ВидыКонтактнойИнформации.EmailПользователя); 
	Возврат Почта;					
КонецФункции

Функция ПолучитьЦеныЦеновыхГрупп(СоответсвиеЦеновыхГрупп, Цена)
	
	//МассивНаименований = Новый Массив;
	МассивНаименований = Новый ТаблицаЗначений;
	КС = Новый КвалификаторыСтроки(50);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	МассивНаименований.Колонки.Добавить("НаименованиеЦенГруппы",ОписаниеТиповС);	
	Для Каждого КлючЗначЦенГгруппы из СоответсвиеЦеновыхГрупп Цикл
		НоваяСтрока = МассивНаименований.Добавить();
		НоваяСтрока.НаименованиеЦенГруппы = КлючЗначЦенГгруппы.Ключ;
		//МассивНаименований.Добавить(КлючЗначЦенГгруппы.Значение);
	КонецЦикла;	
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблНаим.НаименованиеЦенГруппы
	|ПОМЕСТИТЬ вт_ТаблНаим
	|ИЗ
	|	&МассивНаименование КАК ТаблНаим
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеновыеГруппы.Ссылка
	|ПОМЕСТИТЬ вт_ЦенГруппы
	|ИЗ
	|	Справочник.ЦеновыеГруппы КАК ЦеновыеГруппы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ТаблНаим КАК вт_ТаблНаим
	|		ПО ((ВЫРАЗИТЬ(ЦеновыеГруппы.Наименование КАК СТРОКА(50))) = вт_ТаблНаим.НаименованиеЦенГруппы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ЦенГруппы.Ссылка КАК ЦеноваяГруппа,
	|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
	|	вт_ЦенГруппы.Ссылка.Наименование КАК Наименование
	|ИЗ
	|	вт_ЦенГруппы КАК вт_ЦенГруппы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				,
	|				Номенклатура.ЦеноваяГруппа В
	|						(ВЫБРАТЬ
	|							ВтЦенГрупп.Ссылка
	|						ИЗ
	|							вт_ЦенГруппы КАК ВтЦенГрупп)
	|					И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО вт_ЦенГруппы.Ссылка = ЦеныНоменклатурыСрезПоследних.Номенклатура.ЦеноваяГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_ЦенГруппы.Ссылка,
	|	вт_ЦенГруппы.Ссылка.Наименование";
	
	Запрос.УстановитьПараметр("ВидЦены", Цена);
	Запрос.УстановитьПараметр("МассивНаименование", МассивНаименований);
	
	Возврат Запрос.Выполнить().Выгрузить();
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
КонецФункции // ПолучитьЦеныЦеновыхГрупп(СоответсвиеЦеновыхГрупп)

Функция ПолучитьЦеныЦеновыхГруппНовый(СоответсвиеЦеновыхГрупп, Цена)
	
	//МассивНаименований = Новый Массив;
	МассивНаименований = Новый ТаблицаЗначений;
	КС = Новый КвалификаторыСтроки(50);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	МассивНаименований.Колонки.Добавить("НаименованиеЦенГруппы",ОписаниеТиповС);	
	Для Каждого КлючЗначЦенГгруппы из СоответсвиеЦеновыхГрупп Цикл
		НоваяСтрока = МассивНаименований.Добавить();
		НоваяСтрока.НаименованиеЦенГруппы = КлючЗначЦенГгруппы.Ключ;
		//МассивНаименований.Добавить(КлючЗначЦенГгруппы.Значение);
	КонецЦикла;	
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблНаим.НаименованиеЦенГруппы
	|ПОМЕСТИТЬ вт_ТаблНаим
	|ИЗ
	|	&МассивНаименование КАК ТаблНаим
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеновыеГруппы.Ссылка
	|ПОМЕСТИТЬ вт_ЦенГруппы
	|ИЗ
	|	Справочник.ЦеновыеГруппы КАК ЦеновыеГруппы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ТаблНаим КАК вт_ТаблНаим
	|		ПО ((ВЫРАЗИТЬ(ЦеновыеГруппы.Наименование КАК СТРОКА(50))) = вт_ТаблНаим.НаименованиеЦенГруппы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ЦенГруппы.Ссылка КАК ЦеноваяГруппа,
	|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
	|	вт_ЦенГруппы.Ссылка.Наименование КАК Наименование
	|ИЗ
	|	вт_ЦенГруппы КАК вт_ЦенГруппы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.дп_ЦеныПоЦеновымГруппам.СрезПоследних(
	|				,
	|				ЦеноваяГруппа В
	|						(ВЫБРАТЬ
	|							ВтЦенГрупп.Ссылка
	|						ИЗ
	|							вт_ЦенГруппы КАК ВтЦенГрупп)
	|					И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО вт_ЦенГруппы.Ссылка = ЦеныНоменклатурыСрезПоследних.ЦеноваяГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_ЦенГруппы.Ссылка,
	|	вт_ЦенГруппы.Ссылка.Наименование";
	
	Запрос.УстановитьПараметр("ВидЦены", Цена);
	Запрос.УстановитьПараметр("МассивНаименование", МассивНаименований);
	
	Возврат Запрос.Выполнить().Выгрузить();
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
КонецФункции // ПолучитьЦеныЦеновыхГрупп(СоответсвиеЦеновыхГрупп)

Функция ПолучитьСтрокиДляЗаполненияФайла(СписокНоменклатурыДляРассылки, Цена, Клиент)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Номенклатура.Ссылка КАК Номенклатура,
	                      |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
	                      |ПОМЕСТИТЬ вт_Номенклатура
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                      |		ПО (ХарактеристикиНоменклатуры.Владелец = Номенклатура.Ссылка
	                      |				ИЛИ ХарактеристикиНоменклатуры.Владелец = Номенклатура.ВидНоменклатуры)
	                      |ГДЕ
	                      |	Номенклатура.Ссылка В(&СписокНоменклатурыДляРассылки)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДополнительныеСведения.Объект.Ссылка КАК Номенклатура,
	                      |	ДополнительныеСведения.Значение
	                      |ПОМЕСТИТЬ вт_Номенклатура_Топ
	                      |ИЗ
	                      |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                      |ГДЕ
	                      |	ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура
	                      |	И ДополнительныеСведения.Свойство.Заголовок = ""Топ!!!""
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДополнительныеСведения.Объект.Ссылка КАК Характеристика,
	                      |	ДополнительныеСведения.Значение
	                      |ПОМЕСТИТЬ вт_Характеристика_Новинка
	                      |ИЗ
	                      |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                      |ГДЕ
	                      |	ДополнительныеСведения.Объект ССЫЛКА Справочник.ХарактеристикиНоменклатуры
	                      |	И ДополнительныеСведения.Свойство.Заголовок = ""Новинка!!!""
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СкладыДополнительныеРеквизиты.Ссылка КАК Склад
	                      |ПОМЕСТИТЬ вт_Склады
	                      |ИЗ
	                      |	Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	                      |ГДЕ
	                      |	СкладыДополнительныеРеквизиты.Свойство = &СвойствоС
	                      |	И СкладыДополнительныеРеквизиты.Значение = &ЗначениеС
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Склад
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	                      |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	                      |	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	                      |ПОМЕСТИТЬ ВТ_ШК
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                      |ГДЕ
	                      |	(ШтрихкодыНоменклатуры.Номенклатура, ШтрихкодыНоменклатуры.Характеристика) В
	                      |			(ВЫБРАТЬ
	                      |				Т.Номенклатура,
	                      |				Т.Характеристика
	                      |			ИЗ
	                      |				ВТ_Номенклатура КАК Т)
	                      |	И ШтрихкодыНоменклатуры.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ВложенныйЗапрос.Номенклатура,
	                      |	ВложенныйЗапрос.Характеристика,
	                      |	СУММА(ВложенныйЗапрос.СвободноДляПродажи) КАК СвободноДляПродажи
	                      |ПОМЕСТИТЬ вт_СвободноДляПродажи
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		Т.Номенклатура КАК Номенклатура,
	                      |		Т.Характеристика КАК Характеристика,
	                      |		Т.Склад КАК Склад,
	                      |		Т.ВНаличииОстаток КАК ВНаличииДляПродажи,
	                      |		Т.ВНаличииОстаток КАК СвободноДляПродажи
	                      |	ИЗ
	                      |		РегистрНакопления.СвободныеОстатки.Остатки(, {((Номенклатура, Характеристика) В
	                      |				    (ВЫБРАТЬ
	                      |				        ТаблицаОтбора.Номенклатура КАК Номенклатура,
	                      |				        ТаблицаОтбора.Характеристика КАК Характеристика
	                      |				    ИЗ
	                      |				        ОтборПоСегментуНоменклатуры КАК ТаблицаОтбора
	                      |				    ГДЕ
	                      |				        ТаблицаОтбора.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)) КАК Поле2, (Склад).*, (Номенклатура).*, (Характеристика).*}) КАК Т
	                      |	{ГДЕ
	                      |		Т.Склад.*,
	                      |		Т.Номенклатура.*,
	                      |		Т.Характеристика.*}
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Т.Номенклатура,
	                      |		Т.Характеристика,
	                      |		Т.Склад,
	                      |		0,
	                      |		-Т.НаличиеПодЗаказОстаток
	                      |	ИЗ
	                      |		РегистрНакопления.ОбеспечениеЗаказов.Остатки(, {((Номенклатура, Характеристика) В
	                      |				    (ВЫБРАТЬ
	                      |				        ТаблицаОтбора.Номенклатура КАК Номенклатура,
	                      |				        ТаблицаОтбора.Характеристика КАК Характеристика
	                      |				    ИЗ
	                      |				        ОтборПоСегментуНоменклатуры КАК ТаблицаОтбора
	                      |				    ГДЕ
	                      |				        ТаблицаОтбора.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)) КАК Поле2, (Склад).*, (Номенклатура).*, (Характеристика).*}) КАК Т
	                      |	ГДЕ
	                      |		Т.НаличиеПодЗаказОстаток > 0
	                      |	{ГДЕ
	                      |		Т.Склад.*,
	                      |		Т.Номенклатура.*,
	                      |		Т.Характеристика.*}
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Т.Номенклатура,
	                      |		Т.Характеристика,
	                      |		Т.Склад,
	                      |		0,
	                      |		Т.Количество
	                      |	ИЗ
	                      |		РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Т
	                      |	ГДЕ
	                      |		Т.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1)
	                      |		И Т.Количество < 0
	                      |	{ГДЕ
	                      |		Т.Склад.* КАК Склад,
	                      |		Т.Номенклатура.* КАК Номенклатура,
	                      |		Т.Характеристика.* КАК Характеристика}
	                      |	
						  //|	ОБЪЕДИНИТЬ ВСЕ
						  //|	
						  //|	ВЫБРАТЬ
						  //|		Т.Номенклатура,
						  //|		Т.Характеристика,
						  //|		Т.Склад,
						  //|		0,
						  //|		0
						  //|	ИЗ
						  //|		РегистрНакопления.ТоварыКОтгрузке.Остатки(, {((Номенклатура, Характеристика) В
						  //|				    (ВЫБРАТЬ
						  //|				        ТаблицаОтбора.Номенклатура КАК Номенклатура,
						  //|				        ТаблицаОтбора.Характеристика КАК Характеристика
						  //|				    ИЗ
						  //|				        ОтборПоСегментуНоменклатуры КАК ТаблицаОтбора
						  //|				    ГДЕ
						  //|				        ТаблицаОтбора.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)) КАК Поле2, (Склад).*, (Номенклатура).*, (Характеристика).*}) КАК Т
						  //|	{ГДЕ
						  //|		Т.Склад.*,
						  //|		Т.Номенклатура.*,
						  //|		Т.Характеристика.*}
						  //|	
						  //|	ОБЪЕДИНИТЬ ВСЕ
						  //|	
						  //|	ВЫБРАТЬ
						  //|		Т.Номенклатура,
						  //|		Т.Характеристика,
						  //|		Т.Склад,
						  //|		0,
						  //|		0
						  //|	ИЗ
						  //|		РегистрНакопления.ТоварыНаСкладах.Остатки(, {((Номенклатура, Характеристика) В
						  //|				    (ВЫБРАТЬ
						  //|				        ТаблицаОтбора.Номенклатура КАК Номенклатура,
						  //|				        ТаблицаОтбора.Характеристика КАК Характеристика
						  //|				    ИЗ
						  //|				        ОтборПоСегментуНоменклатуры КАК ТаблицаОтбора
						  //|				    ГДЕ
						  //|				        ТаблицаОтбора.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)) КАК Поле2, (Склад).*, (Номенклатура).*, (Характеристика).*}) КАК Т
						  //|	{ГДЕ
						  //|		Т.Склад.*,
						  //|		Т.Номенклатура.*,
						  //|		Т.Характеристика.*}
						  |) КАК ВложенныйЗапрос
	                      |ГДЕ
	                      |	ВложенныйЗапрос.Склад В
	                      |			(ВЫБРАТЬ
	                      |				вт_Склады.Склад
	                      |			ИЗ
	                      |				вт_Склады)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВложенныйЗапрос.Номенклатура,
	                      |	ВложенныйЗапрос.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	вт_Номенклатура.Номенклатура КАК Номенклатура,
	                      |	ЕСТЬNULL(вт_Номенклатура.Характеристика, """") КАК Характеристика,
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Стоимость,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) > 10
	                      |			ТОГДА "">10""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0)
	                      |	КОНЕЦ КАК ДоступноеКоличество,
	                      |	ЕСТЬNULL(ШК.Штрихкод, """") КАК Артикул,
	                      |	ЕСТЬNULL(вт_Номенклатура.Номенклатура.Производитель, """") КАК Производитель,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""СсылкаWEB""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК СсылкаWEB,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для аппарата""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляАппарата,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для бренда""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляБренда,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Тип аксессуара""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ТипАксессуара,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Серия""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК Серия,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Распродажа""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК Распродажа,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для модели устройства""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляМоделиУстройства,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Заголовок = ""ссылка на фото №2""
	                      |				ТОГДА ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК СсылкаНаАрхивФото,
	                      |	МАКСИМУМ(ЕСТЬNULL(вт_Номенклатура_Топ.Значение, """")) КАК Топ,
	                      |	МАКСИМУМ(ЕСТЬNULL(вт_Характеристика_Новинка.Значение, """")) КАК Новинка,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Дата выхода аппарата""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	                      |		КОНЕЦ) КАК ДатаВыпуска,
	                      |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот, 0)) КАК ПродажиКоличество
	                      |ИЗ
	                      |	вт_Номенклатура КАК вт_Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &Цена) КАК ЦеныНоменклатурыСрезПоследних
	                      |		ПО вт_Номенклатура.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СвободноДляПродажи КАК вт_СвободноДляПродажи
	                      |		ПО вт_Номенклатура.Номенклатура = вт_СвободноДляПродажи.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = вт_СвободноДляПродажи.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	                      |		ПО вт_Номенклатура.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_Номенклатура_Топ КАК вт_Номенклатура_Топ
	                      |		ПО вт_Номенклатура.Номенклатура = вт_Номенклатура_Топ.Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_Характеристика_Новинка КАК вт_Характеристика_Новинка
	                      |		ПО вт_Номенклатура.Характеристика = вт_Характеристика_Новинка.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	                      |		ПО вт_Номенклатура.Номенклатура = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец
	                      |			И вт_Номенклатура.Характеристика = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШК КАК ШК
	                      |		ПО вт_Номенклатура.Номенклатура = ШК.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ШК.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	                      |				,
	                      |				,
	                      |				,
	                      |				АналитикаУчетаНоменклатуры.Номенклатура В
	                      |						(ВЫБРАТЬ
	                      |							ВТНоменклатура.Номенклатура
	                      |						ИЗ
	                      |							вт_Номенклатура КАК ВТНоменклатура)
	                      |					И АналитикаУчетаНоменклатуры.Характеристика В
	                      |						(ВЫБРАТЬ
	                      |							ВТНоменклатура.Характеристика
	                      |						ИЗ
	                      |							вт_Номенклатура КАК ВТНоменклатура)
	                      |					И АналитикаУчетаПоПартнерам.Партнер = &Клиент) КАК ВыручкаИСебестоимостьПродажОбороты
	                      |		ПО вт_Номенклатура.Номенклатура = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика
	                      |			И (ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = &Клиент)
	                      |ГДЕ
	                      |	ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) > 0
	                      |	И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) <> 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	вт_Номенклатура.Номенклатура,
	                      |	ЕСТЬNULL(вт_Номенклатура.Характеристика, """"),
	                      |	ЕСТЬNULL(вт_Номенклатура.Номенклатура.Производитель, """"),
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0),
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) > 10
	                      |			ТОГДА "">10""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0)
	                      |	КОНЕЦ,
	                      |	ЕСТЬNULL(ШК.Штрихкод, """")
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаВыпуска УБЫВ,
	                      |	ДляМоделиУстройства,
	                      |	ТипАксессуара,
	                      |	Номенклатура,
	                      |	Характеристика");
	Запрос.УстановитьПараметр("ЗначениеС", Истина);
	Запрос.УстановитьПараметр("СвойствоС", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Включен в рассылку (Склады и магазины)"));
	Запрос.УстановитьПараметр("Цена", Цена);
	Запрос.УстановитьПараметр("СсылкаWEB", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СсылкаWEB (Справочник ""Номенклатура"" (Общие))"));
	Запрос.УстановитьПараметр("СписокНоменклатурыДляРассылки", СписокНоменклатурыДляРассылки);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Результат =  Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат;
	КонецЕСли;
КонецФункции

Функция ПолучитьСтрокиДляЗаполненияФайлаКосметика(СписокНоменклатурыДляРассылки, Цена, Клиент, МенеджерВременТаблиц)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	вт_Номенклатура.Номенклатура КАК Номенклатура,
	                      |	вт_Номенклатура.Номенклатура.Наименование КАК Наименование,
	                      |	ЕСТЬNULL(вт_Номенклатура.Характеристика, """") КАК Характеристика,
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Стоимость,
	                      |	0 КАК СтоимостьРРЦ,
	                      |	вт_Номенклатура.Номенклатура.Описание КАК Описание,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) > 10
	                      |			ТОГДА "">10""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0)
	                      |	КОНЕЦ КАК ДоступноеКоличество,
						  | ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) как ДоступноеКоличествоЧисло,
						  |	вт_Номенклатура.Номенклатура.ОбъемЗнаменатель КАК ОбъемЗнаменатель,
						  |	вт_Номенклатура.Номенклатура.ОбъемЧислитель КАК ОбъемЧислитель,
	                      |	вт_Номенклатура.Номенклатура.Артикул КАК Артикул,
	                      |	ЕСТЬNULL(ШК.Штрихкод, """") КАК ШтрихКод,
	                      |	ЕСТЬNULL(вт_Номенклатура.Номенклатура.Производитель, """") КАК Производитель,
	                      |	ЕСТЬNULL(вт_Номенклатура.Номенклатура.Марка, """") КАК Бренд,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""СсылкаWEB""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК СсылкаWEB,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Страна производителя""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК Страна,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Категория""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК Категория,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Назначение""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК Назначение,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Тип""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ТипКосметики,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Название ENG""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК НаименованиеАнгл,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Состав косметика""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК Состав
	                      |ИЗ
	                      |	вт_Ном КАК вт_Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &Цена) КАК ЦеныНоменклатурыСрезПоследних
	                      |		ПО вт_Номенклатура.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СвободноДляПродажи КАК вт_СвободноДляПродажи
	                      |		ПО вт_Номенклатура.Номенклатура = вт_СвободноДляПродажи.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = вт_СвободноДляПродажи.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	                      |		ПО вт_Номенклатура.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШК КАК ШК
	                      |		ПО вт_Номенклатура.Номенклатура = ШК.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ШК.Характеристика
	                      //|ГДЕ
	                     // |	ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) > 0
	                     // |	И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) <> 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	вт_Номенклатура.Номенклатура,
	                      |	вт_Номенклатура.Номенклатура.Наименование,
	                      |	вт_Номенклатура.Номенклатура.Артикул,
						  |	вт_Номенклатура.Номенклатура.ОбъемЗнаменатель,
						  |	вт_Номенклатура.Номенклатура.ОбъемЧислитель,
						  | ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0),
	                      |	ЕСТЬNULL(вт_Номенклатура.Номенклатура.Марка, """"),
	                      |	ЕСТЬNULL(вт_Номенклатура.Характеристика, """"),
	                      |	ЕСТЬNULL(вт_Номенклатура.Номенклатура.Производитель, """"),
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0),
	                      |	вт_Номенклатура.Номенклатура.Описание,
	                      |	ЕСТЬNULL(ШК.Штрихкод, """"),
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) > 10
	                      |			ТОГДА "">10""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0)
	                      |	КОНЕЦ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Номенклатура,
	                      |	Характеристика");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременТаблиц;					  
	Запрос.УстановитьПараметр("Цена", Цена);
	Запрос.УстановитьПараметр("СписокНоменклатурыДляРассылки", СписокНоменклатурыДляРассылки);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Результат =  Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат;
	КонецЕСли;
КонецФункции

Функция ПолучитьСтрокиДляЗаполненияФайлаПрайсСРазбивкой(СписокНоменклатурыДляРассылки, Цена, Клиент, ПредЗаказ)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Номенклатура.Ссылка КАК Номенклатура,
	                      |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	                      |	НоменклатураДополнительныеРеквизиты.Значение КАК ЛистПрайса
	                      |ПОМЕСТИТЬ вт_Номенклатура
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                      |		ПО (ХарактеристикиНоменклатуры.Владелец = Номенклатура.Ссылка
	                      |				ИЛИ ХарактеристикиНоменклатуры.Владелец = Номенклатура.ВидНоменклатуры)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	                      |		ПО (НоменклатураДополнительныеРеквизиты.Ссылка = Номенклатура.Ссылка)
	                      |ГДЕ
	                      |	Номенклатура.Ссылка В(&СписокНоменклатурыДляРассылки)
	                      |	И НоменклатураДополнительныеРеквизиты.Свойство = &ЛистПрайса
	                      |	И НоменклатураДополнительныеРеквизиты.Значение <> ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Номенклатура.Ссылка,
	                      |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	                      |	НоменклатураДополнительныеРеквизиты.Значение
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДополнительныеСведения.Объект.Ссылка КАК Номенклатура,
	                      |	ДополнительныеСведения.Значение
	                      |ПОМЕСТИТЬ вт_Номенклатура_Топ
	                      |ИЗ
	                      |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                      |ГДЕ
	                      |	ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура
	                      |	И ДополнительныеСведения.Свойство.Заголовок = ""Топ!!!""
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДополнительныеСведения.Объект.Ссылка КАК Характеристика,
	                      |	ДополнительныеСведения.Значение
	                      |ПОМЕСТИТЬ вт_Характеристика_Новинка
	                      |ИЗ
	                      |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                      |ГДЕ
	                      |	ДополнительныеСведения.Объект ССЫЛКА Справочник.ХарактеристикиНоменклатуры
	                      |	И ДополнительныеСведения.Свойство.Заголовок = ""Новинка!!!""
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СкладыДополнительныеРеквизиты.Ссылка КАК Склад
	                      |ПОМЕСТИТЬ вт_Склады
	                      |ИЗ
	                      |	Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	                      |ГДЕ
	                      |	СкладыДополнительныеРеквизиты.Свойство = &СвойствоС
	                      |	И СкладыДополнительныеРеквизиты.Значение = &ЗначениеС
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Склад
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	                      |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	                      |	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	                      |ПОМЕСТИТЬ ВТ_ШК
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                      |ГДЕ
	                      |	(ШтрихкодыНоменклатуры.Номенклатура, ШтрихкодыНоменклатуры.Характеристика) В
	                      |			(ВЫБРАТЬ
	                      |				Т.Номенклатура,
	                      |				Т.Характеристика
	                      |			ИЗ
	                      |				ВТ_Номенклатура КАК Т)
	                      |	И ШтрихкодыНоменклатуры.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ВложенныйЗапрос.Номенклатура,
	                      |	ВложенныйЗапрос.Характеристика,
	                      |	СУММА(ВложенныйЗапрос.СвободноДляПродажи) КАК СвободноДляПродажи
	                      |ПОМЕСТИТЬ вт_СвободноДляПродажи
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		Т.Номенклатура КАК Номенклатура,
	                      |		Т.Характеристика КАК Характеристика,
	                      |		Т.Склад КАК Склад,
	                      |		Т.ВНаличииОстаток - Т.ВРезервеСоСкладаОстаток КАК ВНаличииДляПродажи,
	                      |		Т.ВНаличииОстаток - Т.ВРезервеСоСкладаОстаток КАК СвободноДляПродажи
	                      |	ИЗ
	                      |		РегистрНакопления.СвободныеОстатки.Остатки(, ) КАК Т
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Т.Номенклатура,
	                      |		Т.Характеристика,
	                      |		Т.Склад,
	                      |		0,
	                      |		-Т.НаличиеПодЗаказОстаток
	                      |	ИЗ
	                      |		РегистрНакопления.ОбеспечениеЗаказов.Остатки(, ) КАК Т
	                      |	ГДЕ
	                      |		Т.НаличиеПодЗаказОстаток > 0
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Т.Номенклатура,
	                      |		Т.Характеристика,
	                      |		Т.Склад,
	                      |		0,
	                      |		Т.Количество
	                      |	ИЗ
	                      |		РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Т
	                      |	ГДЕ
	                      |		Т.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1)
	                      |		И Т.Количество < 0) КАК ВложенныйЗапрос
	                      |ГДЕ
	                      |	ВложенныйЗапрос.Склад В
	                      |			(ВЫБРАТЬ
	                      |				вт_Склады.Склад
	                      |			ИЗ
	                      |				вт_Склады)
	                      |	И ВложенныйЗапрос.СвободноДляПродажи > 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВложенныйЗапрос.Номенклатура,
	                      |	ВложенныйЗапрос.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(КонтрагентыДополнительныеРеквизиты.Значение) КАК СкладРелиз
	                      |ПОМЕСТИТЬ вт_СкладРелиз
	                      |ИЗ
	                      |	Справочник.Партнеры.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
	                      |ГДЕ
	                      |	КонтрагентыДополнительныеРеквизиты.Ссылка = &Клиент
	                      |	И КонтрагентыДополнительныеРеквизиты.Свойство = &ДопРеквизитСкладРелиз
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыНаСкладахОбороты.Номенклатура,
	                      |	ТоварыНаСкладахОбороты.Характеристика,
	                      |	ТоварыНаСкладахОбороты.ВНаличииПриход КАК ВНаличииОборот,
	                      |	ТоварыНаСкладахОбороты.Склад
	                      |ПОМЕСТИТЬ вт_ОборотПоСкладуРелиза
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыНаСкладах.Обороты(
	                      |			,
	                      |			,
	                      |			,
	                      |			Склад В
	                      |				(ВЫБРАТЬ
	                      |					вт_СкладРелиз.СкладРелиз
	                      |				ИЗ
	                      |					вт_СкладРелиз КАК вт_СкладРелиз)) КАК ТоварыНаСкладахОбороты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыКПоступлениюОстатки.Номенклатура,
	                      |	ТоварыКПоступлениюОстатки.Характеристика,
	                      |	СУММА(ТоварыКПоступлениюОстатки.КОформлениюНакладныхПоРаспоряжениюОстаток) КАК КПоступлениюОстаток,
	                      |	МИНИМУМ(ВЫБОР
	                      |			КОГДА ТоварыКПоступлениюОстатки.ДокументПоступления ССЫЛКА Документ.ПриобретениеТоваровУслуг
	                      |				ТОГДА ВЫБОР
	                      |						КОГДА НАЧАЛОПЕРИОДА(ТоварыКПоступлениюОстатки.ДокументПоступления.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	                      |							ТОГДА &ТекущаяДата
	                      |						ИНАЧЕ ТоварыКПоступлениюОстатки.ДокументПоступления.Дата
	                      |					КОНЕЦ
	                      |			КОГДА ТоварыКПоступлениюОстатки.ДокументПоступления ССЫЛКА Документ.ЗаказПоставщику
	                      |				ТОГДА ВЫБОР
	                      |						КОГДА НАЧАЛОПЕРИОДА(ТоварыКПоступлениюОстатки.ДокументПоступления.ДатаПоступления, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	                      |							ТОГДА &ТекущаяДата
	                      |						ИНАЧЕ ТоварыКПоступлениюОстатки.ДокументПоступления.ДатаПоступления
	                      |					КОНЕЦ
	                      |		КОНЕЦ) КАК ДатаПоступления
	                      |ПОМЕСТИТЬ вт_ТоварыКПоступлению
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыКПоступлению.Остатки(
	                      |			,
	                      |			ДокументПоступления ССЫЛКА Документ.ПриобретениеТоваровУслуг
	                      |				ИЛИ ДокументПоступления ССЫЛКА Документ.ЗаказПоставщику) КАК ТоварыКПоступлениюОстатки
	                      |ГДЕ
	                      |	ТоварыКПоступлениюОстатки.КОформлениюНакладныхПоРаспоряжениюОстаток > 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыКПоступлениюОстатки.Номенклатура,
	                      |	ТоварыКПоступлениюОстатки.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	вт_Номенклатура.Номенклатура КАК Номенклатура,
	                      |	ЕСТЬNULL(вт_Номенклатура.Характеристика, """") КАК Характеристика,
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Стоимость,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) > 10
	                      |			ТОГДА "">10""
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) <= 0
	                      |			ТОГДА ""ожид.""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0)
	                      |	КОНЕЦ КАК ДоступноеКоличество,
	                      |	ЕСТЬNULL(ШК.Штрихкод, """") КАК Артикул,
	                      |	ЕСТЬNULL(вт_Номенклатура.Номенклатура.Производитель, """") КАК Производитель,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""СсылкаWEB""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК СсылкаWEB,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для аппарата""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляАппарата,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для бренда""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляБренда,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Тип аксессуара""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ТипАксессуара,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Серия""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК Серия,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Распродажа""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК Распродажа,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для модели устройства""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляМоделиУстройства,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Заголовок = ""ссылка на фото №2""
	                      |				ТОГДА ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК СсылкаНаАрхивФото,
	                      |	МАКСИМУМ(ЕСТЬNULL(вт_Номенклатура_Топ.Значение, """")) КАК Топ,
	                      |	МАКСИМУМ(ЕСТЬNULL(вт_Характеристика_Новинка.Значение, """")) КАК Новинка,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Дата выхода аппарата""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	                      |		КОНЕЦ) КАК ДатаВыпуска,
	                      |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот, 0)) КАК ПродажиКоличество,
	                      |	вт_Номенклатура.ЛистПрайса КАК ЛистПрайса,
	                      |	СУММА(ЕСТЬNULL(вт_ОборотПоСкладуРелиза.ВНаличииОборот, 0)) КАК ОборотРелиз,
	                      |	МАКСИМУМ(ЕСТЬNULL(вт_ОборотПоСкладуРелиза.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))) КАК СкладРелиз,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) < 0
	                      |			ТОГДА 0
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) > 10
	                      |			ТОГДА "">10""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0)
	                      |	КОНЕЦ КАК КоличествоОжидается,
	                      |	вт_ТоварыКПоступлению.ДатаПоступления,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Тип разъема""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ТипРазъема
	                      |ПОМЕСТИТЬ ВремТаблица
	                      |ИЗ
	                      |	вт_Номенклатура КАК вт_Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &Цена) КАК ЦеныНоменклатурыСрезПоследних
	                      |		ПО вт_Номенклатура.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СвободноДляПродажи КАК вт_СвободноДляПродажи
	                      |		ПО вт_Номенклатура.Номенклатура = вт_СвободноДляПродажи.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = вт_СвободноДляПродажи.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	                      |		ПО вт_Номенклатура.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_Номенклатура_Топ КАК вт_Номенклатура_Топ
	                      |		ПО вт_Номенклатура.Номенклатура = вт_Номенклатура_Топ.Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_Характеристика_Новинка КАК вт_Характеристика_Новинка
	                      |		ПО вт_Номенклатура.Характеристика = вт_Характеристика_Новинка.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	                      |		ПО вт_Номенклатура.Номенклатура = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец
	                      |			И вт_Номенклатура.Характеристика = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШК КАК ШК
	                      |		ПО вт_Номенклатура.Номенклатура = ШК.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ШК.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	                      |				,
	                      |				,
	                      |				,
	                      |				АналитикаУчетаНоменклатуры.Номенклатура В
	                      |						(ВЫБРАТЬ
	                      |							ВТНоменклатура.Номенклатура
	                      |						ИЗ
	                      |							вт_Номенклатура КАК ВТНоменклатура)
	                      |					И АналитикаУчетаНоменклатуры.Характеристика В
	                      |						(ВЫБРАТЬ
	                      |							ВТНоменклатура.Характеристика
	                      |						ИЗ
	                      |							вт_Номенклатура КАК ВТНоменклатура)
	                      |					И АналитикаУчетаПоПартнерам.Партнер = &Клиент) КАК ВыручкаИСебестоимостьПродажОбороты
	                      |		ПО вт_Номенклатура.Номенклатура = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика
	                      |			И (ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = &Клиент)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ОборотПоСкладуРелиза КАК вт_ОборотПоСкладуРелиза
	                      |		ПО вт_Номенклатура.Номенклатура = вт_ОборотПоСкладуРелиза.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = вт_ОборотПоСкладуРелиза.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ТоварыКПоступлению КАК вт_ТоварыКПоступлению
	                      |		ПО вт_Номенклатура.Номенклатура = вт_ТоварыКПоступлению.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = вт_ТоварыКПоступлению.Характеристика
	                      |ГДЕ
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) <> 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	вт_Номенклатура.Номенклатура,
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0),
	                      |	ЕСТЬNULL(ШК.Штрихкод, """"),
	                      |	вт_Номенклатура.ЛистПрайса,
	                      |	ЕСТЬNULL(вт_Номенклатура.Характеристика, """"),
	                      |	ЕСТЬNULL(вт_Номенклатура.Номенклатура.Производитель, """"),
	                      |	вт_ТоварыКПоступлению.ДатаПоступления,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) < 0
	                      |			ТОГДА 0
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) > 10
	                      |			ТОГДА "">10""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0)
	                      |	КОНЕЦ,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) > 10
	                      |			ТОГДА "">10""
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) <= 0
	                      |			ТОГДА ""ожид.""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0)
	                      |	КОНЕЦ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Ссылка КАК Ссылка,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Владелец КАК Владелец,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Код КАК Код,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Наименование КАК Наименование,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Артикул КАК Артикул,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Цена КАК Цена,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Дата КАК Дата,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.СсылкаНаМодель КАК СсылкаНаМодель,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.СсылкаНаГрафикМоделиЯМ КАК СсылкаНаГрафикМоделиЯМ,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.IDЯМ КАК IDЯМ,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Модель КАК Модель,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Бренд КАК Бренд,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.ТипАппарата КАК ТипАппарата,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Предопределенный КАК Предопределенный,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	                      |ПОМЕСТИТЬ МатрицаКлиента
	                      |ИЗ
	                      |	РегистрСведений.дпСоответствиеМатриц КАК дпСоответствиеМатриц
	                      |ГДЕ
	                      |	дпСоответствиеМатриц.АппаратКлиента.Владелец = &Клиент
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ВремТаблица.Номенклатура,
	                      |	ВремТаблица.Характеристика,
	                      |	ВремТаблица.Стоимость,
	                      |	ВЫБОР
	                      |		КОГДА &ПредЗаказ
	                      |			ТОГДА 0
	                      |		ИНАЧЕ ВремТаблица.ДоступноеКоличество
	                      |	КОНЕЦ КАК ДоступноеКоличество,
	                      |	ВремТаблица.Артикул,
	                      |	ВремТаблица.Производитель,
	                      |	ВремТаблица.СсылкаWEB,
	                      |	ВремТаблица.ДляАппарата,
	                      |	ВремТаблица.ДляБренда,
	                      |	ВремТаблица.ТипАксессуара,
	                      |	ВремТаблица.Серия,
	                      |	ВремТаблица.Распродажа,
	                      |	ВремТаблица.ДляМоделиУстройства,
	                      |	ВремТаблица.СсылкаНаАрхивФото,
	                      |	ВремТаблица.Топ,
	                      |	ВремТаблица.Новинка,
	                      |	ВремТаблица.ДатаВыпуска КАК ДатаВыпуска,
	                      |	ВремТаблица.ПродажиКоличество,
	                      |	ВремТаблица.ЛистПрайса КАК ЛистПрайса,
	                      |	ВремТаблица.ОборотРелиз,
	                      |	ВремТаблица.СкладРелиз,
	                      |	ВремТаблица.КоличествоОжидается,
	                      |	ВремТаблица.ДатаПоступления,
	                      |	ВремТаблица.ТипРазъема,
	                      |	ВЫБОР
	                      |		КОГДА МатрицаКлиента.Ссылка ЕСТЬ NULL
	                      |			ТОГДА 0
	                      |		ИНАЧЕ 1
	                      |	КОНЕЦ КАК ЕстьВМатрицеКлиента
	                      |ИЗ
	                      |	ВремТаблица КАК ВремТаблица
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ МатрицаКлиента КАК МатрицаКлиента
	                      |		ПО ВремТаблица.ДляМоделиУстройства = МатрицаКлиента.Модель
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаВыпуска УБЫВ
	                      |ИТОГИ ПО
	                      |	ЛистПрайса КАК ЛистПрайса");
						  
	Запрос.УстановитьПараметр("ЗначениеС", Истина);
	Запрос.УстановитьПараметр("СвойствоС", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Включен в рассылку (Склады и магазины)"));
	Запрос.УстановитьПараметр("Цена", Цена);
	Запрос.УстановитьПараметр("СсылкаWEB", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СсылкаWEB (Справочник ""Номенклатура"" (Общие))"));
	Запрос.УстановитьПараметр("ЛистПрайса", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Лист прайса (Справочник ""Номенклатура"" (Общие))"));
	Запрос.УстановитьПараметр("СписокНоменклатурыДляРассылки", СписокНоменклатурыДляРассылки);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ДопРеквизитСкладРелиз", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Склад релиза"));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ПредЗаказ", ПредЗаказ);

	
	Результат =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Если Результат.Количество() = 0 Тогда
	//	Возврат Неопределено;
	//Иначе
		Возврат Результат;
	//КонецЕСли;
КонецФункции

Функция ПолучитьСтрокиДляЗаполненияФайлаПрайсСРазбивкойНовый(СписокНоменклатурыДляРассылки, Цена, Клиент, ПредЗаказ)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Номенклатура.Ссылка КАК Номенклатура,
	                      |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	                      |	НоменклатураДополнительныеРеквизиты.Значение КАК ЛистПрайса
	                      |ПОМЕСТИТЬ вт_Номенклатура
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                      |		ПО (ХарактеристикиНоменклатуры.Владелец = Номенклатура.Ссылка
	                      |				ИЛИ ХарактеристикиНоменклатуры.Владелец = Номенклатура.ВидНоменклатуры)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	                      |		ПО (НоменклатураДополнительныеРеквизиты.Ссылка = Номенклатура.Ссылка)
	                      |ГДЕ
	                      |	Номенклатура.Ссылка В(&СписокНоменклатурыДляРассылки)
	                      |	И НоменклатураДополнительныеРеквизиты.Свойство = &ЛистПрайса
	                      |	И НоменклатураДополнительныеРеквизиты.Значение <> ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Номенклатура.Ссылка,
	                      |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	                      |	НоменклатураДополнительныеРеквизиты.Значение
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДополнительныеСведения.Объект.Ссылка КАК Номенклатура,
	                      |	ДополнительныеСведения.Значение
	                      |ПОМЕСТИТЬ вт_Номенклатура_Топ
	                      |ИЗ
	                      |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                      |ГДЕ
	                      |	ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура
	                      |	И ДополнительныеСведения.Свойство.Заголовок = ""Топ!!!""
						  |	И ДополнительныеСведения.Объект В(&СписокНоменклатурыДляРассылки)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДополнительныеСведения.Объект.Ссылка КАК Характеристика,
	                      |	ДополнительныеСведения.Значение
	                      |ПОМЕСТИТЬ вт_Характеристика_Новинка
	                      |ИЗ
	                      |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                      |ГДЕ
	                      |	ДополнительныеСведения.Объект ССЫЛКА Справочник.ХарактеристикиНоменклатуры
	                      |	И ДополнительныеСведения.Свойство.Заголовок = ""Новинка!!!""
						  |	И ДополнительныеСведения.Объект В(&СписокНоменклатурыДляРассылки)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СкладыДополнительныеРеквизиты.Ссылка КАК Склад
	                      |ПОМЕСТИТЬ вт_Склады
	                      |ИЗ
	                      |	Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	                      |ГДЕ
	                      |	СкладыДополнительныеРеквизиты.Свойство = &СвойствоС
	                      |	И СкладыДополнительныеРеквизиты.Значение = &ЗначениеС
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Склад
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	                      |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	                      |	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	                      |ПОМЕСТИТЬ ВТ_ШК
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                      |ГДЕ
	                      |	(ШтрихкодыНоменклатуры.Номенклатура, ШтрихкодыНоменклатуры.Характеристика) В
	                      |			(ВЫБРАТЬ
	                      |				Т.Номенклатура,
	                      |				Т.Характеристика
	                      |			ИЗ
	                      |				ВТ_Номенклатура КАК Т)
	                      |	И ШтрихкодыНоменклатуры.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ВложенныйЗапрос.Номенклатура,
	                      |	ВложенныйЗапрос.Характеристика,
	                      |	СУММА(ВложенныйЗапрос.СвободноДляПродажи) КАК СвободноДляПродажи
	                      |ПОМЕСТИТЬ вт_СвободноДляПродажи
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		Т.Номенклатура КАК Номенклатура,
	                      |		Т.Характеристика КАК Характеристика,
	                      |		Т.Склад КАК Склад,
	                      |		Т.ВНаличииОстаток - Т.ВРезервеСоСкладаОстаток КАК ВНаличииДляПродажи,
	                      |		Т.ВНаличииОстаток - Т.ВРезервеСоСкладаОстаток КАК СвободноДляПродажи
	                      |	ИЗ
	                      |		РегистрНакопления.СвободныеОстатки.Остатки(
	                      |				,
	                      |				(Номенклатура, Характеристика) В
	                      |						(ВЫБРАТЬ
	                      |							Т.Номенклатура,
	                      |							Т.Характеристика
	                      |						ИЗ
	                      |							ВТ_Номенклатура КАК Т)
	                      |					И Склад В
	                      |						(ВЫБРАТЬ
	                      |							вт_Склады.Склад
	                      |						ИЗ
	                      |							вт_Склады)) КАК Т
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Т.Номенклатура,
	                      |		Т.Характеристика,
	                      |		Т.Склад,
	                      |		0,
	                      |		-Т.НаличиеПодЗаказОстаток
	                      |	ИЗ
	                      |		РегистрНакопления.ОбеспечениеЗаказов.Остатки(
	                      |				,
	                      |				(Номенклатура, Характеристика) В
	                      |						(ВЫБРАТЬ
	                      |							Т.Номенклатура,
	                      |							Т.Характеристика
	                      |						ИЗ
	                      |							ВТ_Номенклатура КАК Т)
	                      |					И Склад В
	                      |						(ВЫБРАТЬ
	                      |							вт_Склады.Склад
	                      |						ИЗ
	                      |							вт_Склады)) КАК Т
	                      |	ГДЕ
	                      |		Т.НаличиеПодЗаказОстаток > 0
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Т.Номенклатура,
	                      |		Т.Характеристика,
	                      |		Т.Склад,
	                      |		0,
	                      |		Т.Количество
	                      |	ИЗ
	                      |		РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Т
	                      |	ГДЕ
	                      |		Т.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1)
	                      |		И Т.Количество < 0
	                      |		И Т.Склад В
	                      |				(ВЫБРАТЬ
	                      |					вт_Склады.Склад
	                      |				ИЗ
	                      |					вт_Склады)) КАК ВложенныйЗапрос
	                      |ГДЕ
	                      |	ВложенныйЗапрос.Склад В
	                      |			(ВЫБРАТЬ
	                      |				вт_Склады.Склад
	                      |			ИЗ
	                      |				вт_Склады)
	                      |	И ВложенныйЗапрос.СвободноДляПродажи > 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВложенныйЗапрос.Номенклатура,
	                      |	ВложенныйЗапрос.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(КонтрагентыДополнительныеРеквизиты.Значение) КАК СкладРелиз
	                      |ПОМЕСТИТЬ вт_СкладРелиз
	                      |ИЗ
	                      |	Справочник.Партнеры.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
	                      |ГДЕ
	                      |	КонтрагентыДополнительныеРеквизиты.Ссылка = &Клиент
	                      |	И КонтрагентыДополнительныеРеквизиты.Свойство = &ДопРеквизитСкладРелиз
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыНаСкладахОбороты.Номенклатура,
	                      |	ТоварыНаСкладахОбороты.Характеристика,
	                      |	ТоварыНаСкладахОбороты.ВНаличииПриход КАК ВНаличииОборот,
	                      |	ТоварыНаСкладахОбороты.Склад
	                      |ПОМЕСТИТЬ вт_ОборотПоСкладуРелиза
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыНаСкладах.Обороты(
	                      |			,
	                      |			,
	                      |			,
	                      |			(Номенклатура, Характеристика) В
	                      |					(ВЫБРАТЬ
	                      |						Т.Номенклатура,
	                      |						Т.Характеристика
	                      |					ИЗ
	                      |						ВТ_Номенклатура КАК Т)
	                      |				И Склад В
	                      |					(ВЫБРАТЬ
	                      |						вт_СкладРелиз.СкладРелиз
	                      |					ИЗ
	                      |						вт_СкладРелиз КАК вт_СкладРелиз)) КАК ТоварыНаСкладахОбороты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыКПоступлениюОстатки.Номенклатура,
	                      |	ТоварыКПоступлениюОстатки.Характеристика,
	                      |	СУММА(ТоварыКПоступлениюОстатки.КОформлениюНакладныхПоРаспоряжениюОстаток) КАК КПоступлениюОстаток,
	                      |	МИНИМУМ(ВЫБОР
	                      |			КОГДА ТоварыКПоступлениюОстатки.ДокументПоступления ССЫЛКА Документ.ПриобретениеТоваровУслуг
	                      |				ТОГДА ВЫБОР
	                      |						КОГДА НАЧАЛОПЕРИОДА(ТоварыКПоступлениюОстатки.ДокументПоступления.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	                      |							ТОГДА &ТекущаяДата
	                      |						ИНАЧЕ ТоварыКПоступлениюОстатки.ДокументПоступления.Дата
	                      |					КОНЕЦ
	                      |			КОГДА ТоварыКПоступлениюОстатки.ДокументПоступления ССЫЛКА Документ.ЗаказПоставщику
	                      |				ТОГДА ВЫБОР
	                      |						КОГДА НАЧАЛОПЕРИОДА(ТоварыКПоступлениюОстатки.ДокументПоступления.ДатаПоступления, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	                      |							ТОГДА &ТекущаяДата
	                      |						ИНАЧЕ ТоварыКПоступлениюОстатки.ДокументПоступления.ДатаПоступления
	                      |					КОНЕЦ
	                      |		КОНЕЦ) КАК ДатаПоступления
	                      |ПОМЕСТИТЬ вт_ТоварыКПоступлению
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыКПоступлению.Остатки(
	                      |			,
	                      |			(Номенклатура, Характеристика) В
	                      |					(ВЫБРАТЬ
	                      |						Т.Номенклатура,
	                      |						Т.Характеристика
	                      |					ИЗ
	                      |						ВТ_Номенклатура КАК Т)
	                      |				И (ДокументПоступления ССЫЛКА Документ.ПриобретениеТоваровУслуг
	                      |					ИЛИ ДокументПоступления ССЫЛКА Документ.ЗаказПоставщику)) КАК ТоварыКПоступлениюОстатки
	                      |ГДЕ
	                      |	ТоварыКПоступлениюОстатки.КОформлениюНакладныхПоРаспоряжениюОстаток > 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыКПоступлениюОстатки.Номенклатура,
	                      |	ТоварыКПоступлениюОстатки.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	вт_Номенклатура.Номенклатура КАК Номенклатура,
	                      |	ЕСТЬNULL(вт_Номенклатура.Характеристика, """") КАК Характеристика,
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Стоимость,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) > 10
	                      |			ТОГДА "">10""
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) <= 0
	                      |			ТОГДА ""ожид.""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0)
	                      |	КОНЕЦ КАК ДоступноеКоличество,
	                      |	ЕСТЬNULL(ШК.Штрихкод, """") КАК Артикул,
	                      |	ЕСТЬNULL(вт_Номенклатура.Номенклатура.Производитель, """") КАК Производитель,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""СсылкаWEB""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК СсылкаWEB,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для аппарата""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляАппарата,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для бренда""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляБренда,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Тип аксессуара""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ТипАксессуара,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Серия""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК Серия,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Распродажа""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК Распродажа,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для модели устройства""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляМоделиУстройства,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Заголовок = ""ссылка на фото №2""
	                      |				ТОГДА ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК СсылкаНаАрхивФото,
	                      |	МАКСИМУМ(ЕСТЬNULL(вт_Номенклатура_Топ.Значение, """")) КАК Топ,
	                      |	МАКСИМУМ(ЕСТЬNULL(вт_Характеристика_Новинка.Значение, """")) КАК Новинка,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Дата выхода аппарата""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	                      |		КОНЕЦ) КАК ДатаВыпуска,
	                      |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот, 0)) КАК ПродажиКоличество,
	                      |	вт_Номенклатура.ЛистПрайса КАК ЛистПрайса,
	                      |	СУММА(ЕСТЬNULL(вт_ОборотПоСкладуРелиза.ВНаличииОборот, 0)) КАК ОборотРелиз,
	                      |	МАКСИМУМ(ЕСТЬNULL(вт_ОборотПоСкладуРелиза.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))) КАК СкладРелиз,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) < 0
	                      |			ТОГДА 0
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) > 10
	                      |			ТОГДА "">10""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0)
	                      |	КОНЕЦ КАК КоличествоОжидается,
	                      |	вт_ТоварыКПоступлению.ДатаПоступления,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Тип разъема""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ТипРазъема
	                      |ПОМЕСТИТЬ ВремТаблица
	                      |ИЗ
	                      |	вт_Номенклатура КАК вт_Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &Цена) КАК ЦеныНоменклатурыСрезПоследних
	                      |		ПО вт_Номенклатура.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СвободноДляПродажи КАК вт_СвободноДляПродажи
	                      |		ПО вт_Номенклатура.Номенклатура = вт_СвободноДляПродажи.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = вт_СвободноДляПродажи.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	                      |		ПО вт_Номенклатура.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_Номенклатура_Топ КАК вт_Номенклатура_Топ
	                      |		ПО вт_Номенклатура.Номенклатура = вт_Номенклатура_Топ.Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_Характеристика_Новинка КАК вт_Характеристика_Новинка
	                      |		ПО вт_Номенклатура.Характеристика = вт_Характеристика_Новинка.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	                      |		ПО вт_Номенклатура.Номенклатура = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец
	                      |			И вт_Номенклатура.Характеристика = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШК КАК ШК
	                      |		ПО вт_Номенклатура.Номенклатура = ШК.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ШК.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	                      |				,
	                      |				,
	                      |				,
	                      |				АналитикаУчетаНоменклатуры.Номенклатура В
	                      |						(ВЫБРАТЬ
	                      |							ВТНоменклатура.Номенклатура
	                      |						ИЗ
	                      |							вт_Номенклатура КАК ВТНоменклатура)
	                      |					И АналитикаУчетаНоменклатуры.Характеристика В
	                      |						(ВЫБРАТЬ
	                      |							ВТНоменклатура.Характеристика
	                      |						ИЗ
	                      |							вт_Номенклатура КАК ВТНоменклатура)
	                      |					И АналитикаУчетаПоПартнерам.Партнер = &Клиент) КАК ВыручкаИСебестоимостьПродажОбороты
	                      |		ПО вт_Номенклатура.Номенклатура = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика
	                      |			И (ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = &Клиент)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ОборотПоСкладуРелиза КАК вт_ОборотПоСкладуРелиза
	                      |		ПО вт_Номенклатура.Номенклатура = вт_ОборотПоСкладуРелиза.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = вт_ОборотПоСкладуРелиза.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ТоварыКПоступлению КАК вт_ТоварыКПоступлению
	                      |		ПО вт_Номенклатура.Номенклатура = вт_ТоварыКПоступлению.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = вт_ТоварыКПоступлению.Характеристика
	                      |ГДЕ
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) <> 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	вт_Номенклатура.Номенклатура,
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0),
	                      |	ЕСТЬNULL(ШК.Штрихкод, """"),
	                      |	вт_Номенклатура.ЛистПрайса,
	                      |	ЕСТЬNULL(вт_Номенклатура.Характеристика, """"),
	                      |	ЕСТЬNULL(вт_Номенклатура.Номенклатура.Производитель, """"),
	                      |	вт_ТоварыКПоступлению.ДатаПоступления,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) < 0
	                      |			ТОГДА 0
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) > 10
	                      |			ТОГДА "">10""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0)
	                      |	КОНЕЦ,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) > 10
	                      |			ТОГДА "">10""
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) <= 0
	                      |			ТОГДА ""ожид.""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0)
	                      |	КОНЕЦ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Ссылка КАК Ссылка,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Владелец КАК Владелец,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Код КАК Код,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Наименование КАК Наименование,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Артикул КАК Артикул,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Цена КАК Цена,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Дата КАК Дата,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.СсылкаНаМодель КАК СсылкаНаМодель,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.СсылкаНаГрафикМоделиЯМ КАК СсылкаНаГрафикМоделиЯМ,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.IDЯМ КАК IDЯМ,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Модель КАК Модель,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Бренд КАК Бренд,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.ТипАппарата КАК ТипАппарата,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Предопределенный КАК Предопределенный,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	                      |ПОМЕСТИТЬ МатрицаКлиента
	                      |ИЗ
	                      |	РегистрСведений.дпСоответствиеМатриц КАК дпСоответствиеМатриц
	                      |ГДЕ
	                      |	дпСоответствиеМатриц.АппаратКлиента.Владелец = &Клиент
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ВремТаблица.Номенклатура,
	                      |	ВремТаблица.Характеристика,
	                      |	ВремТаблица.Стоимость,
	                      |	ВЫБОР
	                      |		КОГДА &ПредЗаказ
	                      |			ТОГДА 0
	                      |		ИНАЧЕ ВремТаблица.ДоступноеКоличество
	                      |	КОНЕЦ КАК ДоступноеКоличество,
	                      |	ВремТаблица.Артикул,
	                      |	ВремТаблица.Производитель,
	                      |	ВремТаблица.СсылкаWEB,
	                      |	ВремТаблица.ДляАппарата,
	                      |	ВремТаблица.ДляБренда,
	                      |	ВремТаблица.ТипАксессуара,
	                      |	ВремТаблица.Серия,
	                      |	ВремТаблица.Распродажа,
	                      |	ВремТаблица.ДляМоделиУстройства,
	                      |	ВремТаблица.СсылкаНаАрхивФото,
	                      |	ВремТаблица.Топ,
	                      |	ВремТаблица.Новинка,
	                      |	ВремТаблица.ДатаВыпуска КАК ДатаВыпуска,
	                      |	ВремТаблица.ПродажиКоличество,
	                      |	ВремТаблица.ЛистПрайса КАК ЛистПрайса,
	                      |	ВремТаблица.ОборотРелиз,
	                      |	ВремТаблица.СкладРелиз,
	                      |	ВремТаблица.КоличествоОжидается,
	                      |	ВремТаблица.ДатаПоступления,
	                      |	ВремТаблица.ТипРазъема,
	                      |	ВЫБОР
	                      |		КОГДА МатрицаКлиента.Ссылка ЕСТЬ NULL
	                      |			ТОГДА 0
	                      |		ИНАЧЕ 1
	                      |	КОНЕЦ КАК ЕстьВМатрицеКлиента
	                      |ИЗ
	                      |	ВремТаблица КАК ВремТаблица
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ МатрицаКлиента КАК МатрицаКлиента
	                      |		ПО ВремТаблица.ДляМоделиУстройства = МатрицаКлиента.Модель
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаВыпуска УБЫВ
	                      |ИТОГИ ПО
	                      |	ЛистПрайса КАК ЛистПрайса");
						  
	Запрос.УстановитьПараметр("ЗначениеС", Истина);
	Запрос.УстановитьПараметр("СвойствоС", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Включен в рассылку (Склады и магазины)"));
	Запрос.УстановитьПараметр("Цена", Цена);
	Запрос.УстановитьПараметр("СсылкаWEB", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СсылкаWEB (Справочник ""Номенклатура"" (Общие))"));
	Запрос.УстановитьПараметр("ЛистПрайса", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Лист прайса (Справочник ""Номенклатура"" (Общие))"));
	Запрос.УстановитьПараметр("СписокНоменклатурыДляРассылки", СписокНоменклатурыДляРассылки);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ДопРеквизитСкладРелиз", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Склад релиза"));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ПредЗаказ", ПредЗаказ);

	
	Результат =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Если Результат.Количество() = 0 Тогда
	//	Возврат Неопределено;
	//Иначе
		Возврат Результат;
	//КонецЕСли;
КонецФункции

Функция ПолучитьСтрокиДляЗаполненияФайлаПрайсСРазбивкойНовый2(СписокНоменклатурыДляРассылки, Цена, Клиент, ПредЗаказ)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Номенклатура.Ссылка КАК Номенклатура,
	                      |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	                      |	НоменклатураДополнительныеРеквизиты.Значение КАК ЛистПрайса,
	                      |	МАКСИМУМ(ЕСТЬNULL(ДополнительныеСведения.Значение, """")) КАК ЗначениеТоп,
	                      |	МАКСИМУМ(ЕСТЬNULL(ДополнительныеСведенияХар.Значение, """")) КАК ЗначениеНов
	                      |ПОМЕСТИТЬ вт_Номенклатура
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                      |		ПО (ХарактеристикиНоменклатуры.Владелец = Номенклатура.Ссылка
	                      |				ИЛИ ХарактеристикиНоменклатуры.Владелец = Номенклатура.ВидНоменклатуры)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	                      |		ПО (НоменклатураДополнительныеРеквизиты.Ссылка = Номенклатура.Ссылка)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                      |		ПО (ДополнительныеСведения.Объект = Номенклатура.Ссылка)
	                      |			И (ДополнительныеСведения.Свойство.Заголовок = ""Топ!!!"")
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияХар
	                      |		ПО (ДополнительныеСведения.Объект = ХарактеристикиНоменклатуры.Ссылка)
	                      |			И (ДополнительныеСведения.Свойство.Заголовок = ""Новинка!!!"")
	                      |ГДЕ
	                      |	Номенклатура.Ссылка В(&СписокНоменклатурыДляРассылки)
	                      |	И НоменклатураДополнительныеРеквизиты.Свойство = &ЛистПрайса
	                      |	И НоменклатураДополнительныеРеквизиты.Значение <> ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Номенклатура.Ссылка,
	                      |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	                      |	НоменклатураДополнительныеРеквизиты.Значение
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СкладыДополнительныеРеквизиты.Ссылка КАК Склад
	                      |ПОМЕСТИТЬ вт_Склады
	                      |ИЗ
	                      |	Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	                      |ГДЕ
	                      |	СкладыДополнительныеРеквизиты.Свойство = &СвойствоС
	                      |	И СкладыДополнительныеРеквизиты.Значение = &ЗначениеС
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Склад
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	                      |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	                      |	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	                      |ПОМЕСТИТЬ ВТ_ШК
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                      |ГДЕ
	                      |	(ШтрихкодыНоменклатуры.Номенклатура, ШтрихкодыНоменклатуры.Характеристика) В
	                      |			(ВЫБРАТЬ
	                      |				Т.Номенклатура,
	                      |				Т.Характеристика
	                      |			ИЗ
	                      |				ВТ_Номенклатура КАК Т)
	                      |	И ШтрихкодыНоменклатуры.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ВложенныйЗапрос.Номенклатура,
	                      |	ВложенныйЗапрос.Характеристика,
	                      |	СУММА(ВложенныйЗапрос.СвободноДляПродажи) КАК СвободноДляПродажи
	                      |ПОМЕСТИТЬ вт_СвободноДляПродажи
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		Т.Номенклатура КАК Номенклатура,
	                      |		Т.Характеристика КАК Характеристика,
	                      |		Т.Склад КАК Склад,
	                      |		Т.ВНаличииОстаток - Т.ВРезервеСоСкладаОстаток КАК ВНаличииДляПродажи,
	                      |		Т.ВНаличииОстаток - Т.ВРезервеСоСкладаОстаток КАК СвободноДляПродажи
	                      |	ИЗ
	                      |		РегистрНакопления.СвободныеОстатки.Остатки(
	                      |				,
	                      |				(Номенклатура, Характеристика) В
	                      |						(ВЫБРАТЬ
	                      |							Т.Номенклатура,
	                      |							Т.Характеристика
	                      |						ИЗ
	                      |							ВТ_Номенклатура КАК Т)
	                      |					И Склад В
	                      |						(ВЫБРАТЬ
	                      |							вт_Склады.Склад
	                      |						ИЗ
	                      |							вт_Склады)) КАК Т
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Т.Номенклатура,
	                      |		Т.Характеристика,
	                      |		Т.Склад,
	                      |		0,
	                      |		-Т.НаличиеПодЗаказОстаток
	                      |	ИЗ
	                      |		РегистрНакопления.ОбеспечениеЗаказов.Остатки(
	                      |				,
	                      |				(Номенклатура, Характеристика) В
	                      |						(ВЫБРАТЬ
	                      |							Т.Номенклатура,
	                      |							Т.Характеристика
	                      |						ИЗ
	                      |							ВТ_Номенклатура КАК Т)
	                      |					И Склад В
	                      |						(ВЫБРАТЬ
	                      |							вт_Склады.Склад
	                      |						ИЗ
	                      |							вт_Склады)) КАК Т
	                      |	ГДЕ
	                      |		Т.НаличиеПодЗаказОстаток > 0
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Т.Номенклатура,
	                      |		Т.Характеристика,
	                      |		Т.Склад,
	                      |		0,
	                      |		Т.Количество
	                      |	ИЗ
	                      |		РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Т
	                      |	ГДЕ
	                      |		Т.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1)
	                      |		И Т.Количество < 0
	                      |		И Т.Склад В
	                      |				(ВЫБРАТЬ
	                      |					вт_Склады.Склад
	                      |				ИЗ
	                      |					вт_Склады)) КАК ВложенныйЗапрос
	                      |ГДЕ
	                      |	ВложенныйЗапрос.Склад В
	                      |			(ВЫБРАТЬ
	                      |				вт_Склады.Склад
	                      |			ИЗ
	                      |				вт_Склады)
	                      |	И ВложенныйЗапрос.СвободноДляПродажи > 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВложенныйЗапрос.Номенклатура,
	                      |	ВложенныйЗапрос.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(КонтрагентыДополнительныеРеквизиты.Значение) КАК СкладРелиз
	                      |ПОМЕСТИТЬ вт_СкладРелиз
	                      |ИЗ
	                      |	Справочник.Партнеры.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
	                      |ГДЕ
	                      |	КонтрагентыДополнительныеРеквизиты.Ссылка = &Клиент
	                      |	И КонтрагентыДополнительныеРеквизиты.Свойство = &ДопРеквизитСкладРелиз
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыНаСкладахОбороты.Номенклатура,
	                      |	ТоварыНаСкладахОбороты.Характеристика,
	                      |	ТоварыНаСкладахОбороты.ВНаличииПриход КАК ВНаличииОборот,
	                      |	ТоварыНаСкладахОбороты.Склад
	                      |ПОМЕСТИТЬ вт_ОборотПоСкладуРелиза
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыНаСкладах.Обороты(
	                      |			,
	                      |			,
	                      |			,
	                      |			(Номенклатура, Характеристика) В
	                      |					(ВЫБРАТЬ
	                      |						Т.Номенклатура,
	                      |						Т.Характеристика
	                      |					ИЗ
	                      |						ВТ_Номенклатура КАК Т)
	                      |				И Склад В
	                      |					(ВЫБРАТЬ
	                      |						вт_СкладРелиз.СкладРелиз
	                      |					ИЗ
	                      |						вт_СкладРелиз КАК вт_СкладРелиз)) КАК ТоварыНаСкладахОбороты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыКПоступлениюОстатки.Номенклатура,
	                      |	ТоварыКПоступлениюОстатки.Характеристика,
	                      |	СУММА(ТоварыКПоступлениюОстатки.КОформлениюНакладныхПоРаспоряжениюОстаток) КАК КПоступлениюОстаток,
	                      |	МИНИМУМ(ВЫБОР
	                      |			КОГДА ТоварыКПоступлениюОстатки.ДокументПоступления ССЫЛКА Документ.ПриобретениеТоваровУслуг
	                      |				ТОГДА ВЫБОР
	                      |						КОГДА НАЧАЛОПЕРИОДА(ТоварыКПоступлениюОстатки.ДокументПоступления.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	                      |							ТОГДА &ТекущаяДата
	                      |						ИНАЧЕ ТоварыКПоступлениюОстатки.ДокументПоступления.Дата
	                      |					КОНЕЦ
	                      |			КОГДА ТоварыКПоступлениюОстатки.ДокументПоступления ССЫЛКА Документ.ЗаказПоставщику
	                      |				ТОГДА ВЫБОР
	                      |						КОГДА НАЧАЛОПЕРИОДА(ТоварыКПоступлениюОстатки.ДокументПоступления.ДатаПоступления, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	                      |							ТОГДА &ТекущаяДата
	                      |						ИНАЧЕ ТоварыКПоступлениюОстатки.ДокументПоступления.ДатаПоступления
	                      |					КОНЕЦ
	                      |		КОНЕЦ) КАК ДатаПоступления
	                      |ПОМЕСТИТЬ вт_ТоварыКПоступлению
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыКПоступлению.Остатки(
	                      |			,
	                      |			(Номенклатура, Характеристика) В
	                      |					(ВЫБРАТЬ
	                      |						Т.Номенклатура,
	                      |						Т.Характеристика
	                      |					ИЗ
	                      |						ВТ_Номенклатура КАК Т)
	                      |				И (ДокументПоступления ССЫЛКА Документ.ПриобретениеТоваровУслуг
	                      |					ИЛИ ДокументПоступления ССЫЛКА Документ.ЗаказПоставщику)) КАК ТоварыКПоступлениюОстатки
	                      |ГДЕ
	                      |	ТоварыКПоступлениюОстатки.КОформлениюНакладныхПоРаспоряжениюОстаток > 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыКПоступлениюОстатки.Номенклатура,
	                      |	ТоварыКПоступлениюОстатки.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	вт_Номенклатура.Номенклатура КАК Номенклатура,
	                      |	ЕСТЬNULL(вт_Номенклатура.Характеристика, """") КАК Характеристика,
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Стоимость,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) > 10
	                      |			ТОГДА "">10""
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) <= 0
	                      |			ТОГДА ""ожид.""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0)
	                      |	КОНЕЦ КАК ДоступноеКоличество,
	                      |	ЕСТЬNULL(ШК.Штрихкод, """") КАК Артикул,
	                      |	ЕСТЬNULL(вт_Номенклатура.Номенклатура.Производитель, """") КАК Производитель,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""СсылкаWEB""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК СсылкаWEB,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для аппарата""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляАппарата,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для бренда""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляБренда,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Тип аксессуара""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ТипАксессуара,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Серия""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК Серия,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Распродажа""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК Распродажа,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для модели устройства""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляМоделиУстройства,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Заголовок = ""ссылка на фото №2""
	                      |				ТОГДА ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК СсылкаНаАрхивФото,
	                      |	МАКСИМУМ(ЕСТЬNULL(вт_Номенклатура.ЗначениеТоп, """")) КАК Топ,
	                      |	МАКСИМУМ(ЕСТЬNULL(вт_Номенклатура.ЗначениеНов, """")) КАК Новинка,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Дата выхода аппарата""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	                      |		КОНЕЦ) КАК ДатаВыпуска,
	                      |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот, 0)) КАК ПродажиКоличество,
	                      |	вт_Номенклатура.ЛистПрайса КАК ЛистПрайса,
	                      |	СУММА(ЕСТЬNULL(вт_ОборотПоСкладуРелиза.ВНаличииОборот, 0)) КАК ОборотРелиз,
	                      |	МАКСИМУМ(ЕСТЬNULL(вт_ОборотПоСкладуРелиза.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))) КАК СкладРелиз,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) < 0
	                      |			ТОГДА 0
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) > 10
	                      |			ТОГДА "">10""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0)
	                      |	КОНЕЦ КАК КоличествоОжидается,
	                      |	вт_ТоварыКПоступлению.ДатаПоступления,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Тип разъема""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ТипРазъема
	                      |ПОМЕСТИТЬ ВремТаблица
	                      |ИЗ
	                      |	вт_Номенклатура КАК вт_Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &Цена) КАК ЦеныНоменклатурыСрезПоследних
	                      |		ПО вт_Номенклатура.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СвободноДляПродажи КАК вт_СвободноДляПродажи
	                      |		ПО вт_Номенклатура.Номенклатура = вт_СвободноДляПродажи.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = вт_СвободноДляПродажи.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	                      |		ПО вт_Номенклатура.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	                      |		ПО вт_Номенклатура.Номенклатура = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец
	                      |			И вт_Номенклатура.Характеристика = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШК КАК ШК
	                      |		ПО вт_Номенклатура.Номенклатура = ШК.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ШК.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	                      |				,
	                      |				,
	                      |				,
	                      |				АналитикаУчетаНоменклатуры.Номенклатура В
	                      |						(ВЫБРАТЬ
	                      |							ВТНоменклатура.Номенклатура
	                      |						ИЗ
	                      |							вт_Номенклатура КАК ВТНоменклатура)
	                      |					И АналитикаУчетаНоменклатуры.Характеристика В
	                      |						(ВЫБРАТЬ
	                      |							ВТНоменклатура.Характеристика
	                      |						ИЗ
	                      |							вт_Номенклатура КАК ВТНоменклатура)
	                      |					И АналитикаУчетаПоПартнерам.Партнер = &Клиент) КАК ВыручкаИСебестоимостьПродажОбороты
	                      |		ПО вт_Номенклатура.Номенклатура = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика
	                      |			И (ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = &Клиент)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ОборотПоСкладуРелиза КАК вт_ОборотПоСкладуРелиза
	                      |		ПО вт_Номенклатура.Номенклатура = вт_ОборотПоСкладуРелиза.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = вт_ОборотПоСкладуРелиза.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ТоварыКПоступлению КАК вт_ТоварыКПоступлению
	                      |		ПО вт_Номенклатура.Номенклатура = вт_ТоварыКПоступлению.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = вт_ТоварыКПоступлению.Характеристика
	                      |ГДЕ
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) <> 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	вт_Номенклатура.Номенклатура,
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0),
	                      |	ЕСТЬNULL(ШК.Штрихкод, """"),
	                      |	вт_Номенклатура.ЛистПрайса,
	                      |	ЕСТЬNULL(вт_Номенклатура.Характеристика, """"),
	                      |	ЕСТЬNULL(вт_Номенклатура.Номенклатура.Производитель, """"),
	                      |	вт_ТоварыКПоступлению.ДатаПоступления,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) < 0
	                      |			ТОГДА 0
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) > 10
	                      |			ТОГДА "">10""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0)
	                      |	КОНЕЦ,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) > 10
	                      |			ТОГДА "">10""
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) <= 0
	                      |			ТОГДА ""ожид.""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0)
	                      |	КОНЕЦ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Ссылка КАК Ссылка,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Владелец КАК Владелец,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Код КАК Код,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Наименование КАК Наименование,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Артикул КАК Артикул,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Цена КАК Цена,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Дата КАК Дата,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.СсылкаНаМодель КАК СсылкаНаМодель,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.СсылкаНаГрафикМоделиЯМ КАК СсылкаНаГрафикМоделиЯМ,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.IDЯМ КАК IDЯМ,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Модель КАК Модель,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Бренд КАК Бренд,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.ТипАппарата КАК ТипАппарата,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Предопределенный КАК Предопределенный,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	                      |ПОМЕСТИТЬ МатрицаКлиента
	                      |ИЗ
	                      |	РегистрСведений.дпСоответствиеМатриц КАК дпСоответствиеМатриц
	                      |ГДЕ
	                      |	дпСоответствиеМатриц.АппаратКлиента.Владелец = &Клиент
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ВремТаблица.Номенклатура,
	                      |	ВремТаблица.Характеристика,
	                      |	ВремТаблица.Стоимость,
	                      |	ВЫБОР
	                      |		КОГДА &ПредЗаказ
	                      |			ТОГДА 0
	                      |		ИНАЧЕ ВремТаблица.ДоступноеКоличество
	                      |	КОНЕЦ КАК ДоступноеКоличество,
	                      |	ВремТаблица.Артикул,
	                      |	ВремТаблица.Производитель,
	                      |	ВремТаблица.СсылкаWEB,
	                      |	ВремТаблица.ДляАппарата,
	                      |	ВремТаблица.ДляБренда,
	                      |	ВремТаблица.ТипАксессуара,
	                      |	ВремТаблица.Серия,
	                      |	ВремТаблица.Распродажа,
	                      |	ВремТаблица.ДляМоделиУстройства,
	                      |	ВремТаблица.СсылкаНаАрхивФото,
	                      |	ВремТаблица.Топ,
	                      |	ВремТаблица.Новинка,
	                      |	ВремТаблица.ДатаВыпуска КАК ДатаВыпуска,
	                      |	ВремТаблица.ПродажиКоличество,
	                      |	ВремТаблица.ЛистПрайса КАК ЛистПрайса,
	                      |	ВремТаблица.ОборотРелиз,
	                      |	ВремТаблица.СкладРелиз,
	                      |	ВремТаблица.КоличествоОжидается,
	                      |	ВремТаблица.ДатаПоступления,
	                      |	ВремТаблица.ТипРазъема,
	                      |	ВЫБОР
	                      |		КОГДА МатрицаКлиента.Ссылка ЕСТЬ NULL
	                      |			ТОГДА 0
	                      |		ИНАЧЕ 1
	                      |	КОНЕЦ КАК ЕстьВМатрицеКлиента
	                      |ИЗ
	                      |	ВремТаблица КАК ВремТаблица
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ МатрицаКлиента КАК МатрицаКлиента
	                      |		ПО ВремТаблица.ДляМоделиУстройства = МатрицаКлиента.Модель
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаВыпуска УБЫВ
	                      |ИТОГИ ПО
	                      |	ЛистПрайса КАК ЛистПрайса");
						  
	Запрос.УстановитьПараметр("ЗначениеС", Истина);
	Запрос.УстановитьПараметр("СвойствоС", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Включен в рассылку (Склады и магазины)"));
	Запрос.УстановитьПараметр("Цена", Цена);
	Запрос.УстановитьПараметр("СсылкаWEB", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СсылкаWEB (Справочник ""Номенклатура"" (Общие))"));
	Запрос.УстановитьПараметр("ЛистПрайса", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Лист прайса (Справочник ""Номенклатура"" (Общие))"));
	Запрос.УстановитьПараметр("СписокНоменклатурыДляРассылки", СписокНоменклатурыДляРассылки);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ДопРеквизитСкладРелиз", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Склад релиза"));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ПредЗаказ", ПредЗаказ);

	
	Результат =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Если Результат.Количество() = 0 Тогда
	//	Возврат Неопределено;
	//Иначе
		Возврат Результат;
	//КонецЕСли;
КонецФункции

Функция ПолучитьСтрокиДляЗаполненияФайлаПрайсСРазбивкойНовый3(СписокНоменклатурыДляРассылки, СписокЦен, Клиент, ПредЗаказ)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Номенклатура.Ссылка КАК Номенклатура,
	                      |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
	                      |ПОМЕСТИТЬ вт_ном
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                      |		ПО (ХарактеристикиНоменклатуры.Владелец = Номенклатура.Ссылка)
	                      |ГДЕ
	                      |	Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Номенклатура.Ссылка,
	                      |	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Номенклатура.Ссылка,
	                      |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                      |		ПО (ХарактеристикиНоменклатуры.Владелец = Номенклатура.ВидНоменклатуры)
	                      |ГДЕ
	                      |	Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Номенклатура,
	                      |	Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	вт_ном.Номенклатура КАК Номенклатура,
	                      |	вт_ном.Характеристика КАК Характеристика,
	                      |	ВЫРАЗИТЬ(НоменклатураДополнительныеРеквизиты.Значение КАК Справочник.ЗначенияСвойствОбъектов) КАК ЛистПрайса
	                      |ПОМЕСТИТЬ вт_Номенклатура
	                      |ИЗ
	                      |	вт_ном КАК вт_ном
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	                      |		ПО вт_ном.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	                      |			И (НоменклатураДополнительныеРеквизиты.Свойство = &ЛистПрайса)
	                      |			И ((ВЫРАЗИТЬ(НоменклатураДополнительныеРеквизиты.Значение КАК Справочник.ЗначенияСвойствОбъектов)) <> ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка))
	                      |			И ((ВЫРАЗИТЬ(НоменклатураДополнительныеРеквизиты.Значение КАК Справочник.ЗначенияСвойствОбъектов)) <> &НетВПрайсе)
	                      |ГДЕ
	                      |	(ВЫРАЗИТЬ(НоменклатураДополнительныеРеквизиты.Значение КАК Справочник.ЗначенияСвойствОбъектов)) <> ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)
	                      |	И вт_ном.Номенклатура В(&СписокНоменклатурыДляРассылки)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Номенклатура,
	                      |	Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДополнительныеСведения.Объект КАК Номенклатура,
	                      |	ДополнительныеСведения.Значение
	                      |ПОМЕСТИТЬ вт_Номенклатура_Топ
	                      |ИЗ
	                      |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                      |ГДЕ
	                      |	ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура
	                      |	И ДополнительныеСведения.Свойство.Заголовок = ""Топ!!!""
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДополнительныеСведения.Объект КАК Характеристика,
	                      |	ДополнительныеСведения.Значение
	                      |ПОМЕСТИТЬ вт_Характеристика_Новинка
	                      |ИЗ
	                      |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                      |ГДЕ
	                      |	ДополнительныеСведения.Объект ССЫЛКА Справочник.ХарактеристикиНоменклатуры
	                      |	И ДополнительныеСведения.Свойство.Заголовок = ""Новинка!!!""
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СкладыДополнительныеРеквизиты.Ссылка КАК Склад
	                      |ПОМЕСТИТЬ вт_Склады
	                      |ИЗ
	                      |	Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	                      |ГДЕ
	                      |	СкладыДополнительныеРеквизиты.Свойство = &СвойствоС
	                      |	И СкладыДополнительныеРеквизиты.Значение = &ЗначениеС
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Склад
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	АналитикаУчетаНоменклатуры.КлючАналитики
	                      |ПОМЕСТИТЬ вт_АналитикаНомен
	                      |ИЗ
	                      |	РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
	                      |ГДЕ
	                      |	(АналитикаУчетаНоменклатуры.Номенклатура, АналитикаУчетаНоменклатуры.Характеристика) В
	                      |			(ВЫБРАТЬ
	                      |				ВТНоменклатура.Номенклатура,
	                      |				ВТНоменклатура.Характеристика
	                      |			ИЗ
	                      |				вт_Номенклатура КАК ВТНоменклатура)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	АналитикаУчетаПоПартнерам.КлючАналитики
	                      |ПОМЕСТИТЬ вт_АналитикаПарнер
	                      |ИЗ
	                      |	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	                      |ГДЕ
	                      |	АналитикаУчетаПоПартнерам.Партнер = &Клиент
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	                      |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	                      |	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	                      |ПОМЕСТИТЬ ВТ_ШК
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                      |ГДЕ
	                      |	(ШтрихкодыНоменклатуры.Номенклатура, ШтрихкодыНоменклатуры.Характеристика) В
	                      |			(ВЫБРАТЬ
	                      |				Т.Номенклатура,
	                      |				Т.Характеристика
	                      |			ИЗ
	                      |				ВТ_Номенклатура КАК Т)
	                      |	И ШтрихкодыНоменклатуры.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ВложенныйЗапрос.Номенклатура,
	                      |	ВложенныйЗапрос.Характеристика,
	                      |	СУММА(ВложенныйЗапрос.СвободноДляПродажи) КАК СвободноДляПродажи
	                      |ПОМЕСТИТЬ вт_СвободноДляПродажи
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		Т.Номенклатура КАК Номенклатура,
	                      |		Т.Характеристика КАК Характеристика,
	                      |		Т.Склад КАК Склад,
	                      |		Т.ВНаличииОстаток - Т.ВРезервеСоСкладаОстаток КАК ВНаличииДляПродажи,
	                      |		Т.ВНаличииОстаток - Т.ВРезервеСоСкладаОстаток КАК СвободноДляПродажи
	                      |	ИЗ
	                      |		РегистрНакопления.СвободныеОстатки.Остатки(
	                      |				,
	                      |				(Номенклатура, Характеристика) В
	                      |						(ВЫБРАТЬ
	                      |							Т.Номенклатура,
	                      |							Т.Характеристика
	                      |						ИЗ
	                      |							ВТ_Номенклатура КАК Т)
	                      |					И Склад В
	                      |						(ВЫБРАТЬ
	                      |							вт_Склады.Склад
	                      |						ИЗ
	                      |							вт_Склады)) КАК Т
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Т.Номенклатура,
	                      |		Т.Характеристика,
	                      |		Т.Склад,
	                      |		0,
	                      |		-Т.НаличиеПодЗаказОстаток
	                      |	ИЗ
	                      |		РегистрНакопления.ОбеспечениеЗаказов.Остатки(
	                      |				,
	                      |				(Номенклатура, Характеристика) В
	                      |						(ВЫБРАТЬ
	                      |							Т.Номенклатура,
	                      |							Т.Характеристика
	                      |						ИЗ
	                      |							ВТ_Номенклатура КАК Т)
	                      |					И Склад В
	                      |						(ВЫБРАТЬ
	                      |							вт_Склады.Склад
	                      |						ИЗ
	                      |							вт_Склады)) КАК Т
	                      |	ГДЕ
	                      |		Т.НаличиеПодЗаказОстаток > 0
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Т.Номенклатура,
	                      |		Т.Характеристика,
	                      |		Т.Склад,
	                      |		0,
	                      |		Т.Количество
	                      |	ИЗ
	                      |		РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Т
	                      |	ГДЕ
	                      |		Т.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1)
	                      |		И Т.Количество < 0
	                      |		И Т.Склад В
	                      |				(ВЫБРАТЬ
	                      |					вт_Склады.Склад
	                      |				ИЗ
	                      |					вт_Склады)) КАК ВложенныйЗапрос
	                      |ГДЕ
	                      |	ВложенныйЗапрос.Склад В
	                      |			(ВЫБРАТЬ
	                      |				вт_Склады.Склад
	                      |			ИЗ
	                      |				вт_Склады)
	                      |	И ВложенныйЗапрос.СвободноДляПродажи > 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВложенныйЗапрос.Номенклатура,
	                      |	ВложенныйЗапрос.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	КонтрагентыДополнительныеРеквизиты.Значение КАК СкладРелиз
	                      |ПОМЕСТИТЬ вт_СкладРелиз
	                      |ИЗ
	                      |	Справочник.Партнеры.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
	                      |ГДЕ
	                      |	КонтрагентыДополнительныеРеквизиты.Ссылка = &Клиент
	                      |	И КонтрагентыДополнительныеРеквизиты.Свойство = &ДопРеквизитСкладРелиз
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыНаСкладахОбороты.Номенклатура,
	                      |	ТоварыНаСкладахОбороты.Характеристика,
	                      |	ТоварыНаСкладахОбороты.ВНаличииПриход КАК ВНаличииОборот,
	                      |	ТоварыНаСкладахОбороты.Склад
	                      |ПОМЕСТИТЬ вт_ОборотПоСкладуРелиза
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыНаСкладах.Обороты(
	                      |			,
	                      |			,
	                      |			,
	                      |			(Номенклатура, Характеристика) В
	                      |					(ВЫБРАТЬ
	                      |						Т.Номенклатура,
	                      |						Т.Характеристика
	                      |					ИЗ
	                      |						ВТ_Номенклатура КАК Т)
	                      |				И Склад В
	                      |					(ВЫБРАТЬ
	                      |						вт_СкладРелиз.СкладРелиз
	                      |					ИЗ
	                      |						вт_СкладРелиз КАК вт_СкладРелиз)) КАК ТоварыНаСкладахОбороты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыКПоступлениюОстатки.Номенклатура,
	                      |	ТоварыКПоступлениюОстатки.Характеристика,
	                      |	СУММА(ТоварыКПоступлениюОстатки.КОформлениюНакладныхПоРаспоряжениюОстаток) КАК КПоступлениюОстаток,
	                      |	МИНИМУМ(ВЫБОР
	                      |			КОГДА ТоварыКПоступлениюОстатки.ДокументПоступления ССЫЛКА Документ.ПриобретениеТоваровУслуг
	                      |				ТОГДА ВЫБОР
	                      |						КОГДА НАЧАЛОПЕРИОДА(ТоварыКПоступлениюОстатки.ДокументПоступления.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	                      |							ТОГДА &ТекущаяДата
	                      |						ИНАЧЕ ТоварыКПоступлениюОстатки.ДокументПоступления.Дата
	                      |					КОНЕЦ
	                      |			КОГДА ТоварыКПоступлениюОстатки.ДокументПоступления ССЫЛКА Документ.ЗаказПоставщику
	                      |				ТОГДА ВЫБОР
	                      |						КОГДА НАЧАЛОПЕРИОДА(ТоварыКПоступлениюОстатки.ДокументПоступления.ДатаПоступления, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	                      |							ТОГДА &ТекущаяДата
	                      |						ИНАЧЕ ТоварыКПоступлениюОстатки.ДокументПоступления.ДатаПоступления
	                      |					КОНЕЦ
	                      |		КОНЕЦ) КАК ДатаПоступления
	                      |ПОМЕСТИТЬ вт_ТоварыКПоступлению
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыКПоступлению.Остатки(
	                      |			,
	                      |			(Номенклатура, Характеристика) В
	                      |					(ВЫБРАТЬ
	                      |						Т.Номенклатура,
	                      |						Т.Характеристика
	                      |					ИЗ
	                      |						ВТ_Номенклатура КАК Т)
	                      |				И (ДокументПоступления ССЫЛКА Документ.ПриобретениеТоваровУслуг
	                      |					ИЛИ ДокументПоступления ССЫЛКА Документ.ЗаказПоставщику)) КАК ТоварыКПоступлениюОстатки
	                      |ГДЕ
	                      |	ТоварыКПоступлениюОстатки.КОформлениюНакладныхПоРаспоряжениюОстаток > 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыКПоступлениюОстатки.Номенклатура,
	                      |	ТоварыКПоступлениюОстатки.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	вт_Номенклатура.Номенклатура КАК Номенклатура,
	                      |	ЕСТЬNULL(вт_Номенклатура.Характеристика, """") КАК Характеристика,
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ВидЦены, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) КАК ВидЦены,
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Стоимость,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) > 10
	                      |			ТОГДА "">10""
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) <= 0
	                      |			ТОГДА ""ожид.""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0)
	                      |	КОНЕЦ КАК ДоступноеКоличество,
	                      |	ЕСТЬNULL(ШК.Штрихкод, """") КАК Артикул,
	                      |	ЕСТЬNULL(вт_Номенклатура.Номенклатура.Производитель, """") КАК Производитель,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""СсылкаWEB""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК СсылкаWEB,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для аппарата""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляАппарата,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для бренда""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляБренда,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Тип аксессуара""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ТипАксессуара,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Серия""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК Серия,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Распродажа""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК Распродажа,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для модели устройства""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляМоделиУстройства,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Заголовок = ""ссылка на фото №2""
	                      |				ТОГДА ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК СсылкаНаАрхивФото,
	                      |	МАКСИМУМ(ЕСТЬNULL(вт_Номенклатура_Топ.Значение, """")) КАК Топ,
	                      |	МАКСИМУМ(ЕСТЬNULL(вт_Характеристика_Новинка.Значение, """")) КАК Новинка,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Дата выхода аппарата""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	                      |		КОНЕЦ) КАК ДатаВыпуска,
	                      |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот, 0)) КАК ПродажиКоличество,
	                      |	вт_Номенклатура.ЛистПрайса КАК ЛистПрайса,
	                      |	СУММА(ЕСТЬNULL(вт_ОборотПоСкладуРелиза.ВНаличииОборот, 0)) КАК ОборотРелиз,
	                      |	МАКСИМУМ(ЕСТЬNULL(вт_ОборотПоСкладуРелиза.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))) КАК СкладРелиз,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) < 0
	                      |			ТОГДА 0
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) > 10
	                      |			ТОГДА "">10""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0)
	                      |	КОНЕЦ КАК КоличествоОжидается,
	                      |	вт_ТоварыКПоступлению.ДатаПоступления,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Тип разъема""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ТипРазъема
	                      |ПОМЕСТИТЬ ВремТаблица
	                      |ИЗ
	                      |	вт_Номенклатура КАК вт_Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                      |				,
	                      |				ВидЦены В (&СписокЦен)
	                      |					И (Номенклатура, Характеристика) В
	                      |						(ВЫБРАТЬ
	                      |							вт_Номенклатура.Номенклатура,
	                      |							вт_Номенклатура.Характеристика
	                      |						ИЗ
	                      |							вт_Номенклатура КАК вт_Номенклатура)) КАК ЦеныНоменклатурыСрезПоследних
	                      |		ПО вт_Номенклатура.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СвободноДляПродажи КАК вт_СвободноДляПродажи
	                      |		ПО вт_Номенклатура.Номенклатура = вт_СвободноДляПродажи.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = вт_СвободноДляПродажи.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_Номенклатура_Топ КАК вт_Номенклатура_Топ
	                      |		ПО вт_Номенклатура.Номенклатура = вт_Номенклатура_Топ.Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_Характеристика_Новинка КАК вт_Характеристика_Новинка
	                      |		ПО вт_Номенклатура.Характеристика = вт_Характеристика_Новинка.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	                      |		ПО вт_Номенклатура.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	                      |		ПО вт_Номенклатура.Номенклатура = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец
	                      |			И вт_Номенклатура.Характеристика = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШК КАК ШК
	                      |		ПО вт_Номенклатура.Номенклатура = ШК.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ШК.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	                      |				,
	                      |				,
	                      |				,
	                      |				АналитикаУчетаНоменклатуры В
	                      |						(ВЫБРАТЬ
	                      |							ВТАналитика.КлючАналитики
	                      |						ИЗ
	                      |							вт_АналитикаНомен КАК ВТАналитика)
	                      |					И АналитикаУчетаПоПартнерам В
	                      |						(ВЫБРАТЬ
	                      |							ВТАналитика.КлючАналитики
	                      |						ИЗ
	                      |							вт_АналитикаПарнер КАК ВТАналитика)) КАК ВыручкаИСебестоимостьПродажОбороты
	                      |		ПО вт_Номенклатура.Номенклатура = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика
	                      |			И (ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = &Клиент)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ОборотПоСкладуРелиза КАК вт_ОборотПоСкладуРелиза
	                      |		ПО вт_Номенклатура.Номенклатура = вт_ОборотПоСкладуРелиза.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = вт_ОборотПоСкладуРелиза.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ТоварыКПоступлению КАК вт_ТоварыКПоступлению
	                      |		ПО вт_Номенклатура.Номенклатура = вт_ТоварыКПоступлению.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = вт_ТоварыКПоступлению.Характеристика
	                      |ГДЕ
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) <> 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	вт_Номенклатура.Номенклатура,
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ВидЦены, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)),
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0),
	                      |	ЕСТЬNULL(ШК.Штрихкод, """"),
	                      |	вт_Номенклатура.ЛистПрайса,
	                      |	ЕСТЬNULL(вт_Номенклатура.Характеристика, """"),
	                      |	ЕСТЬNULL(вт_Номенклатура.Номенклатура.Производитель, """"),
	                      |	вт_ТоварыКПоступлению.ДатаПоступления,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) < 0
	                      |			ТОГДА 0
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) > 10
	                      |			ТОГДА "">10""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0)
	                      |	КОНЕЦ,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) > 10
	                      |			ТОГДА "">10""
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) <= 0
	                      |			ТОГДА ""ожид.""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0)
	                      |	КОНЕЦ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Ссылка КАК Ссылка,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Владелец КАК Владелец,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Код КАК Код,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Наименование КАК Наименование,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Артикул КАК Артикул,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Цена КАК Цена,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Дата КАК Дата,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.СсылкаНаМодель КАК СсылкаНаМодель,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.СсылкаНаГрафикМоделиЯМ КАК СсылкаНаГрафикМоделиЯМ,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.IDЯМ КАК IDЯМ,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Модель КАК Модель,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Бренд КАК Бренд,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.ТипАппарата КАК ТипАппарата,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Предопределенный КАК Предопределенный,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	                      |ПОМЕСТИТЬ МатрицаКлиента
	                      |ИЗ
	                      |	РегистрСведений.дпСоответствиеМатриц КАК дпСоответствиеМатриц
	                      |ГДЕ
	                      |	дпСоответствиеМатриц.АппаратКлиента.Владелец = &Клиент
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ВремТаблица.Номенклатура,
	                      |	ВремТаблица.Характеристика,
	                      |	ВремТаблица.ВидЦены КАК ВидЦены,
	                      |	ВремТаблица.Стоимость,
	                      |	ВЫБОР
	                      |		КОГДА &ПредЗаказ
	                      |			ТОГДА 0
	                      |		ИНАЧЕ ВремТаблица.ДоступноеКоличество
	                      |	КОНЕЦ КАК ДоступноеКоличество,
	                      |	ВремТаблица.Артикул,
	                      |	ВремТаблица.Производитель,
	                      |	ВремТаблица.СсылкаWEB,
	                      |	ВремТаблица.ДляАппарата,
	                      |	ВремТаблица.ДляБренда,
	                      |	ВремТаблица.ТипАксессуара,
	                      |	ВремТаблица.Серия,
	                      |	ВремТаблица.Распродажа,
	                      |	ВремТаблица.ДляМоделиУстройства,
	                      |	ВремТаблица.СсылкаНаАрхивФото,
	                      |	ВремТаблица.Топ,
	                      |	ВремТаблица.Новинка,
	                      |	ВремТаблица.ДатаВыпуска КАК ДатаВыпуска,
	                      |	ВремТаблица.ПродажиКоличество,
	                      |	ВремТаблица.ЛистПрайса КАК ЛистПрайса,
	                      |	ВремТаблица.ОборотРелиз,
	                      |	ВремТаблица.СкладРелиз,
	                      |	ВремТаблица.КоличествоОжидается,
	                      |	ВремТаблица.ДатаПоступления,
	                      |	ВремТаблица.ТипРазъема,
	                      |	ВЫБОР
	                      |		КОГДА МатрицаКлиента.Ссылка ЕСТЬ NULL
	                      |			ТОГДА 0
	                      |		ИНАЧЕ 1
	                      |	КОНЕЦ КАК ЕстьВМатрицеКлиента
	                      |ИЗ
	                      |	ВремТаблица КАК ВремТаблица
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ МатрицаКлиента КАК МатрицаКлиента
	                      |		ПО ВремТаблица.ДляМоделиУстройства = МатрицаКлиента.Модель
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаВыпуска УБЫВ
	                      |ИТОГИ ПО
	                      |	ВидЦены,
	                      |	ЛистПрайса КАК ЛистПрайса");
						  
	Запрос.УстановитьПараметр("ЗначениеС", Истина);
	Запрос.УстановитьПараметр("СвойствоС", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Включен в рассылку (Склады и магазины)"));
	Запрос.УстановитьПараметр("СписокЦен", СписокЦен);
	Запрос.УстановитьПараметр("СсылкаWEB", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СсылкаWEB (Справочник ""Номенклатура"" (Общие))"));
	Запрос.УстановитьПараметр("ЛистПрайса", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Лист прайса (Справочник ""Номенклатура"" (Общие))"));
	Запрос.УстановитьПараметр("СписокНоменклатурыДляРассылки", СписокНоменклатурыДляРассылки);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ДопРеквизитСкладРелиз", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Склад релиза"));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ПредЗаказ", ПредЗаказ);
	Запрос.УстановитьПараметр("НетВПрайсе", Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Нет в прайсе",Истина));

	
	Результат =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Если Результат.Количество() = 0 Тогда
	//	Возврат Неопределено;
	//Иначе
		Возврат Результат;
	//КонецЕСли;
КонецФункции

Функция ПолучитьСтрокиДляЗаполненияФайлаПрайсСРазбивкойНовый4(СписокНоменклатурыДляРассылки, СписокЦен, Клиент, ПредЗаказ, МенеджерВременТаблиц, РассылкаСШКПроизводителя = Ложь)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	КонтрагентыДополнительныеРеквизиты.Значение КАК СкладРелиз
	                      |ПОМЕСТИТЬ вт_СкладРелиз
	                      |ИЗ
	                      |	Справочник.Партнеры.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
	                      |ГДЕ
	                      |	КонтрагентыДополнительныеРеквизиты.Ссылка = &Клиент
	                      |	И КонтрагентыДополнительныеРеквизиты.Свойство = &ДопРеквизитСкладРелиз
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	АналитикаУчетаПоПартнерам.КлючАналитики
	                      |ПОМЕСТИТЬ вт_АналитикаПарнер
	                      |ИЗ
	                      |	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	                      |ГДЕ
	                      |	АналитикаУчетаПоПартнерам.Партнер = &Клиент
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СписокЦенСШКПроизводителя.ВидЦены,
	                      |	СписокЦенСШКПроизводителя.РассылкаСШКПроизводителя
	                      |ПОМЕСТИТЬ вт_СписокЦенСШКПроизводителя
	                      |ИЗ
	                      |	&СписокЦенСШКПроизводителя КАК СписокЦенСШКПроизводителя
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыНаСкладахОбороты.Номенклатура,
	                      |	ТоварыНаСкладахОбороты.Характеристика,
	                      |	ТоварыНаСкладахОбороты.ВНаличииПриход КАК ВНаличииОборот,
	                      |	ТоварыНаСкладахОбороты.Склад
	                      |ПОМЕСТИТЬ вт_ОборотПоСкладуРелиза
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыНаСкладах.Обороты(
	                      |			,
	                      |			,
	                      |			,
	                      |			(Номенклатура, Характеристика) В
	                      |					(ВЫБРАТЬ
	                      |						Т.Номенклатура,
	                      |						Т.Характеристика
	                      |					ИЗ
	                      |						ВТ_Номенклатура КАК Т)
	                      |				И Склад В
	                      |					(ВЫБРАТЬ
	                      |						вт_СкладРелиз.СкладРелиз
	                      |					ИЗ
	                      |						вт_СкладРелиз КАК вт_СкладРелиз)) КАК ТоварыНаСкладахОбороты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	вт_Номенклатура.Номенклатура КАК Номенклатура,
	                      |	ЕСТЬNULL(вт_Номенклатура.Характеристика, """") КАК Характеристика,
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ВидЦены, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) КАК ВидЦены,
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Стоимость,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) > 10
	                      |			ТОГДА "">10""
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) <= 0
	                      |			ТОГДА ""ожид.""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0)
	                      |	КОНЕЦ КАК ДоступноеКоличество,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_СписокЦенСШКПроизводителя.РассылкаСШКПроизводителя, ЛОЖЬ) = ИСТИНА
	                      |			ТОГДА ЕСТЬNULL(ШКПроизводителя.Штрихкод, """")
	                      |		ИНАЧЕ ЕСТЬNULL(ШК.Штрихкод, """")
	                      |	КОНЕЦ КАК Артикул,
	                      |	ЕСТЬNULL(вт_Номенклатура.Номенклатура.Производитель, """") КАК Производитель,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""СсылкаWEB""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК СсылкаWEB,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для аппарата""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляАппарата,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для бренда""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляБренда,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Тип аксессуара""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ТипАксессуара,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Серия""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК Серия,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Распродажа""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК Распродажа,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для модели устройства""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляМоделиУстройства,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Заголовок = ""ссылка на фото №2""
	                      |				ТОГДА ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК СсылкаНаАрхивФото,
	                      |	МАКСИМУМ(ЕСТЬNULL(вт_Номенклатура_Топ.Значение, """")) КАК Топ,
	                      |	МАКСИМУМ(ЕСТЬNULL(вт_Характеристика_Новинка.Значение, """")) КАК Новинка,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Дата выхода аппарата""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	                      |		КОНЕЦ) КАК ДатаВыпуска,
	                      |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот, 0)) КАК ПродажиКоличество,
	                      |	вт_Номенклатура.ЛистПрайса КАК ЛистПрайса,
	                      |	СУММА(ЕСТЬNULL(вт_ОборотПоСкладуРелиза.ВНаличииОборот, 0)) КАК ОборотРелиз,
	                      |	МАКСИМУМ(ЕСТЬNULL(вт_ОборотПоСкладуРелиза.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))) КАК СкладРелиз,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) < 0
	                      |			ТОГДА 0
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) > 10
	                      |			ТОГДА "">10""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0)
	                      |	КОНЕЦ КАК КоличествоОжидается,
	                      |	вт_ТоварыКПоступлению.ДатаПоступления,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Тип разъема""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ТипРазъема
	                      |ПОМЕСТИТЬ ВремТаблица
	                      |ИЗ
	                      |	вт_Номенклатура КАК вт_Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                      |				,
	                      |				ВидЦены В (&СписокЦен)
	                      |					И (Номенклатура, Характеристика) В
	                      |						(ВЫБРАТЬ
	                      |							вт_Номенклатура.Номенклатура,
	                      |							вт_Номенклатура.Характеристика
	                      |						ИЗ
	                      |							вт_Номенклатура КАК вт_Номенклатура)) КАК ЦеныНоменклатурыСрезПоследних
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ вт_СписокЦенСШКПроизводителя КАК вт_СписокЦенСШКПроизводителя
	                      |			ПО ЦеныНоменклатурыСрезПоследних.ВидЦены = вт_СписокЦенСШКПроизводителя.ВидЦены
	                      |		ПО вт_Номенклатура.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СвободноДляПродажи КАК вт_СвободноДляПродажи
	                      |		ПО вт_Номенклатура.Номенклатура = вт_СвободноДляПродажи.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = вт_СвободноДляПродажи.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_Номенклатура_Топ КАК вт_Номенклатура_Топ
	                      |		ПО вт_Номенклатура.Номенклатура = вт_Номенклатура_Топ.Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_Характеристика_Новинка КАК вт_Характеристика_Новинка
	                      |		ПО вт_Номенклатура.Характеристика = вт_Характеристика_Новинка.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	                      |		ПО вт_Номенклатура.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	                      |		ПО вт_Номенклатура.Номенклатура = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец
	                      |			И вт_Номенклатура.Характеристика = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШК КАК ШК
	                      |		ПО вт_Номенклатура.Номенклатура = ШК.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ШК.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШКПроизводителя КАК ШКПроизводителя
	                      |		ПО вт_Номенклатура.Номенклатура = ШКПроизводителя.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ШКПроизводителя.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	                      |				,
	                      |				,
	                      |				,
	                      |				АналитикаУчетаНоменклатуры В
	                      |						(ВЫБРАТЬ
	                      |							ВТАналитика.КлючАналитики
	                      |						ИЗ
	                      |							вт_АналитикаНомен КАК ВТАналитика)
	                      |					И АналитикаУчетаПоПартнерам В
	                      |						(ВЫБРАТЬ
	                      |							ВТАналитика.КлючАналитики
	                      |						ИЗ
	                      |							вт_АналитикаПарнер КАК ВТАналитика)) КАК ВыручкаИСебестоимостьПродажОбороты
	                      |		ПО вт_Номенклатура.Номенклатура = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика
	                      |			И (ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = &Клиент)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ОборотПоСкладуРелиза КАК вт_ОборотПоСкладуРелиза
	                      |		ПО вт_Номенклатура.Номенклатура = вт_ОборотПоСкладуРелиза.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = вт_ОборотПоСкладуРелиза.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ТоварыКПоступлению КАК вт_ТоварыКПоступлению
	                      |		ПО вт_Номенклатура.Номенклатура = вт_ТоварыКПоступлению.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = вт_ТоварыКПоступлению.Характеристика
	                      |ГДЕ
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) <> 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	вт_Номенклатура.Номенклатура,
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ВидЦены, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)),
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0),
	                      |	вт_Номенклатура.ЛистПрайса,
	                      |	ЕСТЬNULL(вт_Номенклатура.Характеристика, """"),
	                      |	ЕСТЬNULL(вт_Номенклатура.Номенклатура.Производитель, """"),
	                      |	вт_ТоварыКПоступлению.ДатаПоступления,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) < 0
	                      |			ТОГДА 0
	                      |		КОГДА ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0) > 10
	                      |			ТОГДА "">10""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_ТоварыКПоступлению.КПоступлениюОстаток, 0)
	                      |	КОНЕЦ,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) > 10
	                      |			ТОГДА "">10""
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) <= 0
	                      |			ТОГДА ""ожид.""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0)
	                      |	КОНЕЦ,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_СписокЦенСШКПроизводителя.РассылкаСШКПроизводителя, ЛОЖЬ) = ИСТИНА
	                      |			ТОГДА ЕСТЬNULL(ШКПроизводителя.Штрихкод, """")
	                      |		ИНАЧЕ ЕСТЬNULL(ШК.Штрихкод, """")
	                      |	КОНЕЦ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Ссылка КАК Ссылка,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Владелец КАК Владелец,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Код КАК Код,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Наименование КАК Наименование,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Артикул КАК Артикул,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Цена КАК Цена,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Дата КАК Дата,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.СсылкаНаМодель КАК СсылкаНаМодель,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.СсылкаНаГрафикМоделиЯМ КАК СсылкаНаГрафикМоделиЯМ,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.IDЯМ КАК IDЯМ,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Модель КАК Модель,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Бренд КАК Бренд,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.ТипАппарата КАК ТипАппарата,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.Предопределенный КАК Предопределенный,
	                      |	дпСоответствиеМатриц.АппаратОрганизации.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	                      |ПОМЕСТИТЬ МатрицаКлиента
	                      |ИЗ
	                      |	РегистрСведений.дпСоответствиеМатриц КАК дпСоответствиеМатриц
	                      |ГДЕ
	                      |	дпСоответствиеМатриц.АппаратКлиента.Владелец = &Клиент
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ВремТаблица.Номенклатура,
	                      |	ВремТаблица.Характеристика,
	                      |	ВремТаблица.ВидЦены КАК ВидЦены,
	                      |	ВремТаблица.Стоимость,
	                      |	ВЫБОР
	                      |		КОГДА &ПредЗаказ
	                      |			ТОГДА 0
	                      |		ИНАЧЕ ВремТаблица.ДоступноеКоличество
	                      |	КОНЕЦ КАК ДоступноеКоличество,
	                      |	ВремТаблица.Артикул,
	                      |	ВремТаблица.Производитель,
	                      |	ВремТаблица.СсылкаWEB,
	                      |	ВремТаблица.ДляАппарата,
	                      |	ВремТаблица.ДляБренда,
	                      |	ВремТаблица.ТипАксессуара,
	                      |	ВремТаблица.Серия,
	                      |	ВремТаблица.Распродажа,
	                      |	ВремТаблица.ДляМоделиУстройства,
	                      |	ВремТаблица.СсылкаНаАрхивФото,
	                      |	ВремТаблица.Топ,
	                      |	ВремТаблица.Новинка,
	                      |	ВремТаблица.ДатаВыпуска КАК ДатаВыпуска,
	                      |	ВремТаблица.ПродажиКоличество,
	                      |	ВремТаблица.ЛистПрайса КАК ЛистПрайса,
	                      |	ВремТаблица.ОборотРелиз,
	                      |	ВремТаблица.СкладРелиз,
	                      |	ВремТаблица.КоличествоОжидается,
	                      |	ВремТаблица.ДатаПоступления,
	                      |	ВремТаблица.ТипРазъема,
	                      |	ВЫБОР
	                      |		КОГДА МатрицаКлиента.Ссылка ЕСТЬ NULL
	                      |			ТОГДА 0
	                      |		ИНАЧЕ 1
	                      |	КОНЕЦ КАК ЕстьВМатрицеКлиента
	                      |ИЗ
	                      |	ВремТаблица КАК ВремТаблица
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ МатрицаКлиента КАК МатрицаКлиента
	                      |		ПО ВремТаблица.ДляМоделиУстройства = МатрицаКлиента.Модель
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаВыпуска УБЫВ
	                      |ИТОГИ ПО
	                      |	ВидЦены,
	                      |	ЛистПрайса КАК ЛистПрайса
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |УНИЧТОЖИТЬ вт_СкладРелиз
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |УНИЧТОЖИТЬ вт_ОборотПоСкладуРелиза
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |УНИЧТОЖИТЬ ВремТаблица
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |УНИЧТОЖИТЬ вт_АналитикаПарнер
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |УНИЧТОЖИТЬ МатрицаКлиента");
						  
	Запрос.МенеджерВременныхТаблиц = МенеджерВременТаблиц;					  
	Запрос.УстановитьПараметр("ЗначениеС", Истина);
	Запрос.УстановитьПараметр("СвойствоС", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Включен в рассылку (Склады и магазины)"));
	Запрос.УстановитьПараметр("СписокЦен", СписокЦен.ВыгрузитьКолонку("ВидЦены"));
	Запрос.УстановитьПараметр("СписокЦенСШКПроизводителя", СписокЦен);
	Запрос.УстановитьПараметр("СсылкаWEB", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СсылкаWEB (Справочник ""Номенклатура"" (Общие))"));
	Запрос.УстановитьПараметр("ЛистПрайса", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Лист прайса (Справочник ""Номенклатура"" (Общие))"));
	Запрос.УстановитьПараметр("СписокНоменклатурыДляРассылки", СписокНоменклатурыДляРассылки);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ДопРеквизитСкладРелиз", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Склад релиза"));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ПредЗаказ", ПредЗаказ);

	
	Результат =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Если Результат.Количество() = 0 Тогда
	//	Возврат Неопределено;
	//Иначе
		Возврат Результат;
	//КонецЕСли;
КонецФункции

Функция ПолучитьВременныеТаблицы(ПредЗаказ, СписокНоменклатурыДляРассылки, ТекПартнер)
	МенеждерВремТабл = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Номенклатура.Ссылка КАК Номенклатура,
	                      |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
	                      |ПОМЕСТИТЬ вт_ном
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                      |		ПО (ХарактеристикиНоменклатуры.Владелец = Номенклатура.Ссылка)
	                      |ГДЕ
	                      |	Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
	                      |	И НЕ Номенклатура.ПометкаУдаления
	                      |	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Номенклатура.Ссылка,
	                      |	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	                      |	И НЕ Номенклатура.ПометкаУдаления
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Номенклатура.Ссылка,
	                      |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                      |		ПО (ХарактеристикиНоменклатуры.Владелец = Номенклатура.ВидНоменклатуры)
	                      |ГДЕ
	                      |	Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры)
	                      |	И НЕ Номенклатура.ПометкаУдаления
	                      |	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Номенклатура,
	                      |	Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	вт_ном.Номенклатура КАК Номенклатура,
	                      |	вт_ном.Характеристика КАК Характеристика,
	                      |	ВЫРАЗИТЬ(НоменклатураДополнительныеРеквизиты.Значение КАК Справочник.ЗначенияСвойствОбъектов) КАК ЛистПрайса
	                      |ПОМЕСТИТЬ вт_Номенклатура
	                      |ИЗ
	                      |	вт_ном КАК вт_ном
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	                      |		ПО вт_ном.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	                      |			И (НоменклатураДополнительныеРеквизиты.Свойство = &ЛистПрайса)
	                      |			И ((ВЫРАЗИТЬ(НоменклатураДополнительныеРеквизиты.Значение КАК Справочник.ЗначенияСвойствОбъектов)) <> ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка))
	                      |			И ((ВЫРАЗИТЬ(НоменклатураДополнительныеРеквизиты.Значение КАК Справочник.ЗначенияСвойствОбъектов)) <> &НетВПрайсе)
	                      |ГДЕ
	                      |	(ВЫРАЗИТЬ(НоменклатураДополнительныеРеквизиты.Значение КАК Справочник.ЗначенияСвойствОбъектов)) <> ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)
	                      |	И вт_ном.Номенклатура В(&СписокНоменклатурыДляРассылки)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Номенклатура,
	                      |	Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДополнительныеСведения.Объект КАК Номенклатура,
	                      |	ДополнительныеСведения.Значение
	                      |ПОМЕСТИТЬ вт_Номенклатура_Топ
	                      |ИЗ
	                      |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                      |ГДЕ
	                      |	ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура
	                      |	И ДополнительныеСведения.Свойство.Заголовок = ""Топ!!!""
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДополнительныеСведения.Объект КАК Характеристика,
	                      |	ДополнительныеСведения.Значение
	                      |ПОМЕСТИТЬ вт_Характеристика_Новинка
	                      |ИЗ
	                      |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                      |ГДЕ
	                      |	ДополнительныеСведения.Объект ССЫЛКА Справочник.ХарактеристикиНоменклатуры
	                      |	И ДополнительныеСведения.Свойство.Заголовок = ""Новинка!!!""
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	АналитикаУчетаНоменклатуры.КлючАналитики
	                      |ПОМЕСТИТЬ вт_АналитикаНомен
	                      |ИЗ
	                      |	РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
	                      |ГДЕ
	                      |	(АналитикаУчетаНоменклатуры.Номенклатура, АналитикаУчетаНоменклатуры.Характеристика) В
	                      |			(ВЫБРАТЬ
	                      |				ВТНоменклатура.Номенклатура,
	                      |				ВТНоменклатура.Характеристика
	                      |			ИЗ
	                      |				вт_Номенклатура КАК ВТНоменклатура)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СкладыДополнительныеРеквизиты.Ссылка КАК Склад
	                      |ПОМЕСТИТЬ вт_Склады
	                      |ИЗ
	                      |	Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	                      |ГДЕ
	                      |	СкладыДополнительныеРеквизиты.Свойство = &СвойствоС
	                      |	И СкладыДополнительныеРеквизиты.Значение = &ЗначениеС
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Склад
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	                      |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	                      |	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	                      |ПОМЕСТИТЬ ВТ_ШК
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                      |ГДЕ
	                      |	(ШтрихкодыНоменклатуры.Номенклатура, ШтрихкодыНоменклатуры.Характеристика) В
	                      |			(ВЫБРАТЬ
	                      |				Т.Номенклатура,
	                      |				Т.Характеристика
	                      |			ИЗ
	                      |				ВТ_Номенклатура КАК Т)
	                      |	И ШтрихкодыНоменклатуры.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(ШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод,
	                      |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	                      |	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	                      |ПОМЕСТИТЬ ВТ_ШКПроизводителя
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                      |ГДЕ
	                      |	(ШтрихкодыНоменклатуры.Номенклатура, ШтрихкодыНоменклатуры.Характеристика) В
	                      |			(ВЫБРАТЬ
	                      |				Т.Номенклатура,
	                      |				Т.Характеристика
	                      |			ИЗ
	                      |				ВТ_Номенклатура КАК Т)
	                      //|	И ШтрихкодыНоменклатуры.Партнер = &ТекПартнер
	                      |	И ШтрихкодыНоменклатуры.Производитель <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ШтрихкодыНоменклатуры.Номенклатура,
	                      |	ШтрихкодыНоменклатуры.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ВложенныйЗапрос.Номенклатура,
	                      |	ВложенныйЗапрос.Характеристика,
	                      |	СУММА(ВложенныйЗапрос.СвободноДляПродажи) КАК СвободноДляПродажи
	                      |ПОМЕСТИТЬ вт_СвободноДляПродажи
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		Т.Номенклатура КАК Номенклатура,
	                      |		Т.Характеристика КАК Характеристика,
	                      |		Т.Склад КАК Склад,
	                      |		Т.ВНаличииОстаток - Т.ВРезервеСоСкладаОстаток КАК ВНаличииДляПродажи,
	                      |		Т.ВНаличииОстаток - Т.ВРезервеСоСкладаОстаток КАК СвободноДляПродажи
	                      |	ИЗ
	                      |		РегистрНакопления.СвободныеОстатки.Остатки(
	                      |				,
	                      |				(Номенклатура, Характеристика) В
	                      |						(ВЫБРАТЬ
	                      |							Т.Номенклатура,
	                      |							Т.Характеристика
	                      |						ИЗ
	                      |							ВТ_Номенклатура КАК Т)
	                      |					И Склад В
	                      |						(ВЫБРАТЬ
	                      |							вт_Склады.Склад
	                      |						ИЗ
	                      |							вт_Склады)) КАК Т
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Т.Номенклатура,
	                      |		Т.Характеристика,
	                      |		Т.Склад,
	                      |		0,
	                      |		-Т.НаличиеПодЗаказОстаток
	                      |	ИЗ
	                      |		РегистрНакопления.ОбеспечениеЗаказов.Остатки(
	                      |				,
	                      |				(Номенклатура, Характеристика) В
	                      |						(ВЫБРАТЬ
	                      |							Т.Номенклатура,
	                      |							Т.Характеристика
	                      |						ИЗ
	                      |							ВТ_Номенклатура КАК Т)
	                      |					И Склад В
	                      |						(ВЫБРАТЬ
	                      |							вт_Склады.Склад
	                      |						ИЗ
	                      |							вт_Склады)) КАК Т
	                      |	ГДЕ
	                      |		Т.НаличиеПодЗаказОстаток > 0
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Т.Номенклатура,
	                      |		Т.Характеристика,
	                      |		Т.Склад,
	                      |		0,
	                      |		Т.Количество
	                      |	ИЗ
	                      |		РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Т
	                      |	ГДЕ
	                      |		Т.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1)
	                      |		И Т.Количество < 0
	                      |		И Т.Склад В
	                      |				(ВЫБРАТЬ
	                      |					вт_Склады.Склад
	                      |				ИЗ
	                      |					вт_Склады)) КАК ВложенныйЗапрос
	                      |ГДЕ
	                      |	ВложенныйЗапрос.Склад В
	                      |			(ВЫБРАТЬ
	                      |				вт_Склады.Склад
	                      |			ИЗ
	                      |				вт_Склады)
	                      |	И ВложенныйЗапрос.СвободноДляПродажи > 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВложенныйЗапрос.Номенклатура,
	                      |	ВложенныйЗапрос.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыКПоступлениюОстатки.Номенклатура,
	                      |	ТоварыКПоступлениюОстатки.Характеристика,
	                      |	СУММА(ТоварыКПоступлениюОстатки.КОформлениюНакладныхПоРаспоряжениюОстаток) КАК КПоступлениюОстаток,
	                      |	МИНИМУМ(ВЫБОР
	                      |			КОГДА ТоварыКПоступлениюОстатки.ДокументПоступления ССЫЛКА Документ.ПриобретениеТоваровУслуг
	                      |				ТОГДА ВЫБОР
	                      |						КОГДА НАЧАЛОПЕРИОДА(ТоварыКПоступлениюОстатки.ДокументПоступления.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	                      |							ТОГДА &ТекущаяДата
	                      |						ИНАЧЕ ТоварыКПоступлениюОстатки.ДокументПоступления.Дата
	                      |					КОНЕЦ
	                      |			КОГДА ТоварыКПоступлениюОстатки.ДокументПоступления ССЫЛКА Документ.ЗаказПоставщику
	                      |				ТОГДА ВЫБОР
	                      |						КОГДА НАЧАЛОПЕРИОДА(ТоварыКПоступлениюОстатки.ДокументПоступления.ДатаПоступления, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	                      |							ТОГДА &ТекущаяДата
	                      |						ИНАЧЕ ТоварыКПоступлениюОстатки.ДокументПоступления.ДатаПоступления
	                      |					КОНЕЦ
	                      |		КОНЕЦ) КАК ДатаПоступления
	                      |ПОМЕСТИТЬ вт_ТоварыКПоступлению
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыКПоступлению.Остатки(
	                      |			,
	                      |			(Номенклатура, Характеристика) В
	                      |					(ВЫБРАТЬ
	                      |						Т.Номенклатура,
	                      |						Т.Характеристика
	                      |					ИЗ
	                      |						ВТ_Номенклатура КАК Т)
	                      |				И (ДокументПоступления ССЫЛКА Документ.ПриобретениеТоваровУслуг
	                      |					ИЛИ ДокументПоступления ССЫЛКА Документ.ЗаказПоставщику)) КАК ТоварыКПоступлениюОстатки
	                      |ГДЕ
	                      |	ТоварыКПоступлениюОстатки.КОформлениюНакладныхПоРаспоряжениюОстаток > 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыКПоступлениюОстатки.Номенклатура,
	                      |	ТоварыКПоступлениюОстатки.Характеристика");
	Запрос.МенеджерВременныхТаблиц = МенеждерВремТабл;	
	
	Запрос.УстановитьПараметр("ЗначениеС", Истина);
	Запрос.УстановитьПараметр("СвойствоС", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Включен в рассылку (Склады и магазины)"));
	Запрос.УстановитьПараметр("СсылкаWEB", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СсылкаWEB (Справочник ""Номенклатура"" (Общие))"));
	Запрос.УстановитьПараметр("ЛистПрайса", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Лист прайса (Справочник ""Номенклатура"" (Общие))"));
	Запрос.УстановитьПараметр("СписокНоменклатурыДляРассылки", СписокНоменклатурыДляРассылки);
	Запрос.УстановитьПараметр("ДопРеквизитСкладРелиз", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Склад релиза"));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ПредЗаказ", ПредЗаказ);
	Запрос.УстановитьПараметр("НетВПрайсе", Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Нет в прайсе",Истина));
	Запрос.УстановитьПараметр("ТекПартнер", ТекПартнер);
	
	Результат =  Запрос.Выполнить();
	
	Возврат МенеждерВремТабл;
КонецФункции	

Функция ПолучитьВременныеТаблицыКосметика(ПредЗаказ, СписокНоменклатурыДляРассылки)
	МенеждерВремТабл = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Номенклатура.Ссылка КАК Номенклатура,
	                      |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
	                      |ПОМЕСТИТЬ вт_ном
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                      |		ПО (ХарактеристикиНоменклатуры.Владелец = Номенклатура.Ссылка)
	                      |ГДЕ
	                      |	Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
	                      |	И НЕ Номенклатура.ПометкаУдаления
	                      |	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	                      |	И Номенклатура.Ссылка В(&СписокНоменклатурыДляРассылки)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Номенклатура.Ссылка,
	                      |	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	                      |	И НЕ Номенклатура.ПометкаУдаления
	                      |	И Номенклатура.Ссылка В(&СписокНоменклатурыДляРассылки)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Номенклатура.Ссылка,
	                      |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                      |		ПО (ХарактеристикиНоменклатуры.Владелец = Номенклатура.ВидНоменклатуры)
	                      |ГДЕ
	                      |	Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры)
	                      |	И НЕ Номенклатура.ПометкаУдаления
	                      |	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	                      |	И Номенклатура.Ссылка В(&СписокНоменклатурыДляРассылки)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Номенклатура,
	                      |	Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	АналитикаУчетаНоменклатуры.КлючАналитики
	                      |ПОМЕСТИТЬ вт_АналитикаНомен
	                      |ИЗ
	                      |	РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
	                      |ГДЕ
	                      |	(АналитикаУчетаНоменклатуры.Номенклатура, АналитикаУчетаНоменклатуры.Характеристика) В
	                      |			(ВЫБРАТЬ
	                      |				ВТНоменклатура.Номенклатура,
	                      |				ВТНоменклатура.Характеристика
	                      |			ИЗ
	                      |				вт_ном КАК ВТНоменклатура)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	                      |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	                      |	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	                      |ПОМЕСТИТЬ ВТ_ШК
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                      |ГДЕ
	                      |	(ШтрихкодыНоменклатуры.Номенклатура, ШтрихкодыНоменклатуры.Характеристика) В
	                      |			(ВЫБРАТЬ
	                      |				Т.Номенклатура,
	                      |				Т.Характеристика
	                      |			ИЗ
	                      |				вт_ном КАК Т)
	                      |	И ШтрихкодыНоменклатуры.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СкладыДополнительныеРеквизиты.Ссылка КАК Склад
	                      |ПОМЕСТИТЬ вт_Склады
	                      |ИЗ
	                      |	Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	                      |ГДЕ
	                      |	СкладыДополнительныеРеквизиты.Свойство = &СвойствоС
	                      |	И СкладыДополнительныеРеквизиты.Значение = &ЗначениеС
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Склад
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ВложенныйЗапрос.Номенклатура,
	                      |	ВложенныйЗапрос.Характеристика,
	                      |	СУММА(ВложенныйЗапрос.СвободноДляПродажи) КАК СвободноДляПродажи
	                      |ПОМЕСТИТЬ вт_СвободноДляПродажи
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		Т.Номенклатура КАК Номенклатура,
	                      |		Т.Характеристика КАК Характеристика,
	                      |		Т.Склад КАК Склад,
	                      |		Т.ВНаличииОстаток - Т.ВРезервеСоСкладаОстаток КАК ВНаличииДляПродажи,
	                      |		Т.ВНаличииОстаток - Т.ВРезервеСоСкладаОстаток КАК СвободноДляПродажи
	                      |	ИЗ
	                      |		РегистрНакопления.СвободныеОстатки.Остатки(
	                      |				,
	                      |				(Номенклатура, Характеристика) В
	                      |						(ВЫБРАТЬ
	                      |							Т.Номенклатура,
	                      |							Т.Характеристика
	                      |						ИЗ
	                      |							вт_ном КАК Т)
	                      |					И Склад В
	                      |						(ВЫБРАТЬ
	                      |							вт_Склады.Склад
	                      |						ИЗ
	                      |							вт_Склады)) КАК Т
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Т.Номенклатура,
	                      |		Т.Характеристика,
	                      |		Т.Склад,
	                      |		0,
	                      |		-Т.НаличиеПодЗаказОстаток
	                      |	ИЗ
	                      |		РегистрНакопления.ОбеспечениеЗаказов.Остатки(
	                      |				,
	                      |				(Номенклатура, Характеристика) В
	                      |						(ВЫБРАТЬ
	                      |							Т.Номенклатура,
	                      |							Т.Характеристика
	                      |						ИЗ
	                      |							вт_ном КАК Т)
	                      |					И Склад В
	                      |						(ВЫБРАТЬ
	                      |							вт_Склады.Склад
	                      |						ИЗ
	                      |							вт_Склады)) КАК Т
	                      |	ГДЕ
	                      |		Т.НаличиеПодЗаказОстаток > 0
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Т.Номенклатура,
	                      |		Т.Характеристика,
	                      |		Т.Склад,
	                      |		0,
	                      |		Т.Количество
	                      |	ИЗ
	                      |		РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Т
	                      |	ГДЕ
	                      |		Т.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1)
	                      |		И Т.Количество < 0
	                      |		И Т.Склад В
	                      |				(ВЫБРАТЬ
	                      |					вт_Склады.Склад
	                      |				ИЗ
	                      |					вт_Склады)) КАК ВложенныйЗапрос
	                      |ГДЕ
	                      |	ВложенныйЗапрос.Склад В
	                      |			(ВЫБРАТЬ
	                      |				вт_Склады.Склад
	                      |			ИЗ
	                      |				вт_Склады)
	                      |	И ВложенныйЗапрос.СвободноДляПродажи > 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВложенныйЗапрос.Номенклатура,
	                      |	ВложенныйЗапрос.Характеристика");
	Запрос.МенеджерВременныхТаблиц = МенеждерВремТабл;	
	
	Запрос.УстановитьПараметр("ЗначениеС", Истина);
	Запрос.УстановитьПараметр("СвойствоС", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Включен в рассылку (Склады и магазины)"));
	Запрос.УстановитьПараметр("СсылкаWEB", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СсылкаWEB (Справочник ""Номенклатура"" (Общие))"));
	Запрос.УстановитьПараметр("ЛистПрайса", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Лист прайса (Справочник ""Номенклатура"" (Общие))"));
	Запрос.УстановитьПараметр("СписокНоменклатурыДляРассылки", СписокНоменклатурыДляРассылки);
	Запрос.УстановитьПараметр("ДопРеквизитСкладРелиз", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Склад релиза"));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ПредЗаказ", ПредЗаказ);
	Запрос.УстановитьПараметр("НетВПрайсе", Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Нет в прайсе",Истина));
	
	Результат =  Запрос.Выполнить();
	
	Возврат МенеждерВремТабл;
КонецФункции	

Функция ПолучитьСтрокиДляЗаполненияФайлаНовинки(СписокНоменклатурыДляРассылки, Цена, Клиент)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Номенклатура.Ссылка КАК Номенклатура,
	                      |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
	                      |ПОМЕСТИТЬ вт_Номенклатура
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                      |		ПО (ХарактеристикиНоменклатуры.Владелец = Номенклатура.Ссылка
	                      |				ИЛИ ХарактеристикиНоменклатуры.Владелец = Номенклатура.ВидНоменклатуры)
	                      |ГДЕ
	                      |	Номенклатура.Ссылка В(&СписокНоменклатурыДляРассылки)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДополнительныеСведения.Объект.Ссылка КАК Номенклатура,
	                      |	ДополнительныеСведения.Значение
	                      |ПОМЕСТИТЬ вт_Номенклатура_Топ
	                      |ИЗ
	                      |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                      |ГДЕ
	                      |	ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура
	                      |	И ДополнительныеСведения.Свойство.Заголовок = ""Топ!!!""
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДополнительныеСведения.Объект.Ссылка КАК Характеристика,
	                      |	ДополнительныеСведения.Значение
	                      |ПОМЕСТИТЬ вт_Характеристика_Новинка
	                      |ИЗ
	                      |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                      |ГДЕ
	                      |	ДополнительныеСведения.Объект ССЫЛКА Справочник.ХарактеристикиНоменклатуры
	                      |	И ДополнительныеСведения.Свойство.Заголовок = ""Новинка!!!""
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СкладыДополнительныеРеквизиты.Ссылка КАК Склад
	                      |ПОМЕСТИТЬ вт_Склады
	                      |ИЗ
	                      |	Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	                      |ГДЕ
	                      |	СкладыДополнительныеРеквизиты.Свойство = &СвойствоС
	                      |	И СкладыДополнительныеРеквизиты.Значение = &ЗначениеС
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	                      |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	                      |	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	                      |ПОМЕСТИТЬ ВТ_ШК
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                      |ГДЕ
	                      |	(ШтрихкодыНоменклатуры.Номенклатура, ШтрихкодыНоменклатуры.Характеристика) В
	                      |			(ВЫБРАТЬ
	                      |				Т.Номенклатура,
	                      |				Т.Характеристика
	                      |			ИЗ
	                      |				ВТ_Номенклатура КАК Т)
	                      |	И ШтрихкодыНоменклатуры.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ВложенныйЗапрос.Номенклатура,
	                      |	ВложенныйЗапрос.Характеристика,
	                      |	СУММА(ВложенныйЗапрос.СвободноДляПродажи) КАК СвободноДляПродажи
	                      |ПОМЕСТИТЬ вт_СвободноДляПродажи
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		Т.Номенклатура КАК Номенклатура,
	                      |		Т.Характеристика КАК Характеристика,
	                      |		Т.Склад КАК Склад,
	                      |		Т.ВНаличииОстаток КАК ВНаличииДляПродажи,
	                      |		Т.ВНаличииОстаток КАК СвободноДляПродажи
	                      |	ИЗ
	                      |		РегистрНакопления.СвободныеОстатки.Остатки(
	                      |				,
	                      |				(Номенклатура, Характеристика) В
	                      |						(ВЫБРАТЬ
	                      |							Т.Номенклатура,
	                      |							Т.Характеристика
	                      |						ИЗ
	                      |							ВТ_Номенклатура КАК Т)
	                      |					И Склад В
	                      |						(ВЫБРАТЬ
	                      |							вт_Склады.Склад
	                      |						ИЗ
	                      |							вт_Склады)) КАК Т
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Т.Номенклатура,
	                      |		Т.Характеристика,
	                      |		Т.Склад,
	                      |		0,
	                      |		-Т.НаличиеПодЗаказОстаток
	                      |	ИЗ
	                      |		РегистрНакопления.ОбеспечениеЗаказов.Остатки(
	                      |				,
	                      |				(Номенклатура, Характеристика) В
	                      |						(ВЫБРАТЬ
	                      |							Т.Номенклатура,
	                      |							Т.Характеристика
	                      |						ИЗ
	                      |							ВТ_Номенклатура КАК Т)
	                      |					И Склад В
	                      |						(ВЫБРАТЬ
	                      |							вт_Склады.Склад
	                      |						ИЗ
	                      |							вт_Склады)) КАК Т
	                      |	ГДЕ
	                      |		Т.НаличиеПодЗаказОстаток > 0
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Т.Номенклатура,
	                      |		Т.Характеристика,
	                      |		Т.Склад,
	                      |		0,
	                      |		Т.Количество
	                      |	ИЗ
	                      |		РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Т
	                      |	ГДЕ
	                      |		Т.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1)
	                      |		И Т.Количество < 0
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Т.Номенклатура,
	                      |		Т.Характеристика,
	                      |		Т.Склад,
	                      |		0,
	                      |		0
	                      |	ИЗ
	                      |		РегистрНакопления.ТоварыКОтгрузке.Остатки(
	                      |				,
	                      |				(Номенклатура, Характеристика) В
	                      |						(ВЫБРАТЬ
	                      |							Т.Номенклатура,
	                      |							Т.Характеристика
	                      |						ИЗ
	                      |							ВТ_Номенклатура КАК Т)
	                      |					И Склад В
	                      |						(ВЫБРАТЬ
	                      |							вт_Склады.Склад
	                      |						ИЗ
	                      |							вт_Склады)) КАК Т
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Т.Номенклатура,
	                      |		Т.Характеристика,
	                      |		Т.Склад,
	                      |		0,
	                      |		0
	                      |	ИЗ
	                      |		РегистрНакопления.ТоварыНаСкладах.Остатки(
	                      |				,
	                      |				(Номенклатура, Характеристика) В
	                      |						(ВЫБРАТЬ
	                      |							Т.Номенклатура,
	                      |							Т.Характеристика
	                      |						ИЗ
	                      |							ВТ_Номенклатура КАК Т)
	                      |					И Склад В
	                      |						(ВЫБРАТЬ
	                      |							вт_Склады.Склад
	                      |						ИЗ
	                      |							вт_Склады)) КАК Т) КАК ВложенныйЗапрос
	                      |ГДЕ
	                      |	ВложенныйЗапрос.Склад В
	                      |			(ВЫБРАТЬ
	                      |				вт_Склады.Склад
	                      |			ИЗ
	                      |				вт_Склады)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВложенныйЗапрос.Номенклатура,
	                      |	ВложенныйЗапрос.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(КонтрагентыДополнительныеРеквизиты.Значение) КАК СкладРелиз
	                      |ПОМЕСТИТЬ вт_СкладРелиз
	                      |ИЗ
	                      |	Справочник.Партнеры.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
	                      |ГДЕ
	                      |	КонтрагентыДополнительныеРеквизиты.Ссылка = &Клиент
	                      |	И КонтрагентыДополнительныеРеквизиты.Свойство = &ДопРеквизитСкладРелиз
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыНаСкладахОбороты.Номенклатура,
	                      |	ТоварыНаСкладахОбороты.Характеристика,
	                      |	ТоварыНаСкладахОбороты.ВНаличииПриход КАК ВНаличииОборот
	                      |ПОМЕСТИТЬ вт_ОборотПоСкладуРелиза
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыНаСкладах.Обороты(
	                      |			,
	                      |			,
	                      |			,
	                      |			(Номенклатура, Характеристика) В
	                      |					(ВЫБРАТЬ
	                      |						Т.Номенклатура,
	                      |						Т.Характеристика
	                      |					ИЗ
	                      |						ВТ_Номенклатура КАК Т)
	                      |				И Склад В
	                      |					(ВЫБРАТЬ
	                      |						вт_СкладРелиз.СкладРелиз
	                      |					ИЗ
	                      |						вт_СкладРелиз КАК вт_СкладРелиз)) КАК ТоварыНаСкладахОбороты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	вт_Номенклатура.Номенклатура КАК Номенклатура,
	                      |	ЕСТЬNULL(вт_Номенклатура.Характеристика, """") КАК Характеристика,
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Стоимость,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) <= 0
	                      |			ТОГДА 0
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) > 10
	                      |			ТОГДА "">10""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0)
	                      |	КОНЕЦ КАК ДоступноеКоличество,
	                      |	ЕСТЬNULL(ШК.Штрихкод, """") КАК Артикул,
	                      |	ЕСТЬNULL(вт_Номенклатура.Номенклатура.Производитель, """") КАК Производитель,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""СсылкаWEB""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК СсылкаWEB,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для аппарата""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляАппарата,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для бренда""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляБренда,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Тип аксессуара""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ТипАксессуара,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Серия""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК Серия,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Распродажа""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК Распродажа,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Для модели устройства""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК ДляМоделиУстройства,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Заголовок = ""ссылка на фото №2""
	                      |				ТОГДА ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ """"
	                      |		КОНЕЦ) КАК СсылкаНаАрхивФото,
	                      |	МАКСИМУМ(ЕСТЬNULL(вт_Номенклатура_Топ.Значение, """")) КАК Топ,
	                      |	МАКСИМУМ(ЕСТЬNULL(вт_Характеристика_Новинка.Значение, """")) КАК Новинка,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Дата выхода аппарата""
	                      |				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	                      |			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	                      |		КОНЕЦ) КАК ДатаВыпуска,
	                      |	ЕСТЬNULL(вт_ОборотПоСкладуРелиза.ВНаличииОборот, 0) КАК ОборотРелиза
	                      |ИЗ
	                      |	вт_Номенклатура КАК вт_Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &Цена) КАК ЦеныНоменклатурыСрезПоследних
	                      |		ПО вт_Номенклатура.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СвободноДляПродажи КАК вт_СвободноДляПродажи
	                      |		ПО вт_Номенклатура.Номенклатура = вт_СвободноДляПродажи.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = вт_СвободноДляПродажи.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	                      |		ПО вт_Номенклатура.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_Номенклатура_Топ КАК вт_Номенклатура_Топ
	                      |		ПО вт_Номенклатура.Номенклатура = вт_Номенклатура_Топ.Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_Характеристика_Новинка КАК вт_Характеристика_Новинка
	                      |		ПО вт_Номенклатура.Характеристика = вт_Характеристика_Новинка.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	                      |		ПО вт_Номенклатура.Номенклатура = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец
	                      |			И вт_Номенклатура.Характеристика = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	                      |				,
	                      |				,
	                      |				,
	                      |				АналитикаУчетаНоменклатуры.Номенклатура В
	                      |						(ВЫБРАТЬ
	                      |							ВТНоменклатура.Номенклатура
	                      |						ИЗ
	                      |							вт_Номенклатура КАК ВТНоменклатура)
	                      |					И АналитикаУчетаНоменклатуры.Характеристика В
	                      |						(ВЫБРАТЬ
	                      |							ВТНоменклатура.Характеристика
	                      |						ИЗ
	                      |							вт_Номенклатура КАК ВТНоменклатура)
	                      |					И АналитикаУчетаПоПартнерам.Партнер = &Клиент) КАК ВыручкаИСебестоимостьПродажОбороты
	                      |		ПО вт_Номенклатура.Номенклатура = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика
	                      |			И (ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = &Клиент)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШК КАК ШК
	                      |		ПО вт_Номенклатура.Номенклатура = ШК.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = ШК.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ОборотПоСкладуРелиза КАК вт_ОборотПоСкладуРелиза
	                      |		ПО вт_Номенклатура.Номенклатура = вт_ОборотПоСкладуРелиза.Номенклатура
	                      |			И вт_Номенклатура.Характеристика = вт_ОборотПоСкладуРелиза.Характеристика
	                      |ГДЕ
	                      |	ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) > 0
	                      |	И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) <> 0
	                      |	И ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот, 0) = 0
	                      |	И ЕСТЬNULL(вт_ОборотПоСкладуРелиза.ВНаличииОборот, 0) = 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	вт_Номенклатура.Номенклатура,
	                      |	ЕСТЬNULL(вт_Номенклатура.Характеристика, """"),
	                      |	ЕСТЬNULL(ШК.Штрихкод, """"),
	                      |	ЕСТЬNULL(вт_Номенклатура.Номенклатура.Производитель, """"),
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0),
	                      |	ЕСТЬNULL(вт_ОборотПоСкладуРелиза.ВНаличииОборот, 0),
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) <= 0
	                      |			ТОГДА 0
	                      |		КОГДА ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0) > 10
	                      |			ТОГДА "">10""
	                      |		ИНАЧЕ ЕСТЬNULL(вт_СвободноДляПродажи.СвободноДляПродажи, 0)
	                      |	КОНЕЦ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаВыпуска УБЫВ,
	                      |	ДляМоделиУстройства,
	                      |	ТипАксессуара,
	                      |	Номенклатура,
	                      |	Характеристика");
	Запрос.УстановитьПараметр("ЗначениеС", Истина);
	Запрос.УстановитьПараметр("СвойствоС", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Включен в рассылку (Склады и магазины)"));
	Запрос.УстановитьПараметр("Цена", Цена);
	Запрос.УстановитьПараметр("СсылкаWEB", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СсылкаWEB (Справочник ""Номенклатура"" (Общие))"));
	Запрос.УстановитьПараметр("СписокНоменклатурыДляРассылки", СписокНоменклатурыДляРассылки);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ДопРеквизитСкладРелиз", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Склад релиза"));
	Результат =  Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат;
	КонецЕСли;
КонецФункции

Функция ПолучитьСтрокиДляМатрицыАппаратов()
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	НоменклатураПоставщиков.Ссылка КАК Наименование,
	//|	НоменклатураПоставщиков.ДатаВыхода КАК ДатаВыхода,
	//|	НоменклатураПоставщиков.Артикул КАК Цена,
	//|	НоменклатураПоставщиков.Модель
	//|ИЗ
	//|	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
	//|ГДЕ
	//|	НоменклатураПоставщиков.Владелец = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	//|	И НЕ НоменклатураПоставщиков.ПометкаУдаления
	//|	И НЕ НоменклатураПоставщиков.ЭтоГруппа
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ДатаВыхода УБЫВ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МатрицаАппаратов.Наименование,
	|	МатрицаАппаратов.Бренд,
	|	МатрицаАппаратов.ТипАппарата,
	|	МатрицаАппаратов.Дата КАК Дата,
	|	МатрицаАппаратов.Цена,
	|	МатрицаАппаратов.СсылкаНаМодель,
	|	МатрицаАппаратов.СсылкаНаГрафикМоделиЯМ
	|ИЗ
	|	Справочник.МатрицаАппаратов КАК МатрицаАппаратов
	|ГДЕ
	|	МатрицаАппаратов.Владелец = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	И НЕ МатрицаАппаратов.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Результат =  Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат;
	КонецЕСли;
	
КонецФункции // ()

Функция ПолучитьСписокКлиентовДляРассылкиКосметика(Клиенты, НаДиск, ПредЗаказ)
	СтандартныйПрайс = ПолучитьПрайсРозничногоПокупателяКосметика();
	
	Запрос =  Новый Запрос("ВЫБРАТЬ
	                       |	Партнеры.Ссылка КАК Клиент,
	                       |	Партнеры.Наименование,
	                       |	Партнеры.ОсновнойМенеджер,
	                       |	МАКСИМУМ(ПартнерыДополнительныеРеквизиты.Значение) КАК ДатаОтправки,
	                       |	МАКСИМУМ(ВЫБОР
	                       |			КОГДА ПартнерыДополнительныеРеквизитыСегмент.Значение ЕСТЬ NULL
	                       |				ТОГДА ПартнерыДополнительныеРеквизитыСегментРозн.Значение
	                       |			ИНАЧЕ ПартнерыДополнительныеРеквизитыСегмент.Значение
	                       |		КОНЕЦ) КАК Сегмент
	                       |ПОМЕСТИТЬ втПартнеры
	                       |ИЗ
	                       |	Справочник.Партнеры КАК Партнеры
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	                       |		ПО (ПартнерыДополнительныеРеквизиты.Ссылка = Партнеры.Ссылка)
	                       |			И (ПартнерыДополнительныеРеквизиты.Свойство = &СвойствоДатаРассылки)
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизитыСегмент
	                       |		ПО (ПартнерыДополнительныеРеквизитыСегмент.Ссылка = Партнеры.Ссылка)
	                       |			И (ПартнерыДополнительныеРеквизитыСегмент.Свойство = &СвойствоСегмент)
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизитыСегментРозн
	                       |		ПО (ПартнерыДополнительныеРеквизитыСегментРозн.Ссылка = ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель))
	                       |			И (ПартнерыДополнительныеРеквизитыСегментРозн.Свойство = &СвойствоСегмент)
	                       |ГДЕ
	                       |	Партнеры.Клиент
	                       |	И НЕ Партнеры.ПометкаУдаления
	                       |	И ВЫБОР
	                       |			КОГДА НЕ &ОтбиратьКлиенты
	                       |				ТОГДА ИСТИНА
	                       |			ИНАЧЕ Партнеры.Ссылка В (&ОтборКлиенты)
	                       |		КОНЕЦ
	                       |	И ВЫБОР
	                       |			КОГДА &ОтбиратьКлиенты
	                       |				ТОГДА ИСТИНА
	                       |			КОГДА ПартнерыДополнительныеРеквизиты.Значение ЕСТЬ NULL
	                       |				ТОГДА ИСТИНА
	                       |			ИНАЧЕ ПартнерыДополнительныеРеквизиты.Значение < &ТекущаяДата
	                       |		КОНЕЦ
	                       |
	                       |СГРУППИРОВАТЬ ПО
	                       |	Партнеры.Ссылка,
	                       |	Партнеры.Наименование,
	                       |	Партнеры.ОсновнойМенеджер
	                       |
	                       |ИНДЕКСИРОВАТЬ ПО
	                       |	Клиент
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	МАКСИМУМ(ВЫБОР
	                       |			КОГДА ПартнерыПрисоединенныеФайлы.Ссылка.Наименование = ""ПрайсКосметика""
	                       |				ТОГДА ПартнерыПрисоединенныеФайлы.Ссылка
	                       |			ИНАЧЕ NULL
	                       |		КОНЕЦ) КАК Файл,
	                       |	втПартнеры.Клиент,
	                       |	втПартнеры.Наименование,
	                       |	втПартнеры.ОсновнойМенеджер,
	                       |	втПартнеры.ДатаОтправки,
	                       |	втПартнеры.Сегмент,
	                       |	МАКСИМУМ(ВЫБОР
	                       |			КОГДА ПартнерыДополнительныеРеквизиты.Свойство = &Свойство
	                       |				ТОГДА ЕСТЬNULL(ПартнерыДополнительныеРеквизиты.Значение, ЛОЖЬ)
	                       |			ИНАЧЕ ЛОЖЬ
	                       |		КОНЕЦ) КАК Включен
	                       |ПОМЕСТИТЬ ВремДанные
	                       |ИЗ
	                       |	втПартнеры КАК втПартнеры
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартнерыПрисоединенныеФайлы КАК ПартнерыПрисоединенныеФайлы
	                       |		ПО втПартнеры.Клиент = ПартнерыПрисоединенныеФайлы.ВладелецФайла
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	                       |		ПО втПартнеры.Клиент = ПартнерыДополнительныеРеквизиты.Ссылка
	                       |
	                       |СГРУППИРОВАТЬ ПО
	                       |	втПартнеры.Клиент,
	                       |	втПартнеры.Наименование,
	                       |	втПартнеры.ОсновнойМенеджер,
	                       |	втПартнеры.ДатаОтправки,
	                       |	втПартнеры.Сегмент
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ЕСТЬNULL(ВремДанные.Файл, &ПрайсСтандартный) КАК Файл,
	                       |	ВремДанные.Клиент,
	                       |	ВремДанные.Наименование,
	                       |	ВремДанные.ОсновнойМенеджер,
	                       |	ВремДанные.ДатаОтправки,
	                       |	ВремДанные.Сегмент,
	                       |	ВремДанные.Включен
	                       |ПОМЕСТИТЬ ВремТабл
	                       |ИЗ
	                       |	ВремДанные КАК ВремДанные
	                       |ГДЕ
	                       |	ВЫБОР
	                       |			КОГДА &ОтбиратьКлиенты
	                       |				ТОГДА ИСТИНА
	                       |			ИНАЧЕ ВремДанные.Включен = ИСТИНА
	                       |		КОНЕЦ
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                       |	ВремТабл.Файл,
	                       |	ВремТабл.Клиент,
	                       |	ВремТабл.Наименование,
	                       |	ВремТабл.ОсновнойМенеджер,
	                       |	ВремТабл.ДатаОтправки КАК ДатаОтправки,
	                       |	ВремТабл.Сегмент,
	                       |	ВремТабл.Включен
	                       |ИЗ
	                       |	ВремТабл КАК ВремТабл
	                       |
	                       |УПОРЯДОЧИТЬ ПО
	                       |	ВремТабл.Сегмент,
	                       |	ДатаОтправки");
	
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Включен в рассылку (косметика) (Клиенты)"));
	//Запрос.УстановитьПараметр("СохранятьНаДиск", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Сохранять прайс на диск"));
	Запрос.УстановитьПараметр("ОтбиратьКлиенты", ЗначениеЗаполнено(Клиенты));
	Запрос.УстановитьПараметр("ОтборКлиенты", Клиенты);
	Запрос.УстановитьПараметр("ПрайсСтандартный", СтандартныйПрайс);
	//Запрос.УстановитьПараметр("НаДиск", НаДиск);
	Запрос.УстановитьПараметр("СвойствоДатаРассылки", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Дата рассылки прайса (косметика) (Общие)"));
	//Запрос.УстановитьПараметр("СвойствоСегмент", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Номенклатура для рассылки косметика (Клиенты)"));
	Запрос.УстановитьПараметр("СвойствоСегмент", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Номенклатура для рассылки косметика (Клиенты)"));
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьСписокКлиентовДляРассылки(Клиенты, НаДиск, ПредЗаказ)
	СтандартныйПрайс = ПолучитьПрайсРозничногоПокупателя(НаДиск, ПредЗаказ);
	
	Запрос =  Новый Запрос("ВЫБРАТЬ
	                       |	Партнеры.Ссылка КАК Клиент,
	                       |	Партнеры.Наименование,
	                       |	Партнеры.ОсновнойМенеджер,
	                       |	МАКСИМУМ(ВЫБОР
	                       |			КОГДА &НаДиск
	                       |				ТОГДА ПартнерыДополнительныеРеквизитыНаДиск.Значение
	                       |			ИНАЧЕ ПартнерыДополнительныеРеквизиты.Значение
	                       |		КОНЕЦ) КАК ДатаОтправки,
	                       |	МАКСИМУМ(ВЫБОР
	                       |			КОГДА ПартнерыДополнительныеРеквизитыСегмент.Значение ЕСТЬ NULL
	                       |				ТОГДА ПартнерыДополнительныеРеквизитыСегментРозн.Значение
	                       |			ИНАЧЕ ПартнерыДополнительныеРеквизитыСегмент.Значение
	                       |		КОНЕЦ) КАК Сегмент
	                       |ПОМЕСТИТЬ втПартнеры
	                       |ИЗ
	                       |	Справочник.Партнеры КАК Партнеры
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	                       |		ПО (ПартнерыДополнительныеРеквизиты.Ссылка = Партнеры.Ссылка)
	                       |			И (ПартнерыДополнительныеРеквизиты.Свойство = &СвойствоДатаРассылки)
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизитыНаДиск
	                       |		ПО (ПартнерыДополнительныеРеквизитыНаДиск.Ссылка = Партнеры.Ссылка)
	                       |			И (ПартнерыДополнительныеРеквизитыНаДиск.Свойство = &СвойствоДатаСохранения)
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизитыСегмент
	                       |		ПО (ПартнерыДополнительныеРеквизитыСегмент.Ссылка = Партнеры.Ссылка)
	                       |			И (ПартнерыДополнительныеРеквизитыСегмент.Свойство = &СвойствоСегмент)
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизитыСегментРозн
	                       |		ПО (ПартнерыДополнительныеРеквизитыСегментРозн.Ссылка = ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель))
	                       |			И (ПартнерыДополнительныеРеквизитыСегментРозн.Свойство = &СвойствоСегмент)
	                       |ГДЕ
	                       |	Партнеры.Клиент
	                       |	И НЕ Партнеры.ПометкаУдаления
	                       |	И ВЫБОР
	                       |			КОГДА НЕ &ОтбиратьКлиенты
						   //|				ТОГДА ВЫБОР
						   //|						КОГДА &НаДиск
						   //|							ТОГДА Партнеры.Ссылка <> ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель)
						   //|						ИНАЧЕ ИСТИНА
						   //|					КОНЕЦ
						   |				ТОГДА ИСТИНА
	                       |			ИНАЧЕ Партнеры.Ссылка В (&ОтборКлиенты)
	                       |		КОНЕЦ
	                       |	И ВЫБОР
	                       |			КОГДА &ОтбиратьКлиенты
	                       |				ТОГДА ИСТИНА
	                       |			КОГДА ПартнерыДополнительныеРеквизиты.Значение ЕСТЬ NULL
	                       |					И НЕ &НаДиск
	                       |				ТОГДА ИСТИНА
	                       |			КОГДА ПартнерыДополнительныеРеквизитыНаДиск.Значение ЕСТЬ NULL
	                       |					И &НаДиск
	                       |				ТОГДА ИСТИНА
	                       |			КОГДА &НаДиск
	                       |				ТОГДА ПартнерыДополнительныеРеквизитыНаДиск.Значение < &ТекущаяДата
	                       |			ИНАЧЕ ПартнерыДополнительныеРеквизиты.Значение < &ТекущаяДата
	                       |		КОНЕЦ
	                       |
	                       |СГРУППИРОВАТЬ ПО
	                       |	Партнеры.Ссылка,
	                       |	Партнеры.Наименование,
	                       |	Партнеры.ОсновнойМенеджер
	                       |
	                       |ИНДЕКСИРОВАТЬ ПО
	                       |	Клиент
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	МАКСИМУМ(ВЫБОР
	                       |			КОГДА НЕ &НаДиск
	                       |					И НЕ &ПредЗаказ
	                       |					И ПартнерыПрисоединенныеФайлы.Ссылка.Наименование = ""Прайс""
	                       |				ТОГДА ПартнерыПрисоединенныеФайлы.Ссылка
	                       |			КОГДА &НаДиск
	                       |					И НЕ &ПредЗаказ
	                       |					И ПартнерыПрисоединенныеФайлы.Ссылка.Наименование = ""ПрайсНаДиск""
	                       |				ТОГДА ПартнерыПрисоединенныеФайлы.Ссылка
	                       |			КОГДА &ПредЗаказ
	                       |					И ПартнерыПрисоединенныеФайлы.Ссылка.Наименование = ""Прайс_предзаказ""
	                       |				ТОГДА ПартнерыПрисоединенныеФайлы.Ссылка
	                       |			ИНАЧЕ NULL
	                       |		КОНЕЦ) КАК Файл,
	                       |	втПартнеры.Клиент,
	                       |	втПартнеры.Наименование,
	                       |	втПартнеры.ОсновнойМенеджер,
	                       |	втПартнеры.ДатаОтправки,
	                       |	втПартнеры.Сегмент,
	                       |	МАКСИМУМ(ВЫБОР
	                       |			КОГДА ПартнерыДополнительныеРеквизиты.Свойство = &СвойствоДоговор
	                       |				ТОГДА ЕСТЬNULL(ПартнерыДополнительныеРеквизиты.Значение, """")
	                       |			ИНАЧЕ """"
	                       |		КОНЕЦ) КАК ФормаДоговора,
	                       |	МАКСИМУМ(ВЫБОР
	                       |			КОГДА ПартнерыДополнительныеРеквизиты.Свойство = &СвойствоОтсрочка
	                       |				ТОГДА ЕСТЬNULL(ПартнерыДополнительныеРеквизиты.Значение, 0)
	                       |			ИНАЧЕ 0
	                       |		КОНЕЦ) КАК Отсрочка,
	                       |	МАКСИМУМ(ВЫБОР
	                       |			КОГДА ПартнерыДополнительныеРеквизиты.Свойство = &СвойствоРотация
	                       |				ТОГДА ЕСТЬNULL(ПартнерыДополнительныеРеквизиты.Значение, 0)
	                       |			ИНАЧЕ 0
	                       |		КОНЕЦ) КАК Ротация,
	                       |	МАКСИМУМ(ВЫБОР
	                       |			КОГДА ПартнерыДополнительныеРеквизиты.Свойство = &Свойство
	                       |				ТОГДА ЕСТЬNULL(ПартнерыДополнительныеРеквизиты.Значение, ЛОЖЬ)
	                       |			ИНАЧЕ ЛОЖЬ
	                       |		КОНЕЦ) КАК Включен,
	                       |	МАКСИМУМ(ВЫБОР
	                       |			КОГДА ПартнерыДополнительныеРеквизиты.Свойство = &СохранятьНаДиск
	                       |				ТОГДА ЕСТЬNULL(ПартнерыДополнительныеРеквизиты.Значение, ЛОЖЬ)
	                       |			ИНАЧЕ ЛОЖЬ
	                       |		КОНЕЦ) КАК ВключенНаДиск
	                       |ПОМЕСТИТЬ ВремДанные
	                       |ИЗ
	                       |	втПартнеры КАК втПартнеры
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартнерыПрисоединенныеФайлы КАК ПартнерыПрисоединенныеФайлы
	                       |		ПО втПартнеры.Клиент = ПартнерыПрисоединенныеФайлы.ВладелецФайла
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	                       |		ПО втПартнеры.Клиент = ПартнерыДополнительныеРеквизиты.Ссылка
	                       |
	                       |СГРУППИРОВАТЬ ПО
	                       |	втПартнеры.Клиент,
	                       |	втПартнеры.Наименование,
	                       |	втПартнеры.ОсновнойМенеджер,
	                       |	втПартнеры.ДатаОтправки,
	                       |	втПартнеры.Сегмент
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ЕСТЬNULL(ВремДанные.Файл, &ПрайсСтандартный) КАК Файл,
	                       |	ВремДанные.Клиент,
	                       |	ВремДанные.Наименование,
	                       |	ВремДанные.ОсновнойМенеджер,
	                       |	ВремДанные.ДатаОтправки,
	                       |	ВремДанные.Сегмент,
	                       |	ВремДанные.ФормаДоговора,
	                       |	ВремДанные.Отсрочка,
	                       |	ВремДанные.Ротация,
	                       |	ВремДанные.Включен,
	                       |	ВремДанные.ВключенНаДиск
	                       |ПОМЕСТИТЬ ВремТабл
	                       |ИЗ
	                       |	ВремДанные КАК ВремДанные
	                       |ГДЕ
	                       |	ВЫБОР
	                       |			КОГДА &ОтбиратьКлиенты
	                       |				ТОГДА ИСТИНА
	                       |			ИНАЧЕ ВЫБОР
	                       |					КОГДА &НаДиск
	                       |						ТОГДА ВремДанные.ВключенНаДиск = ИСТИНА
	                       |					ИНАЧЕ ВремДанные.Включен = ИСТИНА
	                       |				КОНЕЦ
	                       |		КОНЕЦ
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                       |	ВремТабл.Файл,
	                       |	ВремТабл.Клиент,
	                       |	ВремТабл.Наименование,
	                       |	ВремТабл.ОсновнойМенеджер,
	                       |	ВремТабл.ДатаОтправки КАК ДатаОтправки,
	                       |	ВремТабл.Сегмент,
	                       |	ВремТабл.ФормаДоговора,
	                       |	ВремТабл.Отсрочка,
	                       |	ВремТабл.Ротация,
	                       |	ВремТабл.Включен,
	                       |	ВремТабл.ВключенНаДиск
	                       |ИЗ
	                       |	ВремТабл КАК ВремТабл
	                       |
	                       |УПОРЯДОЧИТЬ ПО
	                       |	ВремТабл.Сегмент,
	                       |	ДатаОтправки");
	
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Включен в рассылку (Клиенты)"));
	Запрос.УстановитьПараметр("СохранятьНаДиск", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Сохранять прайс на диск"));
	Запрос.УстановитьПараметр("СвойствоДоговор", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Договор"));
	Запрос.УстановитьПараметр("СвойствоОтсрочка", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Отсрочка кол-во дней"));
	Запрос.УстановитьПараметр("СвойствоРотация", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Ротация кол-во дней"));
	Запрос.УстановитьПараметр("ОтбиратьКлиенты", ЗначениеЗаполнено(Клиенты));
	Запрос.УстановитьПараметр("ОтборКлиенты", Клиенты);
	Запрос.УстановитьПараметр("ПрайсСтандартный", СтандартныйПрайс);
	Запрос.УстановитьПараметр("НаДиск", НаДиск);
	Запрос.УстановитьПараметр("ПредЗаказ", ПредЗаказ);
	Запрос.УстановитьПараметр("СвойствоДатаРассылки", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Дата рассылки прайса (Общие)"));
	Запрос.УстановитьПараметр("СвойствоДатаСохранения", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Дата сохранения прайса на диск (Общие)"));
	Запрос.УстановитьПараметр("СвойствоСегмент", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Номенклатура для рассылки (Клиенты)"));
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьПрайсРозничногоПокупателя(НаДиск = Ложь, ПредЗаказ = Ложь)
	ЗапросСП = Новый Запрос("ВЫБРАТЬ
	                        |	ПартнерыПрисоединенныеФайлы.Ссылка
	                        |ИЗ
	                        |	Справочник.ПартнерыПрисоединенныеФайлы КАК ПартнерыПрисоединенныеФайлы
	                        |ГДЕ
	                        |	ВЫБОР
	                        |			КОГДА &НаДиск и Не &ПредЗаказ
	                        |				ТОГДА ПартнерыПрисоединенныеФайлы.Наименование = ""ПрайсНаДиск""
	                        |			КОГДА &ПредЗаказ
	                        |				ТОГДА ПартнерыПрисоединенныеФайлы.Наименование = ""Прайс_предзаказ""
	                        |			ИНАЧЕ ПартнерыПрисоединенныеФайлы.Наименование = ""Прайс""
	                        |		КОНЕЦ
	                        |	И ПартнерыПрисоединенныеФайлы.ВладелецФайла = ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель)");
	ЗапросСП.УстановитьПараметр("НаДиск", НаДиск);
	ЗапросСП.УстановитьПараметр("ПредЗаказ", ПредЗаказ);
	СтандартныйПрайс = ЗапросСП.Выполнить().Выбрать();
	СтандартныйПрайс.Следующий();
	Возврат СтандартныйПрайс.Ссылка;
КонецФункции

Функция ПолучитьПрайсРозничногоПокупателяКосметика()
	ЗапросСП = Новый Запрос("ВЫБРАТЬ
	                        |	ПартнерыПрисоединенныеФайлы.Ссылка
	                        |ИЗ
	                        |	Справочник.ПартнерыПрисоединенныеФайлы КАК ПартнерыПрисоединенныеФайлы
	                        |ГДЕ
	                        |	ПартнерыПрисоединенныеФайлы.Наименование = ""ПрайсКосметика""
	                        |	И ПартнерыПрисоединенныеФайлы.ВладелецФайла = ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель)");
							
	
	СтандартныйПрайс = ЗапросСП.Выполнить().Выбрать();
	СтандартныйПрайс.Следующий();
	Возврат СтандартныйПрайс.Ссылка;
КонецФункции

Процедура ЗаполнитьОстальные(СтрокаТаблицы, Лист, НомерСтроки)

	КоличествоСтрок = НомерСтроки + СтрокаТаблицы.Количество() -1;
	
	//Область = Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,16));
	
	ВсегоСтрок 		= СтрокаТаблицы.Количество();
	ВсегоКолонок 	= 19;
	
	МассивКОМ = Новый COMSafeArray("VT_VARIANT", ВсегоКолонок, ВсегоСтрок);
	индСтрок = 0;
	Пока СтрокаТаблицы.Следующий() Цикл
		
		//СтрокаТаблицы = Строки[индСтрок];
		
		МассивКОМ.SetValue(0, индСтрок, Строка(СтрокаТаблицы.Артикул));
		МассивКОМ.SetValue(1, индСтрок, Строка(СтрокаТаблицы.ДляАппарата));
		МассивКОМ.SetValue(2, индСтрок, Строка(СтрокаТаблицы.ДляБренда));
		МассивКОМ.SetValue(3, индСтрок, Строка(СтрокаТаблицы.ДляМоделиУстройства));
		МассивКОМ.SetValue(4, индСтрок, Строка(СтрокаТаблицы.ТипАксессуара));
		МассивКОМ.SetValue(5, индСтрок, Строка(СтрокаТаблицы.Характеристика));
		МассивКОМ.SetValue(6, индСтрок, Строка(СтрокаТаблицы.Производитель));
		МассивКОМ.SetValue(7, индСтрок, Строка(СтрокаТаблицы.Серия));
		МассивКОМ.SetValue(8, индСтрок, Строка(СтрокаТаблицы.Распродажа));
		МассивКОМ.SetValue(9, индСтрок, Строка(СтрокаТаблицы.ДоступноеКоличество));
		МассивКОМ.SetValue(10, индСтрок, Число(СтрокаТаблицы.Стоимость));
		
		МассивКОМ.SetValue(13, индСтрок, ?(СтрокаТаблицы.ПродажиКоличество > 0 или СтрокаТаблицы.ОборотРелиз > 0,"Да","Нет"));
		МассивКОМ.SetValue(14, индСтрок, Формат(СтрокаТаблицы.ДатаВыпуска,"ДФ=dd.MM.yyyy; ДП=-"));
		
		МассивКОМ.SetValue(15, индСтрок, Строка(СтрокаТаблицы.Топ));
		МассивКОМ.SetValue(16, индСтрок, Строка(СтрокаТаблицы.Новинка));
		МассивКОМ.SetValue(17, индСтрок, Строка(СтрокаТаблицы.СсылкаWeb));   
		МассивКОМ.SetValue(18, индСтрок, Строка(СтрокаТаблицы.СсылкаНаАрхивФото));
		индСтрок = индСтрок + 1;
	КонецЦикла;
	
	//Лист.Range(Лист.Cells(НомерСтроки,15), Лист.Cells(КоличествоСтрок,15)).NumberFormat = "ДД.ММ.ГГГГ";  
	Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,1)).NumberFormat   = "@";  
	
	Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,19)).Value = МассивКОМ;  
	
	Лист.Range(Лист.Cells(НомерСтроки,13), Лист.Cells(КоличествоСтрок,13)).formulaLocal = "=ЕСЛИ([@[ЗАКАЗ (кол-во)]]>0;[@Стоимость]*[@[ЗАКАЗ (кол-во)]];"""")";
	//Добавить гиперссылку в 2 колонки
	//Добавить формулу
	
	СтрокаТаблицы.Сбросить();
	НомерСтроки = 7;
	Пока СтрокаТаблицы.Следующий() Цикл
		НомерСтроки = НомерСтроки + 1;
		//Ячейка = Лист.Cells(НомерСтроки, 15);
		//Если ЗначениеЗаполнено(СтрокаТаблицы.ДатаВыпуска) Тогда
		//	Попытка
		//		Ячейка.Value = Дата(СтрокаТаблицы.ДатаВыпуска);
		//	ИСключение
		//		ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - Артикул:" + СтрокаТаблицы.Номенклатура.Артикул + ", некорректная дата выпуска");
		//	КонецПопытки;	
		//КонецЕсли;
			
		Ячейка = Лист.Cells(НомерСтроки, 18);
		Ячейка.formulaLocal = "=ГИПЕРССЫЛКА("""+Ячейка.Value+""";""Ссылка на веб"")";
		//Лист.Hyperlinks.Add(Ячейка, Ячейка.Value);
		Ячейка = Лист.Cells(НомерСтроки, 19);
		Ячейка.formulaLocal = "=ГИПЕРССЫЛКА("""+Ячейка.Value+""";""Ссылка на архив фото"")";
		//Лист.Hyperlinks.Add(Ячейка, Ячейка.Value);
	КонецЦикла;

	Лист.Range(Лист.Cells(7,10), Лист.Cells(7,10)).AutoFilter(10,"<>ожид."); //указаваем столбец и значение фильтр

КонецПроцедуры

Процедура ЗаполнитьКабеля(СтрокаТаблицы, Лист, НомерСтроки)

	КоличествоСтрок = НомерСтроки + СтрокаТаблицы.Количество() -1;
	
	ВсегоСтрок 		= СтрокаТаблицы.Количество();
	ВсегоКолонок 	= 18;
	
	МассивКОМ = Новый COMSafeArray("VT_VARIANT", ВсегоКолонок, ВсегоСтрок);
	индСтрок = 0;
	//Для индСтрок = 0 По ВсегоСтрок - 1 Цикл
	Пока СтрокаТаблицы.Следующий() Цикл	
		//СтрокаТаблицы = Строки[индСтрок];
		
		МассивКОМ.SetValue(0, индСтрок, Строка(СтрокаТаблицы.Артикул));
		МассивКОМ.SetValue(1, индСтрок, Строка(СтрокаТаблицы.ТипАксессуара));
		МассивКОМ.SetValue(2, индСтрок, Строка(СтрокаТаблицы.Характеристика));
		МассивКОМ.SetValue(3, индСтрок, Строка(СтрокаТаблицы.Производитель));
		МассивКОМ.SetValue(4, индСтрок, Строка(СтрокаТаблицы.ТипРазъема));
		
		МассивКОМ.SetValue(5, индСтрок, Строка(СтрокаТаблицы.Серия));
		МассивКОМ.SetValue(6, индСтрок, Строка(СтрокаТаблицы.Распродажа));
		МассивКОМ.SetValue(7, индСтрок, Строка(СтрокаТаблицы.ДоступноеКоличество));
		МассивКОМ.SetValue(8, индСтрок, Число(СтрокаТаблицы.Стоимость));
		
		МассивКОМ.SetValue(11, индСтрок, ?(СтрокаТаблицы.ПродажиКоличество > 0 или СтрокаТаблицы.ОборотРелиз > 0,"Да","Нет"));
		МассивКОМ.SetValue(12, индСтрок, Формат(СтрокаТаблицы.ДатаПоступления,"ДФ=dd.MM.yyyy; ДП=-"));
		МассивКОМ.SetValue(13, индСтрок, Строка(СтрокаТаблицы.КоличествоОжидается));
		
		МассивКОМ.SetValue(14, индСтрок, Строка(СтрокаТаблицы.Топ));
		МассивКОМ.SetValue(15, индСтрок, Строка(СтрокаТаблицы.Новинка));
		МассивКОМ.SetValue(16, индСтрок, Строка(СтрокаТаблицы.СсылкаWeb));   
		МассивКОМ.SetValue(17, индСтрок, Строка(СтрокаТаблицы.СсылкаНаАрхивФото)); 
		индСтрок = индСтрок + 1;
	КонецЦикла;
	
	Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,1)).NumberFormat   = "@";  
	
	Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,18)).Value = МассивКОМ;  
	
	Лист.Range(Лист.Cells(НомерСтроки,11), Лист.Cells(КоличествоСтрок,11)).formulaLocal = "=ЕСЛИ([@[ЗАКАЗ (кол-во)]]>0;[@Стоимость]*[@[ЗАКАЗ (кол-во)]];"""")";
	//Добавить гиперссылку в 2 колонки
	//Добавить формулу
	Для Строка = 8 по КоличествоСтрок Цикл
		Ячейка = Лист.Cells(Строка, 17);
		Ячейка.formulaLocal = "=ГИПЕРССЫЛКА("""+Ячейка.Value+""";""Ссылка на веб"")";
		//Лист.Hyperlinks.Add(Ячейка, Ячейка.Value);
		Ячейка = Лист.Cells(Строка, 18);
		Ячейка.formulaLocal = "=ГИПЕРССЫЛКА("""+Ячейка.Value+""";""Ссылка на архив фото"")";
		//Лист.Hyperlinks.Add(Ячейка, Ячейка.Value);
	КонецЦикла;

	Лист.Range(Лист.Cells(7,8), Лист.Cells(7,8)).AutoFilter(7,"<>ожид."); //указаваем столбец и значение фильтр

КонецПроцедуры

Процедура ЗаполнитьЧехлы(СтрокаТаблицы, Лист, НомерСтроки)
	
	ПроверкаДатаВыпуска = Дата(1900,01,01);
	КоличествоСтрок = НомерСтроки + СтрокаТаблицы.Количество() -1;
	
	//Область = Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,16));
	
	ВсегоСтрок 		= СтрокаТаблицы.Количество();
	//ВсегоКолонок 	= 21;
	ВсегоКолонок 	= 50;
	МассивКОМ = Новый COMSafeArray("VT_VARIANT", ВсегоКолонок, ВсегоСтрок);
	индСтрок = 0;
	Пока СтрокаТаблицы.Следующий() Цикл
		
		//СтрокаТаблицы = Строки[индСтрок];
		
		МассивКОМ.SetValue(0, индСтрок, Строка(СтрокаТаблицы.Артикул));
		МассивКОМ.SetValue(1, индСтрок, Строка(СтрокаТаблицы.ДляАппарата));
		МассивКОМ.SetValue(2, индСтрок, Строка(СтрокаТаблицы.ДляБренда));
		МассивКОМ.SetValue(3, индСтрок, Строка(СтрокаТаблицы.ДляМоделиУстройства));
		МассивКОМ.SetValue(4, индСтрок, Строка(СтрокаТаблицы.ТипАксессуара));
		МассивКОМ.SetValue(5, индСтрок, Строка(СтрокаТаблицы.Характеристика));
		МассивКОМ.SetValue(6, индСтрок, Строка(СтрокаТаблицы.Производитель));
		МассивКОМ.SetValue(7, индСтрок, Строка(СтрокаТаблицы.Серия));
		МассивКОМ.SetValue(8, индСтрок, Строка(СтрокаТаблицы.Распродажа));
		МассивКОМ.SetValue(9, индСтрок, Строка(СтрокаТаблицы.ДоступноеКоличество));
		МассивКОМ.SetValue(10, индСтрок, Число(СтрокаТаблицы.Стоимость));
		
		МассивКОМ.SetValue(13, индСтрок, ?(СтрокаТаблицы.ПродажиКоличество > 0 или СтрокаТаблицы.ОборотРелиз > 0,"Да","Нет"));
		МассивКОМ.SetValue(14, индСтрок, Формат(СтрокаТаблицы.ДатаВыпуска,"ДФ=dd.MM.yyyy; ДП=-"));
		
		МассивКОМ.SetValue(15, индСтрок, Формат(СтрокаТаблицы.ДатаПоступления,"ДФ=dd.MM.yyyy; ДП=-"));
		МассивКОМ.SetValue(16, индСтрок, Строка(СтрокаТаблицы.КоличествоОжидается));
		МассивКОМ.SetValue(17, индСтрок, Строка(СтрокаТаблицы.Топ));
		МассивКОМ.SetValue(18, индСтрок, Строка(СтрокаТаблицы.Новинка));
		МассивКОМ.SetValue(19, индСтрок, Строка(СтрокаТаблицы.СсылкаWeb));   
		МассивКОМ.SetValue(20, индСтрок, Строка(СтрокаТаблицы.СсылкаНаАрхивФото));
		МассивКОМ.SetValue(49, индСтрок, Строка(СтрокаТаблицы.ЕстьВМатрицеКлиента));
		индСтрок = индСтрок + 1;
	КонецЦикла;
	
	Лист.Range(Лист.Cells(НомерСтроки,15), Лист.Cells(КоличествоСтрок,15)).NumberFormat = "ДД.ММ.ГГГГ";  
	Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,1)).NumberFormat   = "@";  
	
	Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,ВсегоКолонок)).Value = МассивКОМ;  
	
	Лист.Range(Лист.Cells(НомерСтроки,13), Лист.Cells(КоличествоСтрок,13)).formulaLocal = "=ЕСЛИ([@[ЗАКАЗ (кол-во)]]>0;[@Стоимость]*[@[ЗАКАЗ (кол-во)]];"""")";
	//Добавить гиперссылку в 2 колонки
	//Добавить формулу
	
	СтрокаТаблицы.Сбросить();
	НомерСтроки = 7;
	Пока СтрокаТаблицы.Следующий() Цикл
		НомерСтроки = НомерСтроки + 1;
		//Ячейка = Лист.Cells(НомерСтроки, 15);
		Если ЗначениеЗаполнено(СтрокаТаблицы.ДатаВыпуска) Тогда
			Попытка
				ТекДата = Дата(СтрокаТаблицы.ДатаВыпуска);
				Если ТекДата > ПроверкаДатаВыпуска Тогда
					//Ячейка.Value = ТекДата;
					Лист.Cells(НомерСтроки, 15).Value = ТекДата;
				Иначе
					ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - Артикул:" + СтрокаТаблицы.Номенклатура.Артикул + ", некорректная дата выпуска");
				КонецЕсли;
			ИСключение
				ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - Артикул:" + СтрокаТаблицы.Номенклатура.Артикул + ", некорректная дата выпуска");
			КонецПопытки;	
		КонецЕсли;
			
		//Ячейка = Лист.Cells(НомерСтроки, 20);
		//Лист.Cells(НомерСтроки, 20).formulaLocal = "=ГИПЕРССЫЛКА("""+Лист.Cells(НомерСтроки, 20).Value+""";""Ссылка на веб"")";
		Лист.Cells(НомерСтроки, 20).formulaLocal = "=ГИПЕРССЫЛКА("""+СтрокаТаблицы.СсылкаWeb+""";""Ссылка на веб"")";
		//Ячейка.formulaLocal = "=ГИПЕРССЫЛКА("""+Ячейка.Value+""";""Ссылка на веб"")";
		//Лист.Hyperlinks.Add(Ячейка, Ячейка.Value);
		//Ячейка = Лист.Cells(НомерСтроки, 21);
		//Лист.Cells(НомерСтроки, 21).formulaLocal = "=ГИПЕРССЫЛКА("""+Лист.Cells(НомерСтроки, 21).Value+""";""Ссылка на архив фото"")";
		Лист.Cells(НомерСтроки, 21).formulaLocal = "=ГИПЕРССЫЛКА("""+СтрокаТаблицы.СсылкаНаАрхивФото+""";""Ссылка на архив фото"")";
		//Ячейка.formulaLocal = "=ГИПЕРССЫЛКА("""+Ячейка.Value+""";""Ссылка на архив фото"")";
		//Лист.Hyperlinks.Add(Ячейка, Ячейка.Value);
	КонецЦикла;

	Лист.Range(Лист.Cells(7,10), Лист.Cells(7,10)).AutoFilter(10,"<>ожид."); //указаваем столбец и значение фильтр

	Лист.Range(Лист.Cells(8,4), Лист.Cells(КоличествоСтрок,4)).Select();  //выделение области  
	Область = Лист.Range(Лист.Cells(8,4), Лист.Cells(КоличествоСтрок,4));
	Область.FormatConditions.Delete();
	Область.FormatConditions.Add(2, ,"=RC50>0"); //AX8
	Область.FormatConditions(1).Font.Color = -16776961;
КонецПроцедуры

Процедура ЗаполнитьКабеляПредЗаказ(СтрокаТаблицы, Лист, НомерСтроки)

	КоличествоСтрок = НомерСтроки + СтрокаТаблицы.Количество() -1;
	
	ВсегоСтрок 		= СтрокаТаблицы.Количество();
	ВсегоКолонок 	= 16;
	
	МассивКОМ = Новый COMSafeArray("VT_VARIANT", ВсегоКолонок, ВсегоСтрок);
	индСтрок = 0;
	//Для индСтрок = 0 По ВсегоСтрок - 1 Цикл
	Пока СтрокаТаблицы.Следующий() Цикл	
		//СтрокаТаблицы = Строки[индСтрок];
		
		МассивКОМ.SetValue(0, индСтрок, Строка(СтрокаТаблицы.Артикул));
		МассивКОМ.SetValue(1, индСтрок, Строка(СтрокаТаблицы.ТипАксессуара));
		МассивКОМ.SetValue(2, индСтрок, Строка(СтрокаТаблицы.Характеристика));
		МассивКОМ.SetValue(3, индСтрок, Строка(СтрокаТаблицы.Производитель));
		МассивКОМ.SetValue(4, индСтрок, Строка(СтрокаТаблицы.ТипРазъема));
		
		МассивКОМ.SetValue(5, индСтрок, Строка(СтрокаТаблицы.Серия));
		МассивКОМ.SetValue(6, индСтрок, Строка(СтрокаТаблицы.Распродажа));
		МассивКОМ.SetValue(7, индСтрок, Строка(СтрокаТаблицы.ДоступноеКоличество));
		МассивКОМ.SetValue(8, индСтрок, Число(СтрокаТаблицы.Стоимость));
		
		МассивКОМ.SetValue(11, индСтрок, ?(СтрокаТаблицы.ПродажиКоличество > 0 или СтрокаТаблицы.ОборотРелиз > 0,"Да","Нет"));
		//МассивКОМ.SetValue(12, индСтрок, Формат(СтрокаТаблицы.ДатаПоступления,"ДФ=dd.MM.yyyy; ДП=-"));
		//МассивКОМ.SetValue(13, индСтрок, Строка(СтрокаТаблицы.КоличествоОжидается));
		
		МассивКОМ.SetValue(12, индСтрок, Строка(СтрокаТаблицы.Топ));
		МассивКОМ.SetValue(13, индСтрок, Строка(СтрокаТаблицы.Новинка));
		МассивКОМ.SetValue(14, индСтрок, Строка(СтрокаТаблицы.СсылкаWeb));   
		МассивКОМ.SetValue(15, индСтрок, Строка(СтрокаТаблицы.СсылкаНаАрхивФото)); 
		индСтрок = индСтрок + 1;
	КонецЦикла;
	
	Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,1)).NumberFormat   = "@";  
	
	Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,ВсегоКолонок)).Value = МассивКОМ;  
	
	Лист.Range(Лист.Cells(НомерСтроки,11), Лист.Cells(КоличествоСтрок,11)).formulaLocal = "=ЕСЛИ([@[ЗАКАЗ (кол-во)]]>0;[@Стоимость]*[@[ЗАКАЗ (кол-во)]];"""")";
	//Добавить гиперссылку в 2 колонки
	//Добавить формулу
	Для Строка = 8 по КоличествоСтрок Цикл
		Ячейка = Лист.Cells(Строка, ВсегоКолонок-1);
		Ячейка.formulaLocal = "=ГИПЕРССЫЛКА("""+Ячейка.Value+""";""Ссылка на веб"")";
		//Лист.Hyperlinks.Add(Ячейка, Ячейка.Value);
		Ячейка = Лист.Cells(Строка, ВсегоКолонок);
		Ячейка.formulaLocal = "=ГИПЕРССЫЛКА("""+Ячейка.Value+""";""Ссылка на архив фото"")";
		//Лист.Hyperlinks.Add(Ячейка, Ячейка.Value);
	КонецЦикла;

	Лист.Range(Лист.Cells(7,8), Лист.Cells(7,8)).AutoFilter(7,"<>ожид."); //указаваем столбец и значение фильтр

КонецПроцедуры

Процедура ЗаполнитьЧехлыПредЗаказ(СтрокаТаблицы, Лист, НомерСтроки)

	КоличествоСтрок = НомерСтроки + СтрокаТаблицы.Количество() -1;
	
	//Область = Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,16));
	
	ВсегоСтрок 		= СтрокаТаблицы.Количество();
	//ВсегоКолонок 	= 21;
	ВсегоКолонок 	= 50;
	МассивКОМ = Новый COMSafeArray("VT_VARIANT", ВсегоКолонок, ВсегоСтрок);
	индСтрок = 0;
	Пока СтрокаТаблицы.Следующий() Цикл
		
		//СтрокаТаблицы = Строки[индСтрок];
		
		МассивКОМ.SetValue(0, индСтрок, Строка(СтрокаТаблицы.Артикул));
		МассивКОМ.SetValue(1, индСтрок, Строка(СтрокаТаблицы.ДляАппарата));
		МассивКОМ.SetValue(2, индСтрок, Строка(СтрокаТаблицы.ДляБренда));
		МассивКОМ.SetValue(3, индСтрок, Строка(СтрокаТаблицы.ДляМоделиУстройства));
		МассивКОМ.SetValue(4, индСтрок, Строка(СтрокаТаблицы.ТипАксессуара));
		МассивКОМ.SetValue(5, индСтрок, Строка(СтрокаТаблицы.Характеристика));
		МассивКОМ.SetValue(6, индСтрок, Строка(СтрокаТаблицы.Производитель));
		МассивКОМ.SetValue(7, индСтрок, Строка(СтрокаТаблицы.Серия));
		МассивКОМ.SetValue(8, индСтрок, Строка(СтрокаТаблицы.Распродажа));
		МассивКОМ.SetValue(9, индСтрок, Строка(СтрокаТаблицы.ДоступноеКоличество));
		МассивКОМ.SetValue(10, индСтрок, Число(СтрокаТаблицы.Стоимость));
		
		МассивКОМ.SetValue(13, индСтрок, ?(СтрокаТаблицы.ПродажиКоличество > 0 или СтрокаТаблицы.ОборотРелиз > 0,"Да","Нет"));
		МассивКОМ.SetValue(14, индСтрок, Формат(СтрокаТаблицы.ДатаВыпуска,"ДФ=dd.MM.yyyy; ДП=-"));
		
		//МассивКОМ.SetValue(15, индСтрок, Формат(СтрокаТаблицы.ДатаПоступления,"ДФ=dd.MM.yyyy; ДП=-"));
		//МассивКОМ.SetValue(16, индСтрок, Строка(СтрокаТаблицы.КоличествоОжидается));
		МассивКОМ.SetValue(15, индСтрок, Строка(СтрокаТаблицы.Топ));
		МассивКОМ.SetValue(16, индСтрок, Строка(СтрокаТаблицы.Новинка));
		МассивКОМ.SetValue(17, индСтрок, Строка(СтрокаТаблицы.СсылкаWeb));   
		МассивКОМ.SetValue(18, индСтрок, Строка(СтрокаТаблицы.СсылкаНаАрхивФото));
		МассивКОМ.SetValue(49, индСтрок, Строка(СтрокаТаблицы.ЕстьВМатрицеКлиента));
		индСтрок = индСтрок + 1;
	КонецЦикла;
	
	//Лист.Range(Лист.Cells(НомерСтроки,15), Лист.Cells(КоличествоСтрок,15)).NumberFormat = "ДД.ММ.ГГГГ";  
	Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,1)).NumberFormat   = "@";  
	
	Лист.Range(Лист.Cells(НомерСтроки,1), Лист.Cells(КоличествоСтрок,ВсегоКолонок)).Value = МассивКОМ;  
	
	Лист.Range(Лист.Cells(НомерСтроки,13), Лист.Cells(КоличествоСтрок,13)).formulaLocal = "=ЕСЛИ([@[ЗАКАЗ (кол-во)]]>0;[@Стоимость]*[@[ЗАКАЗ (кол-во)]];"""")";
	//Добавить гиперссылку в 2 колонки
	//Добавить формулу
	
	СтрокаТаблицы.Сбросить();
	НомерСтроки = 7;
	Пока СтрокаТаблицы.Следующий() Цикл
		НомерСтроки = НомерСтроки + 1;
		//Ячейка = Лист.Cells(НомерСтроки, 15);
		//Если ЗначениеЗаполнено(СтрокаТаблицы.ДатаВыпуска) Тогда
		//	Попытка
		//		Ячейка.Value = Дата(СтрокаТаблицы.ДатаВыпуска);
		//	ИСключение
		//		ЗаписьЖурналаРегистрации("ОбработкаРассылкиПрайсов",УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДополнительныеОтчетыИОбработки,,"Автоматическая рассылка прайсов - Артикул:" + СтрокаТаблицы.Номенклатура.Артикул + ", некорректная дата выпуска");
		//	КонецПопытки;	
		//КонецЕсли;
			
		Ячейка = Лист.Cells(НомерСтроки, 18);
		Ячейка.formulaLocal = "=ГИПЕРССЫЛКА("""+Ячейка.Value+""";""Ссылка на веб"")";
		//Лист.Hyperlinks.Add(Ячейка, Ячейка.Value);
		Ячейка = Лист.Cells(НомерСтроки, 19);
		Ячейка.formulaLocal = "=ГИПЕРССЫЛКА("""+Ячейка.Value+""";""Ссылка на архив фото"")";
		//Лист.Hyperlinks.Add(Ячейка, Ячейка.Value);
	КонецЦикла;

	Лист.Range(Лист.Cells(7,10), Лист.Cells(7,10)).AutoFilter(10,"<>ожид."); //указаваем столбец и значение фильтр

	Лист.Range(Лист.Cells(8,4), Лист.Cells(КоличествоСтрок,4)).Select();  //выделение области  
	Область = Лист.Range(Лист.Cells(8,4), Лист.Cells(КоличествоСтрок,4));
	Область.FormatConditions.Delete();
	Область.FormatConditions.Add(2, ,"=RC50>0");  //AX8
	Область.FormatConditions(1).Font.Color = -16776961;
КонецПроцедуры