&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	
	СпискиВыбораКлиентСервер.ОбновитьСписокВыбора(Элементы.СтрокаПоиска.СписокВыбора, СтрокаПоиска);

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтрокаПоиска", СтрокаПоиска);
	СтруктураПараметров.Вставить("ПоискПоАртикулу", ПоискПоАртикулу);
	СтруктураПараметров.Вставить("ПоискВНаименовании", ПоискВНаименовании);
	СтруктураПараметров.Вставить("ПоискВПолномНаименовании", ПоискВПолномНаименовании);	
	
	Закрыть(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СпискиВыбораКлиентСервер.ОбновитьСписокВыбора(Элементы.СтрокаПоиска.СписокВыбора, СтрокаПоиска);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтрокаПоиска", СтрокаПоиска);
	СтруктураПараметров.Вставить("ПоискПоАртикулу", ПоискПоАртикулу);
	СтруктураПараметров.Вставить("ПоискВНаименовании", ПоискВНаименовании);
	СтруктураПараметров.Вставить("ПоискВПолномНаименовании", ПоискВПолномНаименовании);	
	
	Закрыть(СтруктураПараметров);

КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	СпискиВыбораКлиентСервер.АвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("SubSysРабочееМестоМенеджераПоПродажамУТ11",);
	Если НЕ Настройки = Неопределено Тогда
		Если Настройки.Свойство("ИсторияПоискаНоменклатуры") Тогда
			Элементы.СтрокаПоиска.СписокВыбора.ЗагрузитьЗначения(Настройки.ИсторияПоискаНоменклатуры);
		КОнецЕсли;
	КОнецЕсли;
	
	ПоискПоАртикулу = Параметры.ПоискПоАртикулу;
	ПоискВНаименовании = Параметры.ПоискВНаименовании;
	ПоискВПолномНаименовании = Параметры.ПоискВПолномНаименовании;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
КонецПроцедуры




