
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Отчет.ТоварыКПоступлению.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии",
			Новый Структура("Склад, Распоряжение", ПолучитьСклад(ПараметрКоманды), ПараметрКоманды),
			"СостояниеПриемкиКонтекст",
			"СостояниеПриемкиКонтекст",
			Истина);

	ОткрытьФорму("Отчет.ТоварыКПоступлению.Форма",
			ПараметрыФормы,
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно);                                                 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСклад(Знач ПараметрКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ЗаказНаПеремещение") 
		или ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ПеремещениеТоваров")  Тогда
	
		Возврат ПараметрКоманды.СкладПолучатель;	
	
	Иначе
	
		Возврат ПараметрКоманды.Склад;
	
	КонецЕсли;
	
	
КонецФункции

