
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Получатели.АвтоЗаполнение тогда
		ОбменДанными.Получатели.Очистить();
		Если ссылка.пустая() тогда//новый объект
			Если ТСД.Пустая() тогда
				ОбменДанными.Получатели.Заполнить();
			Иначе	
				ОбменДанными.Получатели.Добавить(ТСД);
			КонецЕсли;	
		Иначе	
			Если ТСД.Пустая() или Ссылка.ТСД.Пустая() тогда
				ОбменДанными.Получатели.Заполнить();
			Иначе	
				ОбменДанными.Получатели.Добавить(ТСД);
				ОбменДанными.Получатели.Добавить(Ссылка.ТСД);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	Если ДатаСоздания=Дата(1,1,1) тогда
		ДатаСоздания=ТекущаяДата();
	КонецЕсли;	
	Если ИсходныйДокумент=Неопределено тогда
		Возврат;
	КонецЕсли;	
	Если ИсходныйДокумент.Пустая() тогда
		Возврат;
	КонецЕсли;	
	Если СокрЛП(Комментарий)="" тогда
		Комментарий=СокрЛП(ИсходныйДокумент.Комментарий);
	КонецЕсли;	
	Если СокрЛП(Номер)="" тогда
		Номер=СокрЛП(ИсходныйДокумент.Номер);
	КонецЕсли;	
	Если Клиент.Пустая() тогда
		попытка Клиент=ИсходныйДокумент.Партнер;  Исключение КонецПопытки;
		попытка Клиент=ИсходныйДокумент.Отправитель;  Исключение КонецПопытки;
		попытка Клиент=ИсходныйДокумент.Получатель;  Исключение КонецПопытки;
	КонецЕсли;
	
	Если Склад.Пустая() тогда
		Попытка Склад=ИсходныйДокумент.ТорговыйОбъект;  Исключение КонецПопытки;
		Попытка Склад=ИсходныйДокумент.Помещение.Владелец;  Исключение КонецПопытки;
		Попытка Склад=ИсходныйДокумент.Склад;  Исключение КонецПопытки;		
		Попытка Склад=ИсходныйДокумент.СкладОтправитель;  Исключение КонецПопытки;
		//Попытка Склад=ИсходныйДокумент.СкладПолучатель;  Исключение КонецПопытки;
	КонецЕсли;
	
	Если Дата=Дата(1,1,1) тогда
		Дата=ИсходныйДокумент.Дата;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Клиент) Тогда
		Попытка
			Клиент = ИсходныйДокумент.Распоряжение.Получатель;
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если ТСД.Пустая() или Ссылка.ТСД.Пустая() тогда
		ОбменДанными.Получатели.Заполнить();
	Иначе	
		ОбменДанными.Получатели.Добавить(ТСД);
		ОбменДанными.Получатели.Добавить(Ссылка.ТСД);
	КонецЕсли;	
КонецПроцедуры

Процедура ПриКопировании()
	
	Номер = "";
	Дата = "";
	Клиент = Справочники.Партнеры.ПустаяСсылка();
	СобранныеДанныеПодбор.Очистить();
	СобранныеДанныеПриемка.Очистить();
	
	
КонецПроцедуры