
//Перед записью
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(Автор) Тогда
		Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ГАЛ_ДенежныеСредстваМУ Расход
	Движения.ГАЛ_ДенежныеСредстваМУ.Записывать = Истина;
	Для Каждого ТекСтрокаОплаты Из Оплаты Цикл
		Движение = Движения.ГАЛ_ДенежныеСредстваМУ.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ЗаказНаДоставку = ТекСтрокаОплаты.ЗаказНаДоставку;
		//Движение.КурьерЭкспедитор = КурьерЭкспедитор;
		Движение.Организация = ТекСтрокаОплаты.ЗаказНаДоставку.Организация;
		Движение.ТипДС = ТекСтрокаОплаты.ТипДС;
		Движение.Сумма = ТекСтрокаОплаты.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
