
&НаСервере
Процедура ИнициализацияОбработки()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СхемаЗапроса");
	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализацияОбработки();

КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("АдресСхемыВХранилище", КомпоновщикНастроек);
	ПараметрыЗапроса.Вставить("ИспользоватьХарактеристикиНоменклатуры", Объект.ИспользоватьХарактеристикиНоменклатуры);
	ПараметрыЗапроса.Вставить("ИспользоватьМегапрайс", Объект.ИспользоватьМегапрайс);

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ОбработкаОбъект.СформироватьТаблицуНаСервере(ПараметрыЗапроса);
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Объект.ТаблицаНоменклатуры.Очистить();

	СформироватьНаСервере();
		
	Элементы.Закладки.ТекущаяСтраница = ЭтаФорма.Элементы.Закладки.ПодчиненныеЭлементы.ТаблицаДанных;
	
КонецПроцедуры
