
&НаСервере
Процедура ЗаполнитьТаблицуПоказателей()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Макет = ОбработкаОбъект.ПолучитьМакет("ПоказателиДляФормул");
	Область = Макет.ПолучитьОбласть("Показатели");
	
	ВсегоСтрок = Область.ВысотаТаблицы + 1;
	ТекущаяСтрока = 1;
	
	СписокПоказателей.Очистить();	
	Пока ТекущаяСтрока < ВсегоСтрок Цикл	
		ТекущаяСтрока = ТекущаяСтрока + 1;	
		
		мСтрока = "R"+Формат(ТекущаяСтрока,"ЧДЦ=0; ЧГ=");
		Показатель = Область.ПолучитьОбласть( мСтрока + "C1").ТекущаяОбласть.Текст;
		Если ПустаяСтрока(Показатель) Тогда
			Продолжить;
		КонецЕсли;
		Пометка = Область.ПолучитьОбласть( мСтрока + "C3").ТекущаяОбласть.Текст;	
		
		ДобавитьСтроку = СписокПоказателей.Добавить();
		ДобавитьСтроку.Показатель = Показатель;
		ДобавитьСтроку.Пояснение = Область.ПолучитьОбласть( мСтрока + "C2").ТекущаяОбласть.Текст;	
		ДобавитьСтроку.Особый = ?(Пометка = "1", Истина, Ложь);		
	КонецЦикла;
	
Конецпроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Алгоритм = Параметры.ТекстАлгоритма;

	ЗаполнитьТаблицуПоказателей();
	
	Если ПустаяСтрока(Алгоритм) Тогда
		Алгоритм = "//Главное возвращаемое значение: Заказать. 
		|//Все жирные показатели, также можно изменить формулой и они изменятся в итоговой таблице.
		|
		|//----------> По товарам, которым указаны точки заказов, всегда расчитывать исключительно по ним.
		|Если МинимальноеКоличествоЗапаса > 0 Тогда 
		|	ОстатокСУчетомЗаказов = СвободныйОстаток + ЗаказаноПоставщикам;	
		|   Разница = МинимальноеКоличествоЗапаса - ОстатокСУчетомЗаказов; 
		|		
		|	Если Разница >= 0 Тогда
		|		РекомендуетсяЗаказать = МаксимальноеКоличествоЗапаса - ОстатокСУчетомЗаказов;
		|	КонецЕсли;
	    |//----------> В остальных случаях делаем расчет по продажам
		|Иначе 
		|	РекомендуетсяЗаказать = ПланПродаж - ТекущийАктив;
		|КонецЕсли;	
		|
		|РекомендуетсяЗаказать = ?(РекомендуетсяЗаказать < 0,0,РекомендуетсяЗаказать);
		|Заказать = РекомендуетсяЗаказать;";

	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
//  Работа подсистемы АЛГОРИТМЫ

&НаКлиенте
Процедура АлгоритмПрименить(Команда)
		
	Закрыть(Алгоритм);
	
КонецПроцедуры


