
&НаСервере
Процедура НайтиКоординатыНаСервере()
	ПКоординаты = ГАЛ_ApiYandex.YandexGeoCode(Адрес);
	
	Если ПКоординаты<>Неопределено Тогда
	  КоординатыСтрокой = ПКоординаты.lat + "," + ПКоординаты.lng;
	  //Константы.ГАЛ_КоординатыНачальнойКарты.Установить(КоординатыСтрокой);
	  НаборКонстант.ГАЛ_КоординатыНачальнойКарты = КоординатыСтрокой;
  КонецЕсли;
  
КонецПроцедуры


//Найти координатып по адресу
&НаКлиенте
Процедура НайтиКоординаты(Команда)
	НайтиКоординатыНаСервере();
КонецПроцедуры

