&НаСервереБезКонтекста
Функция ПолучитьИдентификаторРегламентногоЗадания()
	
	МетаданныеВыбор     = Метаданные.РегламентныеЗадания.мегапрайсАвтозаказ;
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(МетаданныеВыбор);	
	Возврат Строка(РегламентноеЗадание.УникальныйИдентификатор);

КонецФункции

&НаКлиенте
Процедура НастроитьРегламентноеЗадание(Команда)

	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Идентификатор",  ПолучитьИдентификаторРегламентногоЗадания());
	ПараметрыФормы.Вставить("Действие",      "Изменить");
	
	ОткрытьФорму("Обработка.РегламентныеИФоновыеЗадания.Форма.РегламентноеЗадание", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры
