
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	АдресВХранилище = Параметры.Адрес;
	
	Объект.Производитель = СтруктураПараметров.Производитель;
	Объект.АналогиНоменклатуры.Очистить();
		
	Для Каждого Строка из СтруктураПараметров.ТабличнаяЧасть Цикл
		Если ПустаяСтрока(Строка.Поле_Наименование) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.ИдентификаторАналогаЗагрузка = Строка.ИдентификаторАналога Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.АналогиНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
		НоваяСтрока.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры
