

//Поиск координат
&НаСервере
Процедура НайтиКоординатыНаСервере()
	  ПКоординаты = ГАЛ_ApiYandex.YandexGeoCode(Адрес);
	
	Если ПКоординаты<>Неопределено Тогда
	  КоординатыСтрокой = ПКоординаты.lat + "," + ПКоординаты.lng;
	  //Константы.ГАЛ_КоординатыНачальнойКарты.Установить(КоординатыСтрокой);
	  НаборКонстант.ГАЛ_КоординатыНачальнойКарты = КоординатыСтрокой;
  КонецЕсли;
  
КонецПроцедуры

//Найти координатып по адресу
&НаКлиенте
Процедура НайтиКоординаты(Команда)
	НайтиКоординатыНаСервере();
КонецПроцедуры


//Актуальные физ лица
&НаКлиенте
Процедура АктуальныеФизЛица(Команда)
	ОткрытьФорму("РегистрСведений.ГАЛ_АктуальныеФизЛицаМУ.ФормаСписка");
КонецПроцедуры

//Города
&НаКлиенте
Процедура Города(Команда)
	ОткрытьФорму("Справочник.ГАЛ_Города.ФормаСписка");
КонецПроцедуры

//ГАЛ_ЦветаМетокФизЛиц
&НаКлиенте
Процедура ЦветаМетокФизЛиц(Команда)
	ОткрытьФорму("РегистрСведений.ГАЛ_ЦветаМетокФизЛиц.ФормаСписка");

КонецПроцедуры

//ШаблоныСообщений
&НаКлиенте
Процедура ШаблоныСообщений(Команда)
	ОткрытьФорму("Справочник.ШаблоныСообщений.ФормаСписка");
КонецПроцедуры

//Координаты складов
&НаКлиенте
Процедура КоординатыСкладов(Команда)
	ОткрытьФорму("РегистрСведений.ГАЛ_КоординатыСкладов.ФормаСписка");

КонецПроцедуры

// ГАЛ_ОсновныеКассыОрганизаций
&НаКлиенте
Процедура ЗначенияПоУмолчаниюКасса(Команда)
	ОткрытьФорму("РегистрСведений.ГАЛ_ОсновныеКассыОрганизаций.ФормаСписка");

КонецПроцедуры

//Настройки пуш уведомлений
&НаКлиенте
Процедура НастройкиPushУведомлений(Команда)
	ОткрытьФорму("РегистрСведений.ГАЛ_НастройкиPushУведомлений.ФормаСписка");
КонецПроцедуры
