
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДляБренда = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Для бренда");
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", ДляБренда);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	Элементы.Бренд.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
	
	ДляАппарата = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Для аппарата (Аксессуары для электроники)", Истина);	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", ДляАппарата);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	Элементы.ТипАппарата.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
	
	ДляМоделиУстроиства = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Для модели устройства");
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", ДляМоделиУстроиства);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	Элементы.Модель.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
	Если параметры.свойство("ДанныеЗаполнения") тогда
		ЗаполнитьЗначенияСвойств(объект, параметры.ДанныеЗаполнения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	//закрыть(объект.ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	закрыть(объект.ссылка);
//Вставить содержимое обработчика
КонецПроцедуры



