	
Функция ПолучитьДанныеДляПечатнойФормы(МассивОбъектов, ПараметрыПечати)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ГАЛ_ЗаказНаДоставку.ТранспортнаяКомпания) КАК ТранспортнаяКомпания,
	|	МАКСИМУМ(ГАЛ_ЗаказНаДоставку.АдресДоставки) КАК АдресДоставки,
	|	ГАЛ_ЗаказНаДоставку.ДокументОснование,
	|	МАКСИМУМ(ГАЛ_ЗаказНаДоставку.КонтактноеЛицо) КАК КонтактноеЛицо
	|ПОМЕСТИТЬ ДанныеПоДоставке
	|ИЗ
	|	Документ.ГАЛ_ЗаказНаДоставку КАК ГАЛ_ЗаказНаДоставку
	|ГДЕ
	|	ГАЛ_ЗаказНаДоставку.ДокументОснование В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГАЛ_ЗаказНаДоставку.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.Номер КАК Номер,
	|	Документы.Дата КАК Дата,
	|	Документы.Организация КАК Организация,
	|	Документы.Организация.Префикс КАК Префикс,
	|	Документы.Контрагент КАК Клиент,
	|	Документы.Контрагент КАК Получатель,
	|	Документы.Менеджер.ФизическоеЛицо КАК Менеджер,
	|	Документы.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	Документы.Грузоотправитель КАК Грузоотправитель,
	|	Документы.Грузополучатель КАК Грузополучатель,
	|	ЕСТЬNULL(ДанныеПоДоставке.ТранспортнаяКомпания, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ТранспортнаяКомпания,
	|	ЕСТЬNULL(ДанныеПоДоставке.АдресДоставки, """") КАК АдресДоставки,
	|	ЕСТЬNULL(ДанныеПоДоставке.КонтактноеЛицо, """") КАК КонтактноеЛицо
	|ИЗ
	|	Документ.ЗаказКлиента КАК Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоДоставке КАК ДанныеПоДоставке
	|		ПО (ДанныеПоДоставке.ДокументОснование = Документы.Ссылка)
	|ГДЕ
	|	Документы.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документы.МоментВремени";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	//Запрос.УстановитьПараметр("ПредставлениеДокумента",	НСтр("ru = 'Заказ клиента'"));
	//Запрос.УстановитьПараметр("ПредставлениеВОшибке",	НСтр("ru = 'заказа клиента'"));
	//Запрос.УстановитьПараметр("ВыводитьДопКолонкиНДС", Константы.ВыводитьДопКолонкиНДС.Получить());
	
	РезультатовЗапроса = Запрос.Выполнить();
	
	СтруктураДанныхДляПечати = Новый Структура;
	СтруктураДанныхДляПечати.Вставить("РезультатПоШапке", РезультатовЗапроса);
	//СтруктураДанныхДляПечати.Вставить("РезультатПоЭтапамОплаты", ПакетРезультатовЗапроса[1]);
	//СтруктураДанныхДляПечати.Вставить("РезультатПоТабличнойЧасти", ПакетРезультатовЗапроса[ПакетРезультатовЗапроса.Количество() - 1]);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Процедура ЗаполнитьТабличныйДокумент(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыВывода)
	
	ДанныеПечати = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	
	ПервыйДокумент = Истина;
	
	Если ПараметрыВывода.НоваяФорма Тогда
		Макет = ПолучитьМакет("МакетНовый");
		ТабличныйДокумент.Защита = Ложь;
	Иначе
		Макет = ПолучитьМакет("Макет");
	КонецЕсли;
	
	текКоличествоКоробок = 1;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		//// Для печати комплектов
		//Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено Тогда
		//	КомплектПечатиПоСсылке = КомплектыПечати.Найти(ДанныеПечати.Ссылка,"Ссылка");
		//	Если КомплектПечатиПоСсылке = Неопределено Тогда
		//		КомплектПечатиПоСсылке = КомплектыПечати[0];
		//	КонецЕсли;
		//	Если КомплектПечатиПоСсылке.Экземпляров = 0 Тогда
		//		Продолжить
		//	КонецЕсли;
		//КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		
		Если ПервыйДокумент Тогда
			ПервыйДокумент = Ложь;
		Иначе
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Пока текКоличествоКоробок <= ПараметрыВывода.КоличествоКоробок Цикл
			// Вывод шапки документа
			ОбластьМакета 									= Макет.ПолучитьОбласть("Шапка");
			Если ПараметрыВывода.НоваяФорма Тогда
				ТекНомер = ДанныеПечати.Номер;
				ТекНомер = УдалитьПрефикс(ТекНомер);
				//ТекНомер = СтрЗаменить(ТекНомер,"-","");
				ТекНомер = УдалитьЛидирующиеНули(ТекНомер);
				ОбластьМакета.Параметры.ЗаказОт					= "№"+ТекНомер;
			Иначе	
				ОбластьМакета.Параметры.ЗаказОт					= ""+ДанныеПечати.Номер;// + " от " + Формат(ДанныеПечати.Дата, "ДФ=dd.MM.yyyy");
			КонецЕсли;	
			//ОбластьМакета.Параметры.ЗаказВремя				= Формат(ДанныеПечати.Дата, "ДЛФ=T");
			ОбластьМакета.Параметры.Клиент 					= ДанныеПечати.Клиент;
			//ОбластьМакета.Параметры.ТранспортнаяКомпания 	= ДанныеПечати.ТранспортнаяКомпания;
			ОбластьМакета.Параметры.КоличествоКоробок 		= ""+текКоличествоКоробок + " из " + ПараметрыВывода.КоличествоКоробок;
			//ОбластьМакета.Параметры.АдресДоставки 			= ДанныеПечати.АдресДоставки;
			//ОбластьМакета.Параметры.КонтактноеЛицо 			= ДанныеПечати.КонтактноеЛицо;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			текКоличествоКоробок = текКоличествоКоробок + 1;
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры

Функция УдалитьПрефикс(Знач Код)
	
	Если Найти(Код,"-") Тогда
	
		Код = Сред(Код,Найти(Код,"-")+1);
	
	КонецЕсли;
	
	Возврат Код;
КонецФункции

Функция УдалитьЛидирующиеНули(Знач Код)
	
	Пока СтрДлина(Код) > 0 Цикл
		
		Если Не СтрНачинаетсяС(Код, "0") Тогда
			Прервать;
		КонецЕсли;
		
		Код = Прав(Код, СтрДлина(Код) - 1);
		
	КонецЦикла;
	
	Возврат ?(ПустаяСтрока(Код), "0", Код);
КонецФункции

Функция СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати,ПараметрыВывода)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТранспортнаяЭтикетка";
	УстановитьПривилегированныйРежим(Истина);
	ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормы(МассивОбъектов,ПараметрыВывода);
	ЗаполнитьТабличныйДокумент(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыВывода);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТранспортнаяЭтикетка", "Транспортная этикетка", СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати,ПараметрыВывода));	
КонецПроцедуры

Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации = Новый Структура;
	
	//МассивНазначений = Новый Массив;
	//МассивНазначений.Добавить("Документ.ЗаказКлиента");
	
	ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма");
	//ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "Транспортная этикетка");
	ПараметрыРегистрации.Вставить("Версия", "1.1");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация", "Дополнительная печатная форма к обработке Отгрузка");
	
	ТаблицаКоманд = Новый ТаблицаЗначений;
	ТаблицаКоманд.Колонки.Добавить("Представление");
	ТаблицаКоманд.Колонки.Добавить("Идентификатор");
	ТаблицаКоманд.Колонки.Добавить("Использование");
	ТаблицаКоманд.Колонки.Добавить("Модификатор");
	ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение");
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = "Транспортная этикетка";
	НоваяКоманда.Идентификатор = "ТранспортнаяЭтикетка";
	НоваяКоманда.Использование = "ВызовСерверногоМетода";
	НоваяКоманда.ПоказыватьОповещение = Истина;
	НоваяКоманда.Модификатор = "ПечатьMXL";
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;		
КонецФункции	

Процедура ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, ТабличныйДокумент,
	Картинка = Неопределено, ПолныйПутьКМакету = "", ИмяФайлаПечатнойФормы = Неопределено)
	
	
	Для Каждого ОписаниеПечатнойФормы Из КоллекцияПечатныхФорм Цикл
		Если ОписаниеПечатнойФормы.ИмяВРЕГ = ВРег(ИмяМакета) Тогда
			ОписаниеПечатнойФормы.ТабличныйДокумент = ТабличныйДокумент;
			ОписаниеПечатнойФормы.СинонимМакета = СинонимМакета;
			ОписаниеПечатнойФормы.Картинка = Картинка;
			ОписаниеПечатнойФормы.ПолныйПутьКМакету = ПолныйПутьКМакету;
			ОписаниеПечатнойФормы.ИмяФайлаПечатнойФормы = ИмяФайлаПечатнойФормы;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры
