
Процедура ПриЗаписи(Отказ)
	ОбъектОбработки=ВнешняяПечатнаяФорма.ПолучитьОбъект();
	Если ОбъектОбработки=Неопределено тогда
		ОбъектОбработки=Справочники.ДополнительныеОтчетыИОбработки.СоздатьЭлемент();
		ОбъектОбработки.УстановитьСсылкуНового(ВнешняяПечатнаяФорма);
	КонецЕсли;	
	ОбъектОбработки.Вид=Перечисления.ВидыДополнительныхОтчетовИОбработок.ПечатнаяФорма;
	ОбъектОбработки.Наименование="Выгрузить в DataMobile по шаблону '"+Наименование+"'";
	ОбъектОбработки.ХранилищеОбработки = Новый ХранилищеЗначения(ПолучитьМакет("МакетВПФ"));
	ОбъектОбработки.ИспользоватьДляФормыОбъекта=Истина;
	ОбъектОбработки.ИспользоватьДляФормыСписка=Истина;
	ОбъектОбработки.Публикация=Перечисления.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется;
	ОбъектОбработки.Назначение.Очистить();
	СтрокаОбъекта=ОбъектОбработки.Назначение.Добавить();
	лПолноеИмяОбъектаМетаданных = Метаданные.Документы[ВидДокумента].ПолноеИмя();
	//СтрокаОбъекта.ОбъектНазначения=Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя",лПолноеИмяОбъектаМетаданных,Справочники.ИдентификаторыОбъектовМетаданных.Документы);
	СтрокаОбъекта.ОбъектНазначения=Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя",лПолноеИмяОбъектаМетаданных);
	//Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя","Документы");
	ОбъектОбработки.Команды.Очистить();
	ОбъектОбработки.Ответственный=Пользователи.ТекущийПользователь();
	НоваяСтрока = ОбъектОбработки.Команды.Добавить();
	НоваяСтрока.Идентификатор	= "ОтправитьВДМ"+Формат(Код,"ЧГ=0");
	НоваяСтрока.Представление	= "Выгрузить в DataMobile по шаблону '"+Наименование+"'";
	НоваяСтрока.Модификатор		= "";
	НоваяСтрока.ПоказыватьОповещение = Ложь;
	НоваяСтрока.ВариантЗапуска = Перечисления.СпособыВызоваДополнительныхОбработок.ВызовКлиентскогоМетода;
	
	Если ЭтотОбъект.ПометкаУдаления Тогда
		ОбъектОбработки.Назначение.Очистить();
		ОбъектОбработки.Команды.Очистить();
	КонецЕсли;
	//СтрокаОбъекта.ДополнительныеПараметрыОбработки = Новый ХранилищеЗначения(Новый Структура("КодШаблона",Код));
	//СтрокаОбъекта.ПредставлениеНастроекОбработки   = "<Изменить параметры>";
	//МетаданныеОбъекта=СтрокаОбъекта.СсылкаОбъекта.Метаданные();
	//СтрокаОбъекта.ПредставлениеОбъекта = "Документ """ + ?(МетаданныеОбъекта.Синоним = "", МетаданныеОбъекта.Имя, МетаданныеОбъекта.Синоним) + """";
	ОбъектОбработки.Записать();
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ВнешняяПечатнаяФорма.Пустая() тогда
		ВнешняяПечатнаяФорма=Справочники.ДополнительныеОтчетыИОбработки.ПолучитьСсылку(Новый УникальныйИдентификатор());
	КонецЕслИ;	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если НЕ ВнешняяПечатнаяФорма.Пустая() тогда
		
		
		ВПФ = ВнешняяПечатнаяФорма.ПолучитьОбъект();
		ВПФ.Назначение.Очистить();
		ВПФ.Команды.Очистить();
		ВПФ.Записать();
		ВПФ.Удалить();
		
	КонецЕслИ;	
	
КонецПроцедуры


Процедура ПриКопировании()
	
	ВнешняяПечатнаяФорма = Неопределено;
	
Конецпроцедуры