
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ВыручкаИСебестоимостьПродаж.Очистить();
	Движения.ВыручкаИСебестоимостьПродаж.Записывать = Истина;

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВыручкаИСебестоимостьПродажОбороты.Регистратор КАК Регистратор,
	                      |	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента КАК ЗаказКлиента,
	                      |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
	                      |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика КАК АналитикаУчетаНоменклатурыХарактеристика,
	                      |	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК КоличествоОборот,
	                      |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот, 0)) КАК СтоимостьОборот,
	                      |	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК СуммаВыручкиОборот,
	                      |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента) КАК ЗаказКлиента1,
	                      |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	                      |	ВыручкаИСебестоимостьПродажОбороты.Подразделение КАК Подразделение,
	                      |	ВыручкаИСебестоимостьПродажОбороты.ТипЗапасов КАК ТипЗапасов,
	                      |	ВыручкаИСебестоимостьПродажОбороты.ВидЗапасов КАК ВидЗапасов,
	                      |	ВыручкаИСебестоимостьПродажОбороты.РазделУчета КАК РазделУчета,
	                      |	ВыручкаИСебестоимостьПродажОбороты.Партия КАК Партия,
	                      |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	                      |	ВыручкаИСебестоимостьПродажОбороты.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	                      |	ВыручкаИСебестоимостьПродажОбороты.Склад КАК Склад,
	                      |	ВыручкаИСебестоимостьПродажОбороты.Соглашение КАК Соглашение,
	                      |	ВыручкаИСебестоимостьПродажОбороты.Договор КАК Договор,
	                      |	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	                      |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	                      |	ВыручкаИСебестоимостьПродажОбороты.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	                      |	ВыручкаИСебестоимостьПродажОбороты.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	                      |	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК СуммаВыручкиОборот1,
	                      |	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиБезНДСОборот) КАК СуммаВыручкиБезНДСОборот,
	                      |	ВыручкаИСебестоимостьПродажОбороты.Менеджер КАК Менеджер
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&Нач, &Кон, Регистратор, ) КАК ВыручкаИСебестоимостьПродажОбороты
	                      |ГДЕ
	                      |	(ТИПЗНАЧЕНИЯ(ВыручкаИСебестоимостьПродажОбороты.Регистратор) = ТИП(Документ.РеализацияТоваровУслуг)
	                      |			ИЛИ ТИПЗНАЧЕНИЯ(ВыручкаИСебестоимостьПродажОбороты.Регистратор) = ТИП(Документ.ЗакрытиеМесяца)
	                      |			ИЛИ ТИПЗНАЧЕНИЯ(ВыручкаИСебестоимостьПродажОбороты.Регистратор) = ТИП(Документ.ОтчетКомиссионера))
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента,
	                      |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура,
	                      |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика,
	                      |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры,
	                      |	ВыручкаИСебестоимостьПродажОбороты.Регистратор,
	                      |	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация,
	                      |	ВыручкаИСебестоимостьПродажОбороты.НаправлениеДеятельностиКонтрагента,
	                      |	ВыручкаИСебестоимостьПродажОбороты.Подразделение,
	                      |	ВыручкаИСебестоимостьПродажОбороты.ВидДеятельностиНДС,
	                      |	ВыручкаИСебестоимостьПродажОбороты.НаправлениеДеятельностиНоменклатуры,
	                      |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам,
	                      |	ВыручкаИСебестоимостьПродажОбороты.Партия,
	                      |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНаборов,
	                      |	ВыручкаИСебестоимостьПродажОбороты.ВидЗапасов,
	                      |	ВыручкаИСебестоимостьПродажОбороты.РазделУчета,
	                      |	ВыручкаИСебестоимостьПродажОбороты.Склад,
	                      |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПартий,
	                      |	ВыручкаИСебестоимостьПродажОбороты.Соглашение,
	                      |	ВыручкаИСебестоимостьПродажОбороты.Договор,
	                      |	ВыручкаИСебестоимостьПродажОбороты.ТипЗапасов,
	                      |	ВыручкаИСебестоимостьПродажОбороты.Менеджер
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ.Регистратор КАК Регистратор,
	                      |	ВТ.ЗаказКлиента КАК ЗаказКлиента,
	                      |	ВТ.АналитикаУчетаНоменклатурыНоменклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
	                      |	ВТ.АналитикаУчетаНоменклатурыХарактеристика КАК АналитикаУчетаНоменклатурыХарактеристика,
	                      |	ВТ.КоличествоОборот КАК КоличествоОборот,
	                      |	ВТ.СтоимостьОборот КАК СтоимостьОборот,
	                      |	ВТ.СуммаВыручкиОборот КАК СуммаВыручкиОборот,
	                      |	ВТ.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	                      |	ВТ.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	                      |	ВТ.Подразделение КАК Подразделение,
	                      |	ВТ.ТипЗапасов КАК ТипЗапасов,
	                      |	ВТ.ВидЗапасов КАК ВидЗапасов,
	                      |	ВТ.РазделУчета КАК РазделУчета,
	                      |	ВТ.Партия КАК Партия,
	                      |	ВТ.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	                      |	ВТ.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	                      |	ВТ.Склад КАК Склад,
	                      |	ВТ.Договор КАК Договор,
	                      |	ВТ.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	                      |	ВТ.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	                      |	ВТ.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	                      |	ВТ.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	                      |	ВТ.СуммаВыручкиБезНДСОборот КАК СуммаВыручкиБезНДСОборот,
	                      |	ВТ.Менеджер КАК Менеджер
	                      |ИЗ
	                      |	ВТ КАК ВТ
	                      |ГДЕ
	                      |	ВТ.СтоимостьОборот = 0
	                      |	И ВТ.СуммаВыручкиОборот > 0");
	Запрос.УстановитьПараметр("Нач",НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Кон",Конецмесяца(Дата));
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого ТекСтрока ИЗ Результат Цикл
		//ЗапросЦены = Новый Запрос("ВЫБРАТЬ
		//                          |	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
		//                          |	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Характеристика КАК АналитикаУчетаНоменклатурыХарактеристика,
		//                          |	СУММА(СебестоимостьТоваровОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		//                          |	СУММА(СебестоимостьТоваровОстатки.СтоимостьОстаток) КАК СтоимостьОстаток,
		//                          |	СУММА(СебестоимостьТоваровОстатки.СтоимостьБезНДСОстаток) КАК СтоимостьБезНДСОстаток
		//                          |ИЗ
		//                          |	РегистрНакопления.СебестоимостьТоваров.Остатки(, ) КАК СебестоимостьТоваровОстатки
		//                          |ГДЕ
		//                          |	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура
		//                          |	И СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Характеристика = &Характеристика
		//                          |
		//                          |СГРУППИРОВАТЬ ПО
		//                          |	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура,
		//                          |	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Характеристика");
		ЗапросЦены = Новый Запрос("ВЫБРАТЬ
		                          |	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
		                          |	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика КАК АналитикаУчетаНоменклатурыХарактеристика,
		                          |	СебестоимостьТоваровОбороты.СтоимостьПриход КАК СтоимостьОстаток,
		                          |	СебестоимостьТоваровОбороты.Регистратор КАК Регистратор,
		                          |	СебестоимостьТоваровОбороты.КоличествоПриход КАК КоличествоОстаток,
		                          |	СебестоимостьТоваровОбороты.СтоимостьБезНДСПриход КАК СтоимостьБезНДСОстаток
		                          |ИЗ
		                          |	РегистрНакопления.СебестоимостьТоваров.Обороты(, , Регистратор, ) КАК СебестоимостьТоваровОбороты
		                          |ГДЕ
		                          |	ТИПЗНАЧЕНИЯ(СебестоимостьТоваровОбороты.Регистратор) = ТИП(Документ.ПриобретениеТоваровУслуг)
		                          |	И СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура
		                          |	И СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика = &Характеристика
		                          |
		                          |УПОРЯДОЧИТЬ ПО
		                          |	СебестоимостьТоваровОбороты.Регистратор.Дата УБЫВ");
		ЗапросЦены.УстановитьПараметр("Номенклатура",ТекСтрока.АналитикаУчетаНоменклатурыНоменклатура);
		ЗапросЦены.УстановитьПараметр("Характеристика",ТекСтрока.АналитикаУчетаНоменклатурыХарактеристика);
		Выборка = ЗапросЦены.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПроверкаНаПоЗаказу = ПроверитьПоЗаказу(ТекСТрока.ЗаказКлиента);
			Попытка
				Если ТекСтрока.СуммаВыручкиОборот > 0 И ТекСтрока.СуммаВыручкиОборот < 100 Тогда
					СтоимомостьРасчет = (Выборка.СтоимостьОстаток/ ВЫборка.КоличествоОстаток) * ТекСТрока.КоличествоОборот;
					СтоимомостьРасчетБезНДС = (Выборка.СтоимостьБезНДСОстаток/ ВЫборка.КоличествоОстаток) * ТекСТрока.КоличествоОборот;
					Движение = Движения.ВыручкаИСебестоимостьПродаж.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, ТекСтрока);
					Движение.Количество = 0;
					Движение.Период = Движение.Регистратор.Дата;
					Движение.СуммаВыручкиСНДСРегл = 0;
					Движение.СуммаВыручкиБезНДС = 0;
					Движение.СуммаВыручкиРегл = 0;
					Движение.СуммаВВалютеВзаиморасчетов = 0;
					Движение.СуммаВВалютеДокумента = 0;
					Движение.СуммаБезНДСВВалютеВзаиморасчетов = 0;
					Движение.СуммаБезНДСВВалютеДокумента = 0;
					Движение.Стоимость = СтоимомостьРасчет;
					Движение.СтоимостьБезНДС = СтоимомостьРасчетБезНДС;
					Движение.СтоимостьРегл = СтоимомостьРасчетБезНДС;
					Движение.РасчетСебестоимости = Истина;

				ИначеЕсли  ТекСтрока.СуммаВыручкиОборот > 100 И Не ПроверкаНаПоЗаказу Тогда
					СтоимомостьРасчет = (Выборка.СтоимостьОстаток/ ВЫборка.КоличествоОстаток) * ТекСТрока.КоличествоОборот;
					СтоимомостьРасчетБезНДС = (Выборка.СтоимостьБезНДСОстаток/ ВЫборка.КоличествоОстаток) * ТекСТрока.КоличествоОборот;
					Движение = Движения.ВыручкаИСебестоимостьПродаж.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, ТекСтрока);
					Движение.Количество = 0;
					Движение.Период = Движение.Регистратор.Дата;
					Движение.СуммаВыручкиСНДСРегл = 0;
					Движение.СуммаВыручкиБезНДС = 0;
					Движение.СуммаВыручкиРегл = 0;
					Движение.СуммаВВалютеВзаиморасчетов = 0;
					Движение.СуммаВВалютеДокумента = 0;
					Движение.СуммаБезНДСВВалютеВзаиморасчетов = 0;
					Движение.СуммаБезНДСВВалютеДокумента = 0;
					Движение.Стоимость = ?(СтоимомостьРасчет>ТекСТрока.СуммаВыручкиОборот,ТекСТрока.СуммаВыручкиОборот/6,СтоимомостьРасчет);
					Движение.СтоимостьБезНДС = ?(СтоимомостьРасчетБезНДС>ТекСТрока.СуммаВыручкиБезНДСОборот,ТекСТрока.СуммаВыручкиБезНДСОборот/6,СтоимомостьРасчетБезНДС);;
					Движение.СтоимостьРегл = ?(СтоимомостьРасчетБезНДС>ТекСТрока.СуммаВыручкиБезНДСОборот,ТекСТрока.СуммаВыручкиБезНДСОборот/6,СтоимомостьРасчетБезНДС);
					Движение.РасчетСебестоимости = Истина;
				
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	
	
	

КонецПроцедуры


Функция ПроверитьПоЗаказу(Заказ)
Возврат Ложь;	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента КАК ЗаказКлиента,
	                      |	СУММА(ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот) КАК СтоимостьОборот
	                      |ИЗ
	                      |	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(, , , ЗаказКлиента = &Заказ) КАК ВыручкаИСебестоимостьПродажОбороты
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента");
	Запрос.УстановитьПараметр("Заказ",Заказ);
	Выборка =Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ?(Выборка.СтоимостьОборот >0, Истина, Ложь);	
	КонецЕсли;
КонецФункции