
&НаСервере
Функция ПолучитьМакетОбработки_Сервер(ИмяМакета)
	Обработка = РеквизитФормыВЗначение("Объект");
	АдресФайлаВХранилище = Обработка.APPLIX_RU_ПолучитьМакетОбработки(ИмяМакета);
	Возврат АдресФайлаВХранилище;
КонецФункции


Процедура ОбновитьРазделПомощи(Раздел, ТекстПодсказки)
	Если ЗначениеЗаполнено(Раздел) Тогда
		Попытка
			АдресФайла = ПолучитьМакетОбработки_Сервер("Макет_Помощь_"+Раздел);
			т = ПолучитьИзВременногоХранилища(АдресФайла);
			//т = ПолучитьМакет("Макет_Помощь_"+Раздел).ПолучитьТекст();
		Исключение
			Сообщить(ОписаниеОшибки());
			т = "";
		КонецПопытки;
	Иначе
		хтмл = Новый ФорматированныйДокумент;
		хтмл.Добавить(ТекстПодсказки);
		хтмл.ПолучитьHTML(т, Новый Структура());
	КонецЕсли;
	
	ТекстПомощиHTML = т;
	//Элементы.ТекстПомощиHTML..ПолеHTMLДокумента1.УстановитьТекст(т);
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Раздел = ПолучитьЗначениеСтруктуры(Параметры, "Раздел");
	ТекстПодсказки = ПолучитьЗначениеСтруктуры(Параметры, "ТекстПодсказки");
	Если ЗначениеЗаполнено(Раздел) или ЗначениеЗаполнено(ТекстПодсказки) Тогда
		ОбновитьРазделПомощи(Раздел, ТекстПодсказки);
	Иначе
		Отказ = Ложь;
	КонецЕсли;
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЗначениеСтруктуры(Стр, Имя, ЗначениеПоУмолчанию="")
	Попытка
		Зн = Стр[Имя];
	Исключение
	КонецПопытки;
	
	Если не ЗначениеЗаполнено(Зн) Тогда
		Зн = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Зн;
КонецФункции
