
&НаСервере
Процедура ОбновитьСписокНаСервере(ЗначенияДопРеквизитов = Неопределено)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Ссылка КАК НазваниеВЯМ
		|ИЗ
		|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
		|		ПО ЗначенияСвойствОбъектов.Ссылка = ПартнерыДополнительныеРеквизиты.Значение
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Владелец = &Владелец
		|	И ПартнерыДополнительныеРеквизиты.Ссылка ЕСТЬ NULL
		|	И ВЫБОР
		|			КОГДА &ОтбиратьПоРеквизитам
		|				ТОГДА ЗначенияСвойствОбъектов.Ссылка В (&ЗначенияДопРеквизитов)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
		
	НазваниеВЯМ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Название в ЯМ");
	Запрос.УстановитьПараметр("Владелец", НазваниеВЯМ);
	Запрос.УстановитьПараметр("ЗначенияДопРеквизитов", ЗначенияДопРеквизитов);
	Запрос.УстановитьПараметр("ОтбиратьПоРеквизитам", ?(ЗначенияДопРеквизитов = Неопределено,Ложь,Истина));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	ТаблицаСоотвествия.Загрузить(РезультатЗапроса);	
	

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ЗаписатьИзмененияЗавершениеФрагмент();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияНаСервере(Отказ)
	НачатьТранзакцию();
	НазваниеВЯМ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Название в ЯМ");	
	Для Каждого СтрокаСоотвествия из ТаблицаСоотвествия Цикл
		Если ЗначениеЗаполнено(СтрокаСоотвествия.НазваниеВЯМ)
			и ЗначениеЗаполнено(СтрокаСоотвествия.Клиент) Тогда
			
			КлиентОбъект 	= СтрокаСоотвествия.Клиент.ПолучитьОбъект();
			НовыйРеквизит 	= КлиентОбъект.ДополнительныеРеквизиты.Добавить();
			НовыйРеквизит.Свойство = НазваниеВЯМ;
			НовыйРеквизит.Значение = СтрокаСоотвествия.НазваниеВЯМ;
			КлиентОбъект.Записать();
			
		КонецЕсли;
	КонецЦикла;	
	
	Попытка
	
		ЗафиксироватьТранзакцию();
			
	Исключение
	    Отказ = Истина;
	КонецПопытки;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	Отказ = Ложь;
	ЗаписатьИзмененияНаСервере(Отказ);
	Если Не Отказ Тогда
	    ПоказатьПредупреждение(Новый ОписаниеОповещения("ЗаписатьИзмененияЗавершение", ЭтаФорма), "Данные записаны.");
	Иначе
	    ПоказатьПредупреждение(Неопределено, "Не удалось записать данные.");
		Если Параметры.Свойство("ПриЗаписиЗакрыть") Тогда 
			Закрыть(Ложь);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияЗавершение(ДополнительныеПараметры) Экспорт
	Если ПриЗаписиЗакрыть Тогда 
		Закрыть(Истина);
	Иначе	
		ЗаписатьИзмененияЗавершениеФрагмент();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияЗавершениеФрагмент()
	
	Перем ЗначенияДопРеквизитов;
	
	Если ЗначениеЗаполнено(СписокДопЗначений) Тогда
		ОбновитьСписокНаСервере(СписокДопЗначений);
	Иначе	
		ОбновитьСписокНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ЗначенияДопРеквизитов;
	
	Если Параметры.Свойство("ПриЗаписиЗакрыть") Тогда 
		ПриЗаписиЗакрыть = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("СписокДопЗначений", ЗначенияДопРеквизитов) Тогда
		СписокДопЗначений = ЗначенияДопРеквизитов;
		ОбновитьСписокНаСервере(ЗначенияДопРеквизитов);
	Иначе	
		ОбновитьСписокНаСервере();
	КонецЕсли;
КонецПроцедуры
