&НаКлиенте
Процедура ТаблицаДокументовДобавить(Кнопка)
Если Не Шаблон.Пустая() тогда		
ПараметрыПодбора=Новый Структура;
ПараметрыПодбора.Вставить("МножественныйВыбор", Истина);
ВидДокумента=ВидДокумента(Шаблон);
Подбор=Получитьформу("Документ."+ВидДокумента+".ФормаВыбора",ПараметрыПодбора,ЭтаФорма);
Подбор.ЗакрыватьПривыборе=Ложь;
//Подбор.МножественныйВыбор=Истина;
Подбор.ОткрытьМодально();	
Иначе
Сообщить("Не выбран шаблон");
Возврат;
КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидДокумента(Шаблон);
	ВидДокумента=Шаблон.ВидДокумента;
	Возврат ВидДокумента;
КонецФункции
	
	

&НаКлиенте
Процедура ТаблицаДокументовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
СтандартнаяОбработка=Ложь;
Если ЕстьДокументвТЧ(ВыбранноеЗначение.ТекущийЭлемент.ТекущаяСтрока) тогда
	Если Вопрос("Документ: "+ВыбранноеЗначение.ТекущийЭлемент.ТекущаяСтрока+" уже был добавлен в список. Добавить еще раз?",РежимДиалогаВопрос.ДаНет,0,КодВозвратаДиалога.Нет,КодВозвратаДиалога.Нет)=КодВозвратаДиалога.Нет тогда
	Иначе
	СтрокаТЧ = ТаблицаДокументов.Добавить();
	СтрокаТЧ.Документ = ВыбранноеЗначение.ТекущийЭлемент.ТекущаяСтрока;
	СтрокаТЧ.Шаблон = Шаблон;
	СтрокаТЧ.ТСД = ТСД;
	СтрокаТЧ.Комментарий = Комментарий;
	КонецЕсли;
Иначе	
СтрокаТЧ = ТаблицаДокументов.Добавить();
СтрокаТЧ.Документ = ВыбранноеЗначение.ТекущийЭлемент.ТекущаяСтрока;
СтрокаТЧ.Шаблон = Шаблон;
СтрокаТЧ.ТСД = ТСД;
СтрокаТЧ.Комментарий = Комментарий;
КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЕстьДокументвТЧ(Документ)
Возврат ТаблицаДокументов.НайтиСтроки(Новый Структура("Документ", Документ )).Количество() > 0; 
КонецФункции


&НаКлиенте
Процедура Выгрузить(Кнопка)
n= ТаблицаДокументов.Количество()-1;
Для i=0 по n цикл
ТекСтрока=ТаблицаДокументов.Получить(i);
ИсходныйДокумент=ТекСтрока.Документ;
Шаблон=ТекСтрока.Шаблон;
ТСД=ТекСтрока.ТСД;
Комментарий=ТекСтрока.Комментарий;
Если Вопрос("Документ: "+ТекСтрока.Документ+" уже выгружался на ТСД. Выгрузить еще раз?",РежимДиалогаВопрос.ДаНет,0,КодВозвратаДиалога.Нет,КодВозвратаДиалога.Нет)=КодВозвратаДиалога.Нет тогда
	Иначе
СоздатьДок (ИсходныйДокумент,Шаблон,ТСД,Комментарий);
КонецЕсли;
КонецЦикла;

ТаблицаДокументов.Очистить();
ФормаВыбора = ПолучитьФорму("Обработка.ДатаМобайл_АРМДиспетчера.Форма.Форма1"); 
ФормаВыбора.Закрыть()

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьДок (ИсходныйДокумент,Шаблон,ТСД,Комментарий)
	
НовыйДок=Справочники.ДатаМобайл_ДокументыТСД.СоздатьЭлемент();
НовыйДок.ИсходныйДокумент=ИсходныйДокумент;
НовыйДок.Шаблон=Шаблон;
НовыйДок.ТСД=ТСД;
НовыйДок.Комментарий=Комментарий;	
НовыйДок.Записать();

КонецПроцедуры
	


&НаСервереБезКонтекста
Функция УжеЕсть(лИсходныйДокумент)
	Если лИсходныйДокумент<>Неопределено тогда
		Если не лИсходныйДокумент.Пустая() тогда
			Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДатаМобайл_ДокументыТСД.Ссылка
			|ИЗ
			|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
			|ГДЕ
			|	ДатаМобайл_ДокументыТСД.ИсходныйДокумент = &ИсходныйДокумент");
			Запрос.УстановитьПараметр("ИсходныйДокумент",лИсходныйДокумент);
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() тогда
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	Возврат Ложь;
КонецФункции





