
&НаСервере
Процедура Справочники_СоздатьНоменклатуруПоставщика() 	 
	
	Если НЕ ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
		
	НоменклатураПоставщикаИмеетНесколькоСоответствий = Запись.ПрайсПартнера.НоменклатураПоставщикаИмеетНесколькоСоответствий;	
	
	Запрос = Новый Запрос();
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НоменклатураПоставщиков.Ссылка,
	|	НоменклатураПоставщиков.Номенклатура КАК Номенклатура,
	|	НоменклатураПоставщиков.Характеристика КАК ХарактеристикаНоменклатуры,
	|	НоменклатураПоставщиков.Упаковка
	|ИЗ
	|	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
	|ГДЕ
	|	НоменклатураПоставщиков.Номенклатура = &Номенклатура
	|	И НоменклатураПоставщиков.Характеристика = &Характеристика
	|	И НоменклатураПоставщиков.Владелец = &Партнер";  	 
	Если НоменклатураПоставщикаИмеетНесколькоСоответствий Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И НоменклатураПоставщиков.Идентификатор = &Поле_Идентификатор
		|	И НоменклатураПоставщиков.Артикул = &Поле_Артикул
		|	И НоменклатураПоставщиков.Наименование = &Поле_Наименование"; 
		
		Запрос.УстановитьПараметр("Поле_Идентификатор", Запись.Поле_Идентификатор);
		Запрос.УстановитьПараметр("Поле_Артикул", Запись.Поле_Артикул);
		Запрос.УстановитьПараметр("Поле_Наименование", Запись.Поле_Наименование);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Номенклатура", Запись.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Запись.ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("Партнер", Запись.ПрайсПартнера.Партнер);
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда				 
		НовыйЭлемент = Справочники.НоменклатураПоставщиков.СоздатьЭлемент();
		НовыйЭлемент.Владелец       = Запись.ПрайсПартнера.Партнер;
		НовыйЭлемент.Номенклатура   = Запись.Номенклатура;
		НовыйЭлемент.Характеристика = Запись.ХарактеристикаНоменклатуры;
		НовыйЭлемент.Наименование   = Запись.Поле_Наименование;
		Если ЗначениеЗаполнено(Запись.Поле_Артикул) Тогда
			НовыйЭлемент.Артикул = СокрЛП(Запись.Поле_Артикул);
		КонецЕсли;
		Если ЗначениеЗаполнено(Запись.Поле_Идентификатор) Тогда
			НовыйЭлемент.Идентификатор  = СокрЛП(Запись.Поле_Идентификатор);
		КонецЕсли;	
		НовыйЭлемент.УстановитьНовыйКод();
		НовыйЭлемент.ОбменДанными.Загрузка = Истина;
		НовыйЭлемент.Записать();
		Запись.НоменклатураПоставщика = НовыйЭлемент.Ссылка;
	Иначе			 
		Выборка  = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл				
			Если НоменклатураПоставщикаИмеетНесколькоСоответствий Тогда
				НовыйЭлемент = Справочники.НоменклатураПоставщиков.СоздатьЭлемент();
				НовыйЭлемент.УстановитьНовыйКод();
				ТекстСообщения = "Внимание! У товара "+Запись.Номенклатура+" - появился дубль номенклатуры поставщика";
			Иначе
				НовыйЭлемент = Выборка.Ссылка.ПолучитьОбъект();
				ТекстСообщения = "Был найден элемент Номенклатуры поставщика по товару "+Запись.Номенклатура+" - элемент обновлен новыми данными";
			КонецЕсли;
			НовыйЭлемент.Владелец       = Запись.ПрайсПартнера.Партнер;
			НовыйЭлемент.Номенклатура   = Запись.Номенклатура;
			НовыйЭлемент.Характеристика = Запись.ХарактеристикаНоменклатуры;
			НовыйЭлемент.Наименование   = Запись.Поле_Наименование;
			Если ЗначениеЗаполнено(Запись.Поле_Артикул) Тогда
				НовыйЭлемент.Артикул = СокрЛП(Запись.Поле_Артикул);
			КонецЕсли;
			Если ЗначениеЗаполнено(Запись.Поле_Идентификатор) Тогда
				НовыйЭлемент.Идентификатор  = СокрЛП(Запись.Поле_Идентификатор);
			КонецЕсли;	
			НовыйЭлемент.ОбменДанными.Загрузка = Истина;
			НовыйЭлемент.Записать();	
			Запись.НоменклатураПоставщика = НовыйЭлемент.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
КОнецПроцедуры


&НаКлиенте
Процедура СоздатьНоменклатуруПоставщика(Команда)
	
	Справочники_СоздатьНоменклатуруПоставщика();
	
КонецПроцедуры
