
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ВыполнитьЗагрузкуФайлов = Истина;
	Если НЕ ЗначениеЗаполнено(Объект.УчетнаяЗапись) Тогда
		Объект.УчетнаяЗапись = УправлениеЭлектроннойПочтой.ПолучитьУчетнуюЗаписьДляОтправкиПоУмолчанию();
	КонецЕсли;
	
	Объект.ОтборНовые = Истина;
	Объект.ОтборПрочитанные = Ложь;

КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
		
	ВыполнитьОбработкуСервер();
	
КонецПроцедуры



&НаСервере 
Процедура ВыполнитьОбработкуСервер()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыполнитьОбработку();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры


