
#Область ПрограммныйИнтерфейс

// Вызывается перед проверкой акцизной марки на уникальность.
//
// Параметры:
//  Форма - УправляемаяФорма - форма, в которой производится контроль,
//  Операция - Строка - содержит выполняемую операцию. В процедуре можно переопределить параметр.
//                      Возможные значения см. в описании АкцизныеМаркиЕГАИСПереопределяемый.ПроверитьУникальностьАкцизнойМарки().
//
Процедура ПриОпределенииОперацииКонтроляАкцизныхМарок(Форма, Операция) Экспорт
	
	//++ НЕ ЕГАИС
	Если Форма.ИмяФормы = "Документ.ЧекККМВозврат.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ЧекККМВозврат.Форма.ФормаДокументаРМК" Тогда
		Операция = "Возврат";
	КонецЕсли;
	//-- НЕ ЕГАИС
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти