
&НаКлиенте
Процедура ВыполнитьРобот(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьВопрос", ЭтотОбъект), НСтр("ru = 'Вы уверены?'"), РежимДиалогаВопрос.ДаНет);		
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;	
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	МегапрайсРобот.мегапрайсГенерацияПрайсовВыборка(ТекущиеДанные.Ссылка);
	
КонецПроцедуры
