

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьДанныеСправочникаНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	ЕстьИзменения = Ложь;
	ЕстьУдаленные = Ложь;
	Справочники.ИдентификаторыОбъектовМетаданных.ОбновитьДанныеСправочника(ЕстьИзменения, ЕстьУдаленные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодсистему(Команда)
	
	ОбновитьДанныеСправочникаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура мегапрайсКаталогВыгрузкиПрайсовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите путь'");
		
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		НаборКонстант.мегапрайсКаталогВыгрузкиПрайсов = ДиалогОткрытияФайла.Каталог;
	КонецЕсли;		

КонецПроцедуры


