
Функция ШаблонURLgetuser(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
    //Данные = Запрос.ПолучитьТелоКакСтроку(); 
	
	//ХранилищеСтрока = XMLЗначение(Тип("ХранилищеЗначения"), Данные);
	//Данные 			= ХранилищеСтрока.Получить();
//ТекстДок = Новый ТекстовыйДокумент;

	Пароль       = Запрос.Заголовки["Password"];  		
	
	result = "ok";

Попытка
	ДанныеСтрока      = мпПредметныйСервер.ПолучитьФизлицоДляМП(Пароль);
		
Исключение
//	ТекстДок.ДобавитьСтроку(ЛицевойСчет); 
//	ТекстДок.ДобавитьСтроку(ОписаниеОшибки());
//	ТекстДок.Записать("c:\temp\111.txt");
	
	result = "error";
	Ответ.Заголовки.Вставить("texterror", ОписаниеОшибки());
	
КонецПопытки;	
	
	Ответ.Заголовки.Вставить("result",result);
	Ответ.УстановитьТелоИзСтроки(ДанныеСтрока);
	
	
	Возврат Ответ;

КонецФункции
