
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВыручкаИСебестоимостьПродаж.Записывать = Истина;

	Для Каждого Стр Из Товары Цикл
				
		СтруктураАналитикиН = Новый Структура("Номенклатура, Характеристика, Серия, Склад",
		Стр.Номенклатура,Стр.Характеристика,Справочники.СерииНоменклатуры.ПустаяСсылка(),Склад);
		
		КлючАналитикаН = РегистрыСведений.АналитикаУчетаНоменклатуры.ЗначениеКлючаАналитики(СтруктураАналитикиН);
		
		СтруктураАналитикиП = Новый Структура("Организация, Партнер, Контрагент",
		Организация,Стр.Партнер,Стр.Контрагент);
		
        КлючАналитикиК = РегистрыСведений.АналитикаУчетаПоПартнерам.ЗначениеКлючаАналитики(СтруктураАналитикиП);
			
		Движение = Движения.ВыручкаИСебестоимостьПродаж.Добавить();
		Движение.Период     = ДатаПродаж;
		Движение.АналитикаУчетаНоменклатуры = КлючАналитикаН;
		Движение.АналитикаУчетаПоПартнерам = КлючАналитикиК;
		Движение.ВидЗапасов = Справочники.ВидыЗапасов.ВидЗапасовДокумента(Организация,Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);
		Движение.ТипЗапасов = Перечисления.ТипыЗапасов.Товар;
		Движение.Регистратор = Ссылка;
		
		Если Стр.Количество > 0 Тогда
			Движение.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
		Иначе
			Движение.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента;
		КОнецЕсли;
		
		Движение.Количество    = Стр.Количество;
		Движение.СуммаВыручки  = Стр.СуммаВыручки; 
		Движение.Себестоимость = Стр.Себестоимость; 
		
	КонецЦикла;
	
	Движения.Записать();
	
КОнецПроцедуры