&НаСервереБезКонтекста
Функция ПолучитьПустыеСсылки(лШаблон)
	Ответ=Новый Структура("Старый,Новый,Создавать");
	Ответ.Старый=Документы[лШаблон.ВидДокумента].Пустаяссылка();
	Ответ.Новый=Ответ.Старый;
	Если СокрЛП(лШаблон.ВидДокументаНового)<>"" тогда
		Ответ.Новый=Документы[лШаблон.ВидДокументаНового].Пустаяссылка();
		Ответ.Создавать=Истина;
	Иначе	
		Ответ.Создавать=Ложь;
	КонецЕсли;	
	Возврат Ответ;
КонецФункции	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ИсходныйДокумент.ТолькоПросмотр=Объект.Шаблон.Пустая();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ИсходныйДокумент=Неопределено тогда
		Если Не Объект.Шаблон.Пустая() тогда
			Объект.ИсходныйДокумент=Документы[Объект.Шаблон.ВидДокумента].Пустаяссылка();
		КонецЕсли;	
	КонецЕсли;	
	Если СокрЛП(Объект.Шаблон.ВидДокументаНового)="" тогда//старая схема
		Элементы.НовыйДокумент.ТолькоПросмотр=Истина;
	Иначе	
		Элементы.НовыйДокумент.ТолькоПросмотр=Ложь;
		Если Объект.НовыйДокумент=Неопределено тогда
			Если Не Объект.Шаблон.Пустая() тогда
				Объект.НовыйДокумент=Документы[Объект.Шаблон.ВидДокументаНового].Пустаяссылка();
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)
	Если Не Объект.Шаблон.Пустая() тогда
		ПустыеСсылки=ПолучитьПустыеСсылки(Объект.Шаблон);
		Если ТипЗнч(Объект.ИсходныйДокумент)<>ТипЗнч(ПустыеСсылки.Старый) тогда
			Объект.ИсходныйДокумент=ПустыеСсылки.Старый;
			Элементы.ИсходныйДокумент.ВыбиратьТип=Ложь;
		КонецЕсли;	
		Если ТипЗнч(Объект.НовыйДокумент)<>ТипЗнч(ПустыеСсылки.Новый) тогда
			Объект.НовыйДокумент=ПустыеСсылки.Новый;
			Элементы.НовыйДокумент.ВыбиратьТип=Ложь;
		КонецЕсли;	
		Элементы.НовыйДокумент.ТолькоПросмотр=Не ПустыеСсылки.Создавать;
	Иначе	
		Объект.ИсходныйДокумент=Неопределено;
		Объект.НовыйДокумент=Неопределено;
		Элементы.ИсходныйДокумент.ВыбиратьТип=Истина;
		Элементы.НовыйДокумент.ВыбиратьТип=Истина;
		Элементы.НовыйДокумент.ТолькоПросмотр=Ложь;
	КонецЕсли;	
	Элементы.ИсходныйДокумент.ТолькоПросмотр=Объект.Шаблон.Пустая();
КонецПроцедуры

&НаСервереБезКонтекста
Функция УжеЕсть(лСсылка,лИсходныйДокумент)
	Если лИсходныйДокумент<>Неопределено тогда
		Если не лИсходныйДокумент.Пустая() тогда
			Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДатаМобайл_ДокументыТСД.Ссылка
			|ИЗ
			|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
			|ГДЕ
			|	ДатаМобайл_ДокументыТСД.ИсходныйДокумент = &ИсходныйДокумент
			|	И ДатаМобайл_ДокументыТСД.Ссылка <> &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",лСсылка);
			Запрос.УстановитьПараметр("ИсходныйДокумент",лИсходныйДокумент);
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() тогда
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если УжеЕсть(Объект.Ссылка,Объект.ИсходныйДокумент) тогда
		Если Вопрос("Для документа "+Объект.ИсходныйДокумент+" уже создан документ ТСД. Продолжить?",РежимДиалогаВопрос.ДаНет,10,КодВозвратаДиалога.Нет,КодВозвратаДиалога.Нет)=КодВозвратаДиалога.Нет тогда
			Отказ=Истина;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаИзображениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Выбрать();

	Если Диалог.ПолноеИмяФайла <> "" Тогда
		Объект.СсылкаНаИзображение = Диалог.ПолноеИмяФайла;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаИзображениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	ЗапуститьПриложение(Объект.СсылкаНаИзображение);

КонецПроцедуры

&НаКлиенте
Процедура СобранныеДанныеПриемкаСсылкаНаИзображениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Выбрать();

	Если Диалог.ПолноеИмяФайла <> "" Тогда
		Элементы.СобранныеДанныеПриемка.ТекущиеДанные.СсылкаНаИзображение = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СобранныеДанныеПриемкаСсылкаНаИзображениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	ЗапуститьПриложение(Элементы.СобранныеДанныеПриемка.ТекущиеДанные.СсылкаНаИзображение);
	
КонецПроцедуры

&НаКлиенте
Процедура СобранныеДанныеПодборСсылкаНаИзображениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Выбрать();

	Если Диалог.ПолноеИмяФайла <> "" Тогда
		Элементы.СобранныеДанныеПодбор.ТекущиеДанные.СсылкаНаИзображение = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СобранныеДанныеПодборСсылкаНаИзображениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	ЗапуститьПриложение(Элементы.СобранныеДанныеПодбор.ТекущиеДанные.СсылкаНаИзображение);
	
КонецПроцедуры
