

&НаСервере
Процедура ЗаполнитьАлгоритмы()
	
	//Макет = ОбработкаОбъект.ПолучитьМакет("АлгоритмыКлючевыхСлов");
	//	
	//Область = Макет.ПолучитьОбласть("ТекстыАлгоритмов");
	//
	//ВсегоСтрок = Область.ВысотаТаблицы + 1;
	//ТекущаяСтрока = 1;
	//
	//Объект.АлгоритмыКлючевыхСлов.Очистить();
	//
	//Пока ТекущаяСтрока < ВсегоСтрок Цикл
	//	
	//	мСтрока = "R" + Формат(ТекущаяСтрока,"ЧДЦ=0; ЧГ=");
	//	
	//	Представление  = Область.ПолучитьОбласть(мСтрока + "C1").ТекущаяОбласть.Текст;
	//	ТекстАлгоритма = Область.ПолучитьОбласть(мСтрока + "C2").ТекущаяОбласть.Текст;
	//	
	//	Если ПустаяСтрока(Представление) Тогда
	//		ТекущаяСтрока = ТекущаяСтрока + 1;		
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	НоваяСтрока = Объект.АлгоритмыКлючевыхСлов.Добавить();
	//	НоваяСтрока.Представление  = Представление;
	//	НоваяСтрока.ТекстАлгоритма = ТекстАлгоритма;
	//	
	//	ТекущаяСтрока = ТекущаяСтрока + 1;			
	//КонецЦикла;
		
Конецпроцедуры
