Функция ПолучитьПочтовыйАдресМенеджера(Менеджер)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПользователиКонтактнаяИнформация.Представление КАК Почта
	|ИЗ
	|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|ГДЕ
	|	ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя)
	|	И ПользователиКонтактнаяИнформация.Ссылка =&Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Менеджер);
	
	Результат =  Запрос.Выполнить();		
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Почта;
	КонецЕсли;	
	
	Возврат "";	
	
КонецФункции

Процедура ОтправитьУведомлениеМенеджеруПоЗадачеПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.Ссылка.Пустая() Тогда   	
		
		// если новая задача, отправим на почту уведомление менеджеру
		АдресЭлектроннойПочты = ПолучитьПочтовыйАдресМенеджера(Источник.Исполнитель);
		
		Если  ПустаяСтрока(АдресЭлектроннойПочты) Тогда
			Возврат;
		КонецЕсли;	
		
		ПараметрыПисьма = Новый Структура;
		
	    ТелоПисьма = "У вас новая задача " + СокрЛП(Источник.Наименование) + " от " + Формат(Источник.Дата, "ДФ=dd.MM.yyyy") + Символы.ПС + 
		"Предмет задачи:" + Строка(Источник.Предмет) + Символы.ПС + 
		"Автор задачи: " + Источник.Автор  + Символы.ПС + 
		"Текст задания: " + СокрЛП(Источник.Описание);
				
		
		ПараметрыПисьма.Вставить("Кому", АдресЭлектроннойПочты);
		ПараметрыПисьма.Вставить("Тема", "Задача: " + СокрЛП(Источник.Наименование));
		ПараметрыПисьма.Вставить("Тело", ТелоПисьма);
		
		УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
		
		Попытка
			РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
		Исключение
			ЗаписьЖурналаРегистрации("Уведомление о задаче",УровеньЖурналаРегистрации.Ошибка, ,,"Уведомление о задаче менеджера" + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;	
	
КонецПроцедуры


Процедура ИсправлениеТоваровБезГТД() Экспорт
	//ПРФТ++
	//ПРФТ++
Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
                      |	Сегменты.Номенклатура КАК Номенклатура,
                      |	Сегменты.Характеристика КАК Характеристика,
                      |	ИСТИНА КАК ИспользуетсяОтборПоСегментуНоменклатуры
                      |ПОМЕСТИТЬ ОтборПоСегментуНоменклатуры
                      |ИЗ
                      |	РегистрСведений.НоменклатураСегмента КАК Сегменты
                      |{ГДЕ
                      |	Сегменты.Сегмент.* КАК СегментНоменклатуры,
                      |	Сегменты.Номенклатура.* КАК Номенклатура,
                      |	Сегменты.Характеристика.* КАК Характеристика}
                      |
                      |ИНДЕКСИРОВАТЬ ПО
                      |	Номенклатура,
                      |	Характеристика,
                      |	ИспользуетсяОтборПоСегментуНоменклатуры
                      |;
                      |
                      |////////////////////////////////////////////////////////////////////////////////
                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
                      |	Организации.Ссылка КАК Организация,
                      |	Склады.Ссылка КАК Склад,
                      |	ВЫБОР
                      |		КОГДА НЕ ПримененияЕНВД.РозничнаяТорговляОблагаетсяЕНВД ЕСТЬ NULL
                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА СпрУчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Упрощенная)
                      |					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
                      |				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
                      |			КОНЕЦ
                      |	КОНЕЦ КАК НалогообложениеНДС
                      |ПОМЕСТИТЬ СистемыНалогообложения
                      |ИЗ
                      |	Справочник.Организации КАК Организации
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
                      |		ПО (ИСТИНА)
                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних({(&КонецПериода)}, ) КАК УчетныеПолитики
                      |		ПО (УчетныеПолитики.Организация = Организации.Ссылка)
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетныеПолитикиОрганизаций КАК СпрУчетнаяПолитика
                      |		ПО (УчетныеПолитики.УчетнаяПолитика = СпрУчетнаяПолитика.Ссылка)
                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПримененияЕНВД.СрезПоследних({(&КонецПериода)}, ) КАК ПримененияЕНВД
                      |		ПО Организации.Ссылка = ПримененияЕНВД.Организация
                      |			И (Склады.Ссылка = ПримененияЕНВД.Склад)
                      |			И (ПримененияЕНВД.РозничнаяТорговляОблагаетсяЕНВД)
                      |;
                      |
                      |////////////////////////////////////////////////////////////////////////////////
                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
                      |	АналитикаНоменклатуры.Номенклатура КАК Номенклатура,
                      |	АналитикаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
                      |	АналитикаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
                      |	АналитикаНоменклатуры.Характеристика КАК Характеристика,
                      |	АналитикаНоменклатуры.Серия КАК Серия,
                      |	АналитикаНоменклатуры.Назначение КАК Назначение,
                      |	ВЫРАЗИТЬ(АналитикаНоменклатуры.Склад КАК Справочник.Склады) КАК Склад,
                      |	ТоварыОрганизаций.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
                      |	ТоварыОрганизаций.НомерГТД КАК НомерГТД,
                      |	ТоварыОрганизаций.НомерГТД.СтранаПроисхождения КАК СтранаПроисхождения,
                      |	ТоварыОрганизаций.ВидЗапасов КАК ВидЗапасов,
                      |	ТоварыОрганизаций.ВидЗапасов.ТипЗапасов КАК ТипЗапасов,
                      |	ТоварыОрганизаций.ВидЗапасов.ВладелецТовара КАК Комитент,
                      |	ТоварыОрганизаций.ВидЗапасов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
                      |	ТоварыОрганизаций.Организация КАК Организация,
                      |	ТоварыОрганизаций.Организация КАК ОрганизацияПродавец,
                      |	ВЫБОР
                      |		КОГДА ТоварыОрганизаций.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
                      |				И ТоварыОрганизаций.ВидЗапасов.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
                      |			ТОГДА ТоварыОрганизаций.ВидЗапасов.НалогообложениеНДС
                      |		ИНАЧЕ ЕСТЬNULL(СистемыНалогообложения.НалогообложениеНДС, ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС))
                      |	КОНЕЦ КАК НалогообложениеНДС,
                      |	ЛОЖЬ КАК ЗапасыДругойОрганизации,
                      |	ВЫБОР
                      |		КОГДА &ЕдиницыКоличества = 0
                      |			ТОГДА ТоварыОрганизаций.КоличествоНачальныйОстаток
                      |		КОГДА &ЕдиницыКоличества = 1
                      |			ТОГДА ВЫБОР
                      |					КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0
                      |						ТОГДА ТоварыОрганизаций.КоличествоНачальныйОстаток / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
                      |					ИНАЧЕ 0
                      |				КОНЕЦ
                      |	КОНЕЦ КАК КоличествоНачальныйОстаток,
                      |	ВЫБОР
                      |		КОГДА &ЕдиницыКоличества = 0
                      |			ТОГДА ТоварыОрганизаций.КоличествоКонечныйОстаток
                      |		КОГДА &ЕдиницыКоличества = 1
                      |			ТОГДА ВЫБОР
                      |					КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0
                      |						ТОГДА ТоварыОрганизаций.КоличествоКонечныйОстаток / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
                      |					ИНАЧЕ 0
                      |				КОНЕЦ
                      |	КОНЕЦ КАК КоличествоОстаток,
                      |	ВЫБОР
                      |		КОГДА &ЕдиницыКоличества = 0
                      |			ТОГДА ТоварыОрганизаций.КоличествоКонечныйОстаток
                      |		КОГДА &ЕдиницыКоличества = 1
                      |			ТОГДА ВЫБОР
                      |					КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0
                      |						ТОГДА ТоварыОрганизаций.КоличествоКонечныйОстаток / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
                      |					ИНАЧЕ 0
                      |				КОНЕЦ
                      |	КОНЕЦ КАК ОстатокОрганизацииПродавца,
                      |	ВЫБОР
                      |		КОГДА &ЕдиницыКоличества = 0
                      |			ТОГДА ТоварыОрганизаций.КоличествоПриход
                      |		КОГДА &ЕдиницыКоличества = 1
                      |			ТОГДА ВЫБОР
                      |					КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0
                      |						ТОГДА ТоварыОрганизаций.КоличествоПриход / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
                      |					ИНАЧЕ 0
                      |				КОНЕЦ
                      |	КОНЕЦ КАК КоличествоПриход,
                      |	ВЫБОР
                      |		КОГДА &ЕдиницыКоличества = 0
                      |			ТОГДА ТоварыОрганизаций.КоличествоРасход
                      |		КОГДА &ЕдиницыКоличества = 1
                      |			ТОГДА ВЫБОР
                      |					КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0
                      |						ТОГДА ТоварыОрганизаций.КоличествоРасход / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
                      |					ИНАЧЕ 0
                      |				КОНЕЦ
                      |	КОНЕЦ КАК КоличествоРасход
                      |ИЗ
                      |	РегистрНакопления.ТоварыОрганизаций.ОстаткиИОбороты(, &ПЕриод, Авто, , НомерГТД = &НомерГТД) КАК ТоварыОрганизаций
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаНоменклатуры
                      |		ПО ТоварыОрганизаций.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.КлючАналитики
                      |			И (АналитикаНоменклатуры.Склад ССЫЛКА Справочник.Склады)
                      |		ЛЕВОЕ СОЕДИНЕНИЕ СистемыНалогообложения КАК СистемыНалогообложения
                      |		ПО ТоварыОрганизаций.Организация = СистемыНалогообложения.Организация
                      |			И (АналитикаНоменклатуры.Склад = СистемыНалогообложения.Склад)
                      |{ГДЕ
                      |	АналитикаНоменклатуры.Номенклатура.* КАК Номенклатура,
                      |	АналитикаНоменклатуры.Характеристика.* КАК Характеристика,
                      |	(ВЫРАЗИТЬ(АналитикаНоменклатуры.Склад КАК Справочник.Склады)).* КАК Склад,
                      |	((АналитикаНоменклатуры.Номенклатура, АналитикаНоменклатуры.Характеристика) В
                      |			(ВЫБРАТЬ
                      |				ОтборПоСегментуНоменклатуры.Номенклатура,
                      |				ОтборПоСегментуНоменклатуры.Характеристика
                      |			ИЗ
                      |				ОтборПоСегментуНоменклатуры
                      |			ГДЕ
                      |				ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)) КАК Поле2}
                      |
                      |ОБЪЕДИНИТЬ ВСЕ
                      |
                      |ВЫБРАТЬ
                      |	АналитикаНоменклатуры.Номенклатура,
                      |	АналитикаНоменклатуры.Номенклатура.ЕдиницаИзмерения,
                      |	АналитикаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов,
                      |	АналитикаНоменклатуры.Характеристика,
                      |	АналитикаНоменклатуры.Серия,
                      |	АналитикаНоменклатуры.Назначение,
                      |	ВЫРАЗИТЬ(АналитикаНоменклатуры.Склад КАК Справочник.Склады),
                      |	ТоварыОрганизаций.АналитикаУчетаНоменклатуры,
                      |	ТоварыОрганизаций.НомерГТД,
                      |	ТоварыОрганизаций.НомерГТД.СтранаПроисхождения,
                      |	ТоварыОрганизаций.ВидЗапасов,
                      |	ТоварыОрганизаций.ВидЗапасов.ТипЗапасов,
                      |	ТоварыОрганизаций.ВидЗапасов.ВладелецТовара,
                      |	ТоварыОрганизаций.ВидЗапасов.ГруппаФинансовогоУчета,
                      |	ТоварыОрганизаций.Организация,
                      |	ТоварыОрганизаций.Организация,
                      |	ВЫБОР
                      |		КОГДА ТоварыОрганизаций.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
                      |				И ТоварыОрганизаций.ВидЗапасов.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
                      |			ТОГДА ТоварыОрганизаций.ВидЗапасов.НалогообложениеНДС
                      |		ИНАЧЕ ЕСТЬNULL(СистемыНалогообложения.НалогообложениеНДС, ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС))
                      |	КОНЕЦ,
                      |	ЛОЖЬ,
                      |	ВЫБОР
                      |		КОГДА &ЕдиницыКоличества = 0
                      |			ТОГДА ТоварыОрганизаций.КоличествоНачальныйОстаток
                      |		КОГДА &ЕдиницыКоличества = 1
                      |			ТОГДА ВЫБОР
                      |					КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0
                      |						ТОГДА ТоварыОрганизаций.КоличествоНачальныйОстаток / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
                      |					ИНАЧЕ 0
                      |				КОНЕЦ
                      |	КОНЕЦ,
                      |	ВЫБОР
                      |		КОГДА &ЕдиницыКоличества = 0
                      |			ТОГДА ТоварыОрганизаций.КоличествоКонечныйОстаток
                      |		КОГДА &ЕдиницыКоличества = 1
                      |			ТОГДА ВЫБОР
                      |					КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0
                      |						ТОГДА ТоварыОрганизаций.КоличествоКонечныйОстаток / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
                      |					ИНАЧЕ 0
                      |				КОНЕЦ
                      |	КОНЕЦ,
                      |	ВЫБОР
                      |		КОГДА &ЕдиницыКоличества = 0
                      |			ТОГДА ТоварыОрганизаций.КоличествоКонечныйОстаток
                      |		КОГДА &ЕдиницыКоличества = 1
                      |			ТОГДА ВЫБОР
                      |					КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0
                      |						ТОГДА ТоварыОрганизаций.КоличествоКонечныйОстаток / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
                      |					ИНАЧЕ 0
                      |				КОНЕЦ
                      |	КОНЕЦ,
                      |	ВЫБОР
                      |		КОГДА &ЕдиницыКоличества = 0
                      |			ТОГДА ТоварыОрганизаций.КоличествоПриход
                      |		КОГДА &ЕдиницыКоличества = 1
                      |			ТОГДА ВЫБОР
                      |					КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0
                      |						ТОГДА ТоварыОрганизаций.КоличествоПриход / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
                      |					ИНАЧЕ 0
                      |				КОНЕЦ
                      |	КОНЕЦ,
                      |	ВЫБОР
                      |		КОГДА &ЕдиницыКоличества = 0
                      |			ТОГДА ТоварыОрганизаций.КоличествоРасход
                      |		КОГДА &ЕдиницыКоличества = 1
                      |			ТОГДА ВЫБОР
                      |					КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0
                      |						ТОГДА ТоварыОрганизаций.КоличествоРасход / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
                      |					ИНАЧЕ 0
                      |				КОНЕЦ
                      |	КОНЕЦ
                      |ИЗ
                      |	РегистрНакопления.РезервыТоваровОрганизаций.ОстаткиИОбороты(, &ПЕриод, Авто, , НомерГТД = &НомерГТД) КАК ТоварыОрганизаций
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаНоменклатуры
                      |		ПО ТоварыОрганизаций.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.КлючАналитики
                      |			И (АналитикаНоменклатуры.Склад ССЫЛКА Справочник.Склады)
                      |		ЛЕВОЕ СОЕДИНЕНИЕ СистемыНалогообложения КАК СистемыНалогообложения
                      |		ПО ТоварыОрганизаций.Организация = СистемыНалогообложения.Организация
                      |			И (АналитикаНоменклатуры.Склад = СистемыНалогообложения.Склад)
                      |{ГДЕ
                      |	АналитикаНоменклатуры.Номенклатура.* КАК Номенклатура,
                      |	АналитикаНоменклатуры.Характеристика.* КАК Характеристика,
                      |	(ВЫРАЗИТЬ(АналитикаНоменклатуры.Склад КАК Справочник.Склады)).* КАК Склад,
                      |	((АналитикаНоменклатуры.Номенклатура, АналитикаНоменклатуры.Характеристика) В
                      |			(ВЫБРАТЬ
                      |				ОтборПоСегментуНоменклатуры.Номенклатура,
                      |				ОтборПоСегментуНоменклатуры.Характеристика
                      |			ИЗ
                      |				ОтборПоСегментуНоменклатуры
                      |			ГДЕ
                      |				ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)) КАК Поле2}
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	Организация");
	Запрос.УстановитьПараметр("НомерГТД", Справочники.НомераГТД.ПустаяСсылка());
	ЗАпрос.УстановитьПараметр("Период",КонецДня(ТекущаяДата()));
	ЗАпрос.УстановитьПараметр("ЕдиницыКоличества",0);
	//Запрос.УстановитьПараметр("Склад",Справочники.Склады.НайтиПоНаименованию("Склад бракованной продукции"));
	Выборка = Запрос.Выполнить().Выбрать();
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 Тогда Возврат; КонецЕсли;
	Если Рез.Итог("КоличествоОстаток") = 0 Тогда Возврат; КонецЕсли;
	ДокументКорректировкиЗаписейРегистров = Документы.КорректировкаРегистров.СоздатьДокумент();
	ДокументКорректировкиЗаписейРегистров.Дата = НачалоДня(ТекущаяДата());
	ДокументКорректировкиЗаписейРегистров.Комментарий = "Исправление пустых ГТД";	
	
	НоваяСтрокаРег = ДокументКорректировкиЗаписейРегистров.ТаблицаРегистров.Добавить();
	НоваяСтрокаРег.Имя = "ТоварыОрганизаций";
	//НоваяСтрокаРег.Представление = "ТоварыОрганизаций";
	
	ДокументКорректировкиЗаписейРегистров.Записать();
	
	НаборЗаписейНЗП = ДокументКорректировкиЗаписейРегистров.Движения.ТоварыОрганизаций;
	НаборЗаписейНЗП.Очистить();
	
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.НомерГТД) Тогда Продолжить; КонецЕсли;
		Если Выборка.КоличествоОстаток = 0 Тогда Продолжить; КонецЕсли;

		Если Выборка.КоличествоОстаток>0 Тогда
			НоваяЗапись = НаборЗаписейНЗП.Добавить();
			НоваяЗапись.Активность = Истина;
			НоваяЗапись.Период =  НачалоДня(ТекущаяДата());
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.Количество = Выборка.КоличествоОстаток;
		Иначе
			НоваяЗапись = НаборЗаписейНЗП.Добавить();
			НоваяЗапись.Активность = Истина;
			НоваяЗапись.Период =  НачалоДня(ТекущаяДата());
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.Количество = Выборка.КоличествоОстаток*(-1);
		КонецЕсли;
		
		
		ЗапросПлюс = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                          |	ПриобретениеТоваровУслугТовары.Ссылка КАК Ссылка,
		                          |	ПриобретениеТоваровУслугТовары.НомерГТД КАК НомерГТД,
		                          |	ПриобретениеТоваровУслугТовары.Ссылка.Дата КАК Дата
		                          |ИЗ
		                          |	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		                          |ГДЕ
		                          |	ПриобретениеТоваровУслугТовары.Номенклатура = &Номенклатура
		                          |	И ПриобретениеТоваровУслугТовары.Характеристика = &Характеристика
		                          |	И НЕ ПриобретениеТоваровУслугТовары.НомерГТД = &НомерГТД
		                          |	И ПриобретениеТоваровУслугТовары.Ссылка.Проведен
		                          |
		                          |УПОРЯДОЧИТЬ ПО
								  |	Дата УБЫВ");
								  ЗапросПлюс.УстановитьПараметр("НомерГТД",Справочники.НомераГТД.ПустаяСсылка());
								  ЗапросПлюс.УстановитьПараметр("Номенклатура",Выборка.Номенклатура);
								  ЗапросПлюс.УстановитьПараметр("Характеристика",Выборка.Характеристика);

		ВыборкаПлюс = ЗапросПлюс.Выполнить().Выбрать();
		Если ВыборкаПлюс.Следующий() Тогда
			
			Если Выборка.КоличествоОстаток>0 Тогда
				НоваяЗапись = НаборЗаписейНЗП.Добавить();
				НоваяЗапись.Активность = Истина;
				НоваяЗапись.Период =  НачалоДня(ТекущаяДата());
				НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
				НоваяЗапись.Количество = Выборка.КоличествоОстаток ;
				НоваяЗапись.НомерГТД = ВыборкаПлюс.НомерГТД;		
			Иначе
				НоваяЗапись = НаборЗаписейНЗП.Добавить();
				НоваяЗапись.Активность = Истина;
				НоваяЗапись.Период =  НачалоДня(ТекущаяДата());
				НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
				НоваяЗапись.Количество = Выборка.КоличествоОстаток*(-1) ;
				НоваяЗапись.НомерГТД = ВыборкаПлюс.НомерГТД;	
			КонецЕсли;
		КонецЕсли;
		
		
	КонецЦикла;
	
	НаборЗаписейНЗП.Записать();
	
	



	
	

КонецПроцедуры

