


Функция ШаблонURLgetreference(Запрос)
	
	 Ответ = Новый HTTPСервисОтвет(200);
	
    //Данные = Запрос.ПолучитьТелоКакСтроку(); 
	
	//ХранилищеСтрока = XMLЗначение(Тип("ХранилищеЗначения"), Данные);
	//Данные 			= ХранилищеСтрока.Получить();
//ТекстДок = Новый ТекстовыйДокумент;
Попытка
	Пароль       = Запрос.Заголовки["Password"];  		
	ДатаДень  = Запрос.Заголовки["DateDay"];
	ДатаМесяц = Запрос.Заголовки["DateMonth"];
	ДатаГод   = Запрос.Заголовки["DateYear"];
	
	result = "ok";


	ДанныеСтрока      = мпПредметныйСервер.ПолучитьДанныеПоСправочникам(Пароль, ДатаДень, ДатаМесяц, ДатаГод);
	
Исключение
	//ТекстДок.ДобавитьСтроку(Пароль);
	//ТекстДок.ДобавитьСтроку(ДатаДень);
	//ТекстДок.ДобавитьСтроку(ДатаМесяц);
	//ТекстДок.ДобавитьСтроку(ДатаГод);
	////ТекстДок.ДобавитьСтроку(ОписаниеОшибки());
	//ТекстДок.Записать("C:\winsrv\piteyniysrv\111.txt");
	result = "error";
	ДанныеСтрока = мпОбщегоНазначения.ДанныеПереводимВСтроку(ОписаниеОшибки());
	Ответ.Заголовки.Вставить("texterror", ДанныеСтрока);
//ТекстДок = Новый ТекстовыйДокумент;
//ТекстДок.ДобавитьСтроку(ОписаниеОшибки());
//ТекстДок.Записать("C:\winsrv\piteyniysrv\111.txt");
	
КонецПопытки;	
	
	Ответ.Заголовки.Вставить("result",result);
	Ответ.УстановитьТелоИзСтроки(ДанныеСтрока);
	
	
	Возврат Ответ;
	
КонецФункции
