
&НаКлиенте
Процедура КомандаОткрытьЗагрузку(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПрайсПартнера", ТекущиеДанные.Ссылка);

	ОткрытьФорму("Обработка.мегапрайсРасширеннаяЗагрузкаИзExcel.Форма.Форма",СтруктураПараметров,ЭтаФорма);
	
КонецПроцедуры


&НаСервере
Процедура УдалитьДанныеПрайсаНаСервере(ПрайсПартнера)
	
	НаборЗаписей = РегистрыСведений.мегапрайсЦеныНоменклатурыПоставщиков.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ПрайсПартнера.Установить(ПрайсПартнера);
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьДанныеПрайса(Команда)
	
	#Если Клиент Тогда
		 Ответ = Вопрос("Вы уверены что хотите удалить все данные?", РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет, "Дополнительный вопрос");		
		 Если Ответ <> КодВозвратаДиалога.Да Тогда
			 Возврат;
		 КонецЕсли;
	 #КонецЕсли

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;

	УдалитьДанныеПрайсаНаСервере(ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
КонецПроцедуры



&НаКлиенте
Процедура ВыполнитьРобот(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьВопрос", ЭтотОбъект), НСтр("ru = 'Вы уверены?'"), РежимДиалогаВопрос.ДаНет);	
		
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;	
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	МегапрайсРобот.мегапрайсИмпортЗагрузкаПрайсовВыборка(ТекущиеДанные.Ссылка);
	
КонецПроцедуры


