
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	RGB = ГАЛ_ДополнительныеФункцииСервер.ПолучитьАбсолютныйЦвет(НашЦвет);
	Объект.R = RGB.Красный;
	Объект.G = RGB.Зеленый;
	Объект.B = RGB.Синий;
	//Объект.ЗначениеЦвета = RGB;
КонецПроцедуры

//&НаСервере
//Функция ПолучитьАбсолютныйЦвет(ИсходныйЦвет) Экспорт
//	
//	
//	
//	Если ИсходныйЦвет.Вид = ВидЦвета.Абсолютный Тогда
//		Возврат ИсходныйЦвет;
//	КонецЕсли;
//	
//	ТабДок = Новый ТабличныйДокумент;
//	ТабДок.Область("R1C1").ЦветФона = ИсходныйЦвет;
//	Каталог = КаталогВременныхФайлов();
//	ТабДок.Записать(Каталог + "ПреобразованиеЦвета.mxl", ТипФайлаТабличногоДокумента.MXL7);
//	ТабДок.Прочитать(Каталог + "ПреобразованиеЦвета.mxl");
//	
//	АЦвет = ТабДок.Область("R1C1").ЦветФона;
//	
//	Возврат АЦвет;

//КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	ТекЦвет = Новый Цвет(Объект.R,Объект.G,Объект.B);
	НашЦвет = ТекЦвет;
КонецПроцедуры

&НаСервере
Функция  ЗначениеЦветаНачалоВыбораСервер() Экспорт 
	
	Макет = Справочники.ГАЛ_СтатусыЗаявокНаДоставку.ПолучитьМакет("ЦветаМетки");	
	СписокВыбора = Новый СписокЗначений;
	Строк=7;
	НСтр=1;
	Для НомерСтроки=0 по (Строк-1) цикл
			СписокВыбора.Добавить(Макет.Область(НСтр, 1).Текст,Макет.Область(НСтр, 3).Текст,,Макет.Область(НСтр, 2).Картинка);
			НСтр=НСтр+1;
	КонецЦикла;

	Возврат СписокВыбора;  
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПослеВыбора(ЗначениеВыбора, ДопПараметры) Экспорт 
	
	Объект.ЗначениеЦветаМетки = ЗначениеВыбора.Значение;
		
	//Цвет = WebЦвета[Объект.ЗначениеЦвета];
КонецПроцедуры
