

Функция ПолучитьПустойИД() Экспорт

        Возврат Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");

КонецФункции
	    

Функция ПолучитьСписокИзмененийПоОбъектам(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИзмененияПоОбъектамСрезПоследних.Данные
	               |ИЗ
	               |	РегистрСведений.мпИзмененияПоОбъектам.СрезПоследних КАК ИзмененияПоОбъектамСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИзмененияПоОбъектамСрезПоследних.Данные";
	ТЗ = Запрос.Выполнить().Выгрузить();			   
	
	Возврат ТЗ;
	
КонецФункции	

Функция УдалитьИзмененияПоВладельцу(Пароль) Экспорт
	
	Агент = мпПредметныйСервер.ПолучитьФизлицоПоПаролю(Пароль);
	Если Агент = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.мпИзмененияПоОбъектам.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Данные.Установить(Агент); 
	НаборЗаписей.Записать(); 

	Возврат "";
	
КонецФункции


Процедура ПоместитьОбъектИсторияИзменений(Пользователь, ТекущийОбъектСсылка) Экспорт
	
	ТекДата = ТекущаяДата();
	
	НаборЗаписей = РегистрыСведений.мпИзмененияПоОбъектам.СоздатьНаборЗаписей(); 
	
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь); 
	НаборЗаписей.Отбор.Данные.Установить(ТекущийОбъектСсылка); 
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.Пользователь   = Пользователь; 
	НоваяЗапись.Данные   	   = ТекущийОбъектСсылка; 
		
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ЕстьОбъектВИсторииИзменений(ТекущийОбъектСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИзмененияПоОбъектамСрезПоследних.Данные
	               |ИЗ
	               |	РегистрСведений.мпИзмененияПоОбъектам.СрезПоследних КАК ИзмененияПоОбъектамСрезПоследних
	               |ГДЕ
	               |	ИзмененияПоОбъектамСрезПоследних.Данные = &Данные";
	Запрос.УстановитьПараметр("Данные", ТекущийОбъектСсылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() = 0 Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	Возврат ИСТИНА;
	
КонецФункции
