


//Удаляет символы кроме числовыъ
Функция ТолькоЧислаВСтроке(ИсхСтрока) Экспорт 
	
	ЧислоСимволов = СтрДлина(ИсхСтрока);
	НоваяСтрока = "";
	 
	Для Сч=1 По ЧислоСимволов Цикл
		Если Сред(ИсхСтрока,Сч,1) = "0" или
			 Сред(ИсхСтрока,Сч,1) = "1" или
			 Сред(ИсхСтрока,Сч,1) = "2" или
			 Сред(ИсхСтрока,Сч,1) = "3" или
			 Сред(ИсхСтрока,Сч,1) = "4" или
			 Сред(ИсхСтрока,Сч,1) = "5" или
			 Сред(ИсхСтрока,Сч,1) = "6" или
			 Сред(ИсхСтрока,Сч,1) = "7" или
			 Сред(ИсхСтрока,Сч,1) = "8" или
			 Сред(ИсхСтрока,Сч,1) = "9" 
			                               Тогда
			  НоваяСтрока = НоваяСтрока + Сред(ИсхСтрока,Сч,1) ;
		КонецЕсли;
	КонецЦикла;
	
Возврат НоваяСтрока;
КонецФункции

Функция ПолучитьРегионАдресаКонтрагента(Объект,ВидКонтактнойИнформации) Экспорт 
	
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |	КонтрагентыКонтактнаяИнформация.ЗначенияПолей,
               |	КонтрагентыКонтактнаяИнформация.Вид
               |ИЗ
               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
               |ГДЕ
               |	КонтрагентыКонтактнаяИнформация.Ссылка = &Ссылка
               |	И КонтрагентыКонтактнаяИнформация.Вид = &Вид";

Запрос.УстановитьПараметр("Ссылка", Объект);
Запрос.УстановитьПараметр("Вид", ВидКонтактнойИнформации);

Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();

Если Выборка.Количество()>0 Тогда
 Выборка.Следующий();

 Регион = УправлениеКонтактнойИнформацией.СведенияОбАдресе(Выборка.ЗначенияПолей);

 Возврат Регион.Регион; 
ИНаче
 Возврат "";

КонецЕсли;

	
	
КонецФункции


&НаСервере
Функция ПолучитьАбсолютныйЦвет(ИсходныйЦвет) Экспорт
	
	
	
	Если ИсходныйЦвет.Вид = ВидЦвета.Абсолютный Тогда
		Возврат ИсходныйЦвет;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Область("R1C1").ЦветФона = ИсходныйЦвет;
	Каталог = КаталогВременныхФайлов();
	ТабДок.Записать(Каталог + "ПреобразованиеЦвета.mxl", ТипФайлаТабличногоДокумента.MXL7);
	ТабДок.Прочитать(Каталог + "ПреобразованиеЦвета.mxl");
	
	АЦвет = ТабДок.Область("R1C1").ЦветФона;
	
	Возврат АЦвет;

КонецФункции

