&НаКлиенте
Перем ЗакрытьОбработку;

&НаКлиенте
Перем КэшированныеЗначения;
&НаКлиенте
Перем ПодборТекущаяНоменклатура;
&НаКлиенте
Перем ПодборТекущаяХарактеристика;

&НаКлиенте
Перем ПодборТекущаяЦена;
&НаКлиенте
Перем Упаковка;
&НаКлиенте
Перем ВидЦены;
&НаКлиенте
Перем СрокПоставки;
&НаКлиенте
Перем ФильтрВариантНавигации;

&НаКлиенте
Перем ТекущаяСтраницаНавигации;
&НаКлиенте
Перем НавигацияПоИерархии;
&НаКлиенте
Перем НавигацияПоВидамНоменклатуры;
&НаКлиенте
Перем НавигацияПоПроизводителям;

&НаКлиенте
Перем ТекДетализацияСнизу;	
&НаКлиенте
Перем ЗакладкиДетализацияСнизу;

&НаКлиенте
Перем ЭлементыПодборТаблицаНоменклатура;

//============================================================================
// ССЫЛКИ

&НаКлиенте
Процедура SubSysSkype(Команда)
	
	ЗапуститьПриложение("skype:shekineugeniy?chat");
	
КонецПроцедуры

&НаКлиенте
Процедура SubSysПерейтиНаСайтРазработчика(Команда)
	
	ЗапуститьПриложение("http://subsystems.ru/");
	
КонецПроцедуры

&НаКлиенте
Процедура SubSysПроверитьОбновления(Команда)
	
	ЗапуститьПриложение("http://subsystems.ru/forum/forum38/");
	
КонецПроцедуры

&НаКлиенте
Процедура SubSysМегапрайс(Команда)
	
	Результат = Ложь;
	
	Попытка
		ОткрытьФорму("ВнешняяОбработка.мегапрайсИмпортПрайсаПартнера.Форма.Форма"); 
		Результат = Истина;
	Исключение
	КОнецПопытки;
	
	Если Результат = Ложь Тогда
		Попытка
			ОткрытьФорму("Обработка.мегапрайсИмпортПрайсаПартнера.Форма.Форма"); 
			Результат = Истина;
		Исключение 
		КОнецПопытки;
	КонецЕсли;
	
	Если Результат = Ложь Тогда
		ЗапуститьПриложение("http://subsystems.ru/catalog/27/595/");
	Конецесли;
	
КонецПроцедуры

//============================================================================
// ФОРМА


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	
	Элементы.КорзинаХарактеристика.Видимость = ИспользоватьХарактеристикиНоменклатуры;
	Элементы.СписокОстаткиПоСкладамХарактеристика.Видимость = ИспользоватьХарактеристикиНоменклатуры;	
	
	Элементы.ПодборНоменклатураПоставщиковХарактеристикаНоменклатуры.Видимость = ИспользоватьХарактеристикиНоменклатуры;

	Элементы.РасшифровкаЦеныНоменклатурыХарактеристика.Видимость = ИспользоватьХарактеристикиНоменклатуры;
	Элементы.РасшифровкаЦеныНоменклатурыУпаковка.Видимость = ИспользоватьУпаковкиНоменклатуры;

	Элементы.РасшифровкаЗаказыПоставщикамХарактеристикаНоменклатуры.Видимость = ИспользоватьХарактеристикиНоменклатуры;

		
	ИспользоватьНавигацию = Ложь;
	Элементы.Навигация.Видимость = ИспользоватьНавигацию;
		
	ЭлементыВариантыНавигации = Элементы.ВариантыНавигации;
	ТекущаяСтраницаНавигации = ЭлементыВариантыНавигации.ТекущаяСтраница;
	НавигацияПоИерархии = ЭлементыВариантыНавигации.ПодчиненныеЭлементы.НавигацияИерархияНоменклатуры;
	НавигацияПоВидамНоменклатуры = ЭлементыВариантыНавигации.ПодчиненныеЭлементы.НавигацияВидыНоменклатуры;
	НавигацияПоПроизводителям = ЭлементыВариантыНавигации.ПодчиненныеЭлементы.НавигацияПроизводители;
	
	ЭлементыПодборТаблицаНоменклатура = Элементы.ПодборТаблицаНоменклатура;
	ТекДетализацияСнизу = Элементы.ДетализацияСнизу.ТекущаяСтраница;
	ЗакладкиДетализацияСнизу = Элементы.ДетализацияСнизу.ПодчиненныеЭлементы;
	
	//Элементы.ПодборТаблицаНоменклатураКод.Видимость = ПоискПоКоду;
	//Элементы.ПодборТаблицаНоменклатураАртикул.Видимость = ПоискПоАртикулу;
	
	ПриУстановкеИзмененииВидаЦен();
	ПриУстановкеИзмененииСклада();
	ПриУстановкеИзмененииВалюты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНовое(Команда)
	
	Результат = Ложь;
	
	Попытка
		ОткрытьФорму("ВнешняяОбработка.мегапрайсРасширенныйПомощникПродаж.Форма.Форма",,,Истина); 
		Результат = Истина;
	Исключение
	КОнецПопытки;
	
	Если Результат = Ложь Тогда
		Попытка
			ОткрытьФорму("Обработка.мегапрайсРасширенныйПомощникПродаж.Форма.Форма",,,Истина); 
			Результат = Истина;
		Исключение 
		КОнецПопытки;
	КонецЕсли;
	
	Если Результат = Ложь Тогда
		Сообщить("Данная разработка отсутствует или не подключена");
	Конецесли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка 
		Константы.мегапрайсРегистрационныйКлюч.Получить();
		Объект.ИспользоватьМегапрайс = Истина;
	Исключение
		Объект.ИспользоватьМегапрайс = Ложь;
	КонецПопытки;
	
	НачалоПериода          = НачалоМесяца(НачалоМесяца(ТекущаяДата())-1);
	НачалоПериода          = НачалоМесяца(НачалоПериода-1);
	Объект.НачалоПериода      = НачалоМесяца(НачалоПериода-1);
	Объект.КонецПериода       = КонецДня(ТекущаяДата());
	
	ИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
	ИспользоватьУпаковкиНоменклатуры       = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");
	
	ИспользоватьСтатусыЗаказовПоставщикам  = ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыЗаказовПоставщикам");
	ИспользоватьОбособленноеОбеспечениеЗаказов = ПолучитьФункциональнуюОпцию("ИспользоватьОбособленноеОбеспечениеЗаказов");
	
	ИспользоватьПодразделения                         = ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения");
	ИспользоватьРучныеСкидкиВПродажах                 = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах");
	ИспользоватьАвтоматическиеСкидкиВПродажах         = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах");
	ИспользоватьКоммерческиеПредложенияКлиентам       = ПолучитьФункциональнуюОпцию("ИспользоватьКоммерческиеПредложенияКлиентам");
	ИспользоватьЗаказыКлиентов                        = ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыКлиентов");
	ИспользоватьТиповыеСоглашенияСКлиентами           = ПолучитьФункциональнуюОпцию("ИспользоватьТиповыеСоглашенияСКлиентами");
	ИспользоватьИндивидуальныеСоглашенияСКлиентами    = ПолучитьФункциональнуюОпцию("ИспользоватьИндивидуальныеСоглашенияСКлиентами");
	ИспользоватьСоглашенияСКлиентами                  = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	ИспользоватьПодключаемоеОборудование              = ПолучитьФункциональнуюОпцию("ИспользоватьПодключаемоеОборудование");
	ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента      = ПолучитьФункциональнуюОпцию("ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента");
	ИспользоватьРасширенныеВозможностиЗаказаКлиента   = ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента");
	ИспользоватьГрафикиОплаты                         = ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиОплаты");
	ИспользоватьУпрощеннуюСхемуОплаты                 = ПолучитьФункциональнуюОпцию("ИспользоватьУпрощеннуюСхемуОплатыВПродажах");
	ИспользоватьСтатусыРеализацийТоваровУслуг         = ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыРеализацийТоваровУслуг");
	ИспользоватьОрдерныеСклады                        = ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныеСклады");
	ИспользоватьНаправленияДеятельности               = ПолучитьФункциональнуюОпцию("ИспользоватьУчетДоходовПоНаправлениямДеятельности");
	
	ИспользоватьТиповыеСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьТиповыеСоглашенияСКлиентами");
	ИспользоватьИндивидуальныеСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьИндивидуальныеСоглашенияСКлиентами");
	
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Обработки.ПомощникПродаж));

	Объект.ВидОперации = "Заказ покупателя";
	
	Дата   = ТекущаяДата();
	Если ИспользоватьОбособленноеОбеспечениеЗаказов Тогда
		Объект.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
	Иначе
		Объект.ВариантОбеспечения = Неопределено;
	КонецЕсли;
	
	Объект.Валюта         = ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(Объект.Валюта);
	Объект.Организация    = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Объект.Организация);
	//Объект.БанковскийСчет = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(Объект.Организация, , Объект.БанковскийСчет);
	
	Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	Объект.СтатусЗаказаКлиента = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке;
	Объект.Менеджер       = Пользователи.ТекущийПользователь();
	Объект.Склад          = ЗначениеНастроекПовтИсп.ПолучитьСкладПоУмолчанию(Объект.Склад, ПолучитьФункциональнуюОпцию("ИспользоватьСкладыВТабличнойЧастиДокументовПродажи"));
	Объект.Подразделение  = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Объект.Менеджер, Объект.Подразделение);
	
	Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию(Объект.Приоритет);	
	Объект.ДатаОтгрузки = КонецДня(ТекущаяДата());
	Объект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	
	ПодборТекущаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	ПодборТекущаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	
	Если Параметры.ЗапрашиватьКоличество <> Неопределено Тогда
		ЗапрашиватьКоличество = Параметры.ЗапрашиватьКоличество;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУсловияПродажПоСоглашению()
	
	УсловияПродаж = ПродажиСервер.ПолучитьУсловияПродаж(Объект.Соглашение, Истина);
	Объект.Валюта = Объект.Соглашение.Валюта;
	
	//СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	ПродажиСервер.ЗаполнитьЦены(
	Объект.Товары,
	, // Массив строк или структура отбора
	Новый Структура( // Параметры заполнения
	"Дата, Валюта, Соглашение, ПоляЗаполнения",
	Объект.Дата,
	Объект.Валюта,
	Объект.Соглашение,
	"Цена, СтавкаНДС, ВидЦены, СрокПоставки"
	),
	Новый Структура( // Структура действий с измененными строками
	"ПересчитатьСумму, ПересчитатьСуммуСНДС, ПересчитатьСуммуНДС, ПересчитатьСуммуРучнойСкидки, ОчиститьАвтоматическуюСкидку, ПересчитатьСуммуСУчетомРучнойСкидки",
	"КоличествоУпаковок", СтруктураПересчетаСуммы, СтруктураПересчетаСуммы, "КоличествоУпаковок", Неопределено, Новый Структура("Очищать", Истина)
	)
	);
	
	СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
	СтруктураПараметров.Организация    			= Объект.Организация;
	СтруктураПараметров.БанковскийСчет 			= Объект.БанковскийСчет;
	СтруктураПараметров.НаправлениеДеятельности = УсловияПродаж.НаправлениеДеятельности;
	
	Объект.Организация = Объект.Соглашение.Организация; 
	Объект.Договор     = ПродажиСервер.ПолучитьДоговорПоУмолчанию(Объект, Объект.ХозяйственнаяОперация, Объект.Валюта);

	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		Объект.Склад = Объект.Соглашение.Склад;
	КонецЕсли;

	Объект.ВидЦен                    = Объект.Соглашение.ВидЦен;
	Объект.БанковскийСчет            = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметров);
	Объект.БанковскийСчетКонтрагента = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(Объект.Контрагент, , Объект.БанковскийСчетКонтрагента);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСоглашенияСервер()
	
	Если Не ЗначениеЗаполнено (Объект.Соглашение) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьУсловияПродажПоСоглашению();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриУстановкеИзмененииВидаЦен()
	
	Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ПодборТаблицаНоменклатура,"ВидЦеныНоменклатуры", Объект.ВидЦен, Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ПодборТаблицаНоменклатура,"ВидЦеныНоменклатуры", Неопределено, Истина);
	КонецЕсли;
	
	Элементы.ПодборТаблицаНоменклатураЦена.Заголовок = Объект.ВидЦен;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриУстановкеИзмененииСклада()
	
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ПодборТаблицаНоменклатура,"СкладОтбор", Объект.Склад, Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ПодборТаблицаНоменклатура,"СкладОтбор", Неопределено, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриУстановкеИзмененииВалюты()
	
	Если ЗначениеЗаполнено(Объект.Валюта) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ПодборТаблицаНоменклатура,"Валюта", Объект.Валюта, Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ПодборТаблицаНоменклатура,"Валюта", Неопределено, Истина);
	КонецЕсли;

	
	Для Каждого ВыборкаСтрока Из Объект.Товары Цикл				
		СтруктураЗаполненияЦены = Новый Структура;
		СтруктураЗаполненияЦены.Вставить("Дата",   ТекущаяДата());
		СтруктураЗаполненияЦены.Вставить("Валюта", Объект.Валюта);
		СтруктураЗаполненияЦены.Вставить("ВидЦены", ВыборкаСтрока.ВидЦены);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", СтруктураЗаполненияЦены);	
		СтруктураДействий.Вставить("ПересчитатьСумму");
		
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ВыборкаСтрока, СтруктураДействий, КэшированныеЗначения);
	КонецЦикла;

КонецПроцедуры


&НаСервере
Процедура ПриИзмененииПартнераСервер()
	
	Если ЗначениеЗаполнено(Объект.Соглашение) Тогда
		Объект.Соглашение = Справочники.СоглашенияСКлиентами.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда		
		УсловияПродажПоУмолчанию = ПродажиСервер.ПолучитьУсловияПродажПоУмолчанию(Объект.Партнер);
		
		Если УсловияПродажПоУмолчанию <> Неопределено Тогда
			Объект.Соглашение = УсловияПродажПоУмолчанию.Соглашение;			
		КонецЕсли;	
	КонецЕсли;
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер, Объект.Контрагент);
	БанковскийСчетКонтрагента = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(Объект.Контрагент);
	
КонецПроцедуры 

&НаКлиенте
Процедура КонтрагентПриИзменении()
	
	ПриИзмененииПартнераСервер();
	ПриИзмененииСоглашенияСервер();
	
	ПриУстановкеИзмененииВидаЦен();
	ПриУстановкеИзмененииСклада();

	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		Заголовок = ""+Объект.Партнер;
	Иначе
		ЭтаФорма.АвтоЗаголовок = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеПриИзменении(Элемент)
	
	ПриИзмененииСоглашенияСервер();
	ПродажиКлиент.ОповеститьОбОкончанииЗаполненияУсловийПродаж();
	
	ПриУстановкеИзмененииВидаЦен();
	ПриУстановкеИзмененииСклада();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЦенПриИзменении(Элемент)
	
	ПриУстановкеИзмененииВидаЦен();
	
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Попытка
		ПараметрыВыбораСоглашения = ПродажиКлиент.ПараметрыНачалаВыбораСоглашенияСКлиентом();	
		ПараметрыВыбораСоглашения.Элемент                     = Элемент;
		ПараметрыВыбораСоглашения.Партнер                     = Объект.Партнер;
		ПараметрыВыбораСоглашения.Документ                    = Объект.Соглашение;
		ПараметрыВыбораСоглашения.ДатаДокумента               = ТекущаяДата();
		ПараметрыВыбораСоглашения.ДанныеФормыСтруктура        = Объект;
		
		ПродажиКлиент.НачалоВыбораСоглашенияСКлиентом(ПараметрыВыбораСоглашения, СтандартнаяОбработка);
	Исключение
		ПродажиКлиент.НачалоВыбораСоглашенияСКлиентом(Элемент, СтандартнаяОбработка, Объект.Партнер, Объект.Соглашение, ТекущаяДата());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборСкладПриИзменении(Элемент)
	
	ПриУстановкеИзмененииСклада();
	
КонецПроцедуры

&НаКлиенте
Процедура ИерархияНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЭтаФорма.ТекущийЭлемент = ЭлементыПодборТаблицаНоменклатура;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыСозданияНовойНоменклатурыНаСервере()
	
	Возврат ПодборТоваровСервер.ПараметрыСозданияНовойНоменклатуры(ЭтаФорма);
	
КонецФункции

&НаКлиенте
Процедура СоздатьНовуюНоменклатуру(Команда)
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ПомощникНового", ПараметрыСозданияНовойНоменклатурыНаСервере(), ЭтаФорма);
	
КонецПроцедуры


//============================================================================
// НАВИГАЦИЯ

&НаКлиенте
Процедура ВариантОтбораПриИзменении()
	
	// Удаление всех наложенных отборов.
	ПодборТаблицаНоменклатура.Отбор.Элементы.Очистить();
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ПодборТаблицаНоменклатура,"ВидЦеныНоменклатуры", Объект.ВидЦен, Истина);
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	ПодборТаблицаНоменклатура,"СвободныйОстаток",0,ВидСравненияКомпоновкиДанных.Больше,,ОтборТолькоВНаличии);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	ПодборТаблицаНоменклатура,"ОстаткиПоставщиков",0,ВидСравненияКомпоновкиДанных.Больше,,ОтборВНаличииУПоставщиков);
	
	ПрименитьПоиск();
	
	Элементы.ВидыНоменклатуры.ТекущаяСтрока     = Неопределено;
	Элементы.ИерархияНоменклатуры.ТекущаяСтрока = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсеОтборыСервер()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПодборТаблицаНоменклатура,"Родитель",Неопределено,ВидСравненияКомпоновкиДанных.ВИерархии, ,Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПодборТаблицаНоменклатура,"ВидНоменклатуры",Неопределено,ВидСравненияКомпоновкиДанных.Равно, ,Ложь);	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПодборТаблицаНоменклатура,"Производитель",Неопределено,ВидСравненияКомпоновкиДанных.Равно, ,Ложь);	
	
КонецПроцедуры


&НаКлиенте
Процедура ВариантыНавигацииПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ВариантНавигацииПоНоменклатуре = "По Иерархии" Тогда
		
		Элементы.ВариантыНавигации.ТекущаяСтраница = Элементы.НавигацияИерархияНоменклатуры; 
		
	ИначеЕсли ВариантНавигацииПоНоменклатуре = "Производители" Тогда
		
		Элементы.ВариантыНавигации.ТекущаяСтраница = Элементы.НавигацияПроизводители;
		
	ИначеЕсли ВариантНавигацииПоНоменклатуре = "Виды номенклатуры" Тогда
		
		Элементы.ВариантыНавигации.ТекущаяСтраница = Элементы.НавигацияВидыНоменклатуры;	
		
	КонецЕсли;

	ВариантОтбораПриИзменении();
	
	ТекущаяСтраницаНавигации = Элементы.ВариантыНавигации.ТекущаяСтраница;
	
	ОбновитьВсеОтборыСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура НавигацияПриАктивизацииСтроки(Элемент)
	
	//Если ЭтаФорма.ТекущийЭлемент = ЭлементыПодборТаблицаНоменклатура Тогда
	//	Возврат
	//КонецЕсли;
	
	Если НЕ ИспользоватьНавигацию Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыВариантыНавигации = Элементы.ВариантыНавигации.ТекущаяСтраница;
	
	Если ТекущаяСтраницаНавигации = НавигацияПоИерархии Тогда
		
		ОтборГруппаНоменклатуры = Элементы.ИерархияНоменклатуры.ТекущаяСтрока;
		
		Если ЗначениеЗаполнено(ОтборГруппаНоменклатуры) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПодборТаблицаНоменклатура,
																			"Родитель",
																			ОтборГруппаНоменклатуры,
																			ВидСравненияКомпоновкиДанных.ВИерархии,
																			"Родитель",
																			Истина);

		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПодборТаблицаНоменклатура,
																			"Родитель",
																			,
																			ВидСравненияКомпоновкиДанных.Равно,
																			"Родитель",
																			Ложь);

		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраницаНавигации = НавигацияПоВидамНоменклатуры Тогда		
		
		ОтборВидНоменклатуры = Элементы.ВидыНоменклатуры.ТекущаяСтрока;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПодборТаблицаНоменклатура,
																			"ВидНоменклатуры",
																			ОтборВидНоменклатуры,
																			ВидСравненияКомпоновкиДанных.Равно,
																			"ВидНоменклатуры",
																			Истина);
																			
	ИначеЕсли ТекущаяСтраницаНавигации = НавигацияПоПроизводителям Тогда		
		
		ОтборВидНоменклатуры = Элементы.ПроизводителиНоменклатуры.ТекущаяСтрока;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПодборТаблицаНоменклатура,
																			"Производитель",
																			ОтборВидНоменклатуры,
																			ВидСравненияКомпоновкиДанных.Равно,
																			"Производитель",
																			Истина);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТолькоВНаличииПриИзменении(Элемент)
	
	//ГруппаОтбораОтборТолькоВНаличииНоменклатура = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
	//ПодборТаблицаНоменклатура.Отбор.Элементы,
	//"ГруппаОтборТолькоВНаличии",
	//ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПодборТаблицаНоменклатура,
																			"СвободныйОстаток",
																			0,
																			ВидСравненияКомпоновкиДанных.Больше,
																			"СвободныйОстаток",
																			ОтборТолькоВНаличии);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПодборТаблицаНоменклатура,
																			"ОстаткиПоставщиков",
																			0,
																			ВидСравненияКомпоновкиДанных.Больше,
																			"ОстаткиПоставщиков",
																			ОтборВНаличииУПоставщиков);

	
КонецПроцедуры

//============================================================================
// ПОИСК

//============================================================================
// СЛУЖЕБНЫЕ

&НаСервереБезКонтекста
Функция мРазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ";")
	
	МассивСтрок = Новый Массив();
	
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;		
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции 

&НаСервереБезКонтекста
Функция глМассивПеревестиСловаВРег(МассивСлов)
	
	НовыйМассив = Новый Массив; 
	
	Для Каждого Стр Из МассивСлов Цикл
		НовыйМассив.Добавить(ВРег(СокрЛП(Стр)));
	КонецЦикла;
	
	Возврат НовыйМассив; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ПоискПоПодстрокеНаСервере(СтруктураПараметров)
	
	МассивОтбора = Новый СписокЗначений();	
	
	ШаблонПоиска = СокрЛП(СтруктураПараметров.СтрокаПоиска);
	Если НЕ ЗначениеЗаполнено(ШаблонПоиска) Тогда
		Возврат МассивОтбора;
	КонецЕсли;
		
	МассивСлов   = мРазложитьСтрокуВМассивПодстрок(ШаблонПоиска," ");
	МассивСлов   = глМассивПеревестиСловаВРег(МассивСлов);
	КоличествоСлов = МассивСлов.Количество();	
	
	ПоискУсловиеИЛИ = СтруктураПараметров.ПоискУсловиеИЛИ;
	ПоискПоКоду = СтруктураПараметров.ПоискПоКоду;
	ПоискПоАртикулу = СтруктураПараметров.ПоискПоАртикулу;
	ПоискВНаименовании = СтруктураПараметров.ПоискВНаименовании;
	ПоискВПолномНаименовании =  СтруктураПараметров.ПоискВПолномНаименовании;
	ПоискПоОписанию = СтруктураПараметров.ПоискПоОписанию;
	ПоискПоШтрихкоду = СтруктураПараметров.ПоискПоШтрихкоду;
	
	Если ПоискПоАртикулу Тогда				
		Запрос = Новый Запрос();
		
		УсловиеПоискаПоСтроке = "";	
		Для инд = 0 По КоличествоСлов - 1 Цикл
			СтрКлючевоеСлово = СокрЛП(МассивСлов[инд]);
			
			Если ПоискУсловиеИЛИ И инд > 0 Тогда
				УсловиеПоискаПоСтроке = УсловиеПоискаПоСтроке + " ИЛИ СпрНоменклатура.Артикул ПОДОБНО &ПодстрокаПоиска"+Строка(инд);
			Иначе
				УсловиеПоискаПоСтроке = УсловиеПоискаПоСтроке + " И СпрНоменклатура.Артикул ПОДОБНО &ПодстрокаПоиска"+Строка(инд);	
			КонецЕсли;
			Запрос.УстановитьПараметр("ПодстрокаПоиска"+Строка(инд),"%"+СтрКлючевоеСлово+"%");
		КонецЦикла;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СпрНоменклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|ГДЕ
		|	СпрНоменклатура.ЭтоГруппа = ЛОЖЬ";
		ТекстЗапроса = ТекстЗапроса + УсловиеПоискаПоСтроке;		
		
		Запрос.Текст = ТекстЗапроса;							
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивОтбора.Добавить(Выборка.Номенклатура);		
		КонецЦикла;	
	КонецЕсли;
	
	Если ПоискПоКоду Тогда				
		Запрос = Новый Запрос();
		
		УсловиеПоискаПоСтроке = "";	
		Для инд = 0 По КоличествоСлов - 1 Цикл
			СтрКлючевоеСлово = СокрЛП(МассивСлов[инд]);
			
			Если ПоискУсловиеИЛИ И инд > 0 Тогда
				УсловиеПоискаПоСтроке = УсловиеПоискаПоСтроке + " ИЛИ СпрНоменклатура.Код ПОДОБНО &ПодстрокаПоиска"+Строка(инд);
			Иначе
				УсловиеПоискаПоСтроке = УсловиеПоискаПоСтроке + " И СпрНоменклатура.Код ПОДОБНО &ПодстрокаПоиска"+Строка(инд);	
			КонецЕсли;
			Запрос.УстановитьПараметр("ПодстрокаПоиска"+Строка(инд),"%"+СтрКлючевоеСлово+"%");
		КонецЦикла;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СпрНоменклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|ГДЕ
		|	СпрНоменклатура.ЭтоГруппа = ЛОЖЬ";
		ТекстЗапроса = ТекстЗапроса + УсловиеПоискаПоСтроке;
		
		Запрос.Текст = ТекстЗапроса;							
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивОтбора.Добавить(Выборка.Номенклатура);		
		КонецЦикла;	
	КонецЕсли;
	
	Если ПоискВНаименовании Тогда				
		Запрос = Новый Запрос();
		
		УсловиеПоискаПоСтроке = "";	
		Для инд = 0 По КоличествоСлов - 1 Цикл
			СтрКлючевоеСлово = СокрЛП(МассивСлов[инд]);
			
			Если ПоискУсловиеИЛИ И инд > 0 Тогда
				УсловиеПоискаПоСтроке = УсловиеПоискаПоСтроке + " ИЛИ СпрНоменклатура.Наименование ПОДОБНО &ПодстрокаПоиска"+Строка(инд);
			Иначе
				УсловиеПоискаПоСтроке = УсловиеПоискаПоСтроке + " И СпрНоменклатура.Наименование ПОДОБНО &ПодстрокаПоиска"+Строка(инд);	
			КонецЕсли;
			Запрос.УстановитьПараметр("ПодстрокаПоиска"+Строка(инд),"%"+СтрКлючевоеСлово+"%");
		КонецЦикла;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СпрНоменклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|ГДЕ
		|	СпрНоменклатура.ЭтоГруппа = ЛОЖЬ";
		ТекстЗапроса = ТекстЗапроса + УсловиеПоискаПоСтроке; 
		
		Запрос.Текст = ТекстЗапроса;							
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивОтбора.Добавить(Выборка.Номенклатура);		
		КонецЦикла;		
	КонецЕсли;	
	
	Если ПоискВПолномНаименовании Тогда				
		Запрос = Новый Запрос();
		
		УсловиеПоискаПоСтроке = "";	
		Для инд = 0 По КоличествоСлов - 1 Цикл
			СтрКлючевоеСлово = СокрЛП(МассивСлов[инд]);
			
			Если ПоискУсловиеИЛИ И инд > 0 Тогда
				УсловиеПоискаПоСтроке = УсловиеПоискаПоСтроке + " ИЛИ СпрНоменклатура.НаименованиеПолное ПОДОБНО &ПодстрокаПоиска"+Строка(инд);	
			Иначе
				УсловиеПоискаПоСтроке = УсловиеПоискаПоСтроке + " И СпрНоменклатура.НаименованиеПолное ПОДОБНО &ПодстрокаПоиска"+Строка(инд);	
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ПодстрокаПоиска"+Строка(инд),"%"+СтрКлючевоеСлово+"%");
		КонецЦикла;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СпрНоменклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|ГДЕ
		|	СпрНоменклатура.ЭтоГруппа = ЛОЖЬ";
		ТекстЗапроса = ТекстЗапроса + УсловиеПоискаПоСтроке;	
		
		Запрос.Текст = ТекстЗапроса;							
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивОтбора.Добавить(Выборка.Номенклатура);		
		КонецЦикла;	
	КонецЕсли;	

	
	Если ПоискПоОписанию Тогда				
		Запрос = Новый Запрос();
		
		УсловиеПоискаПоСтроке = "";	
		Для инд = 0 По КоличествоСлов - 1 Цикл
			СтрКлючевоеСлово = СокрЛП(МассивСлов[инд]);
			
			Если ПоискУсловиеИЛИ И инд > 0 Тогда
				УсловиеПоискаПоСтроке = УсловиеПоискаПоСтроке + " ИЛИ СпрНоменклатура.Описание ПОДОБНО &ПодстрокаПоиска"+Строка(инд);
			Иначе
				УсловиеПоискаПоСтроке = УсловиеПоискаПоСтроке + " И СпрНоменклатура.Описание ПОДОБНО &ПодстрокаПоиска"+Строка(инд);	
			КонецЕсли;
			Запрос.УстановитьПараметр("ПодстрокаПоиска"+Строка(инд),"%"+СтрКлючевоеСлово+"%");
		КонецЦикла;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СпрНоменклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|ГДЕ
		|	СпрНоменклатура.ЭтоГруппа = ЛОЖЬ";
		ТекстЗапроса = ТекстЗапроса + УсловиеПоискаПоСтроке;
		
		Запрос.Текст = ТекстЗапроса;							
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивОтбора.Добавить(Выборка.Номенклатура);		
		КонецЦикла;	
	КонецЕсли;

	
	Если СтруктураПараметров.ПоискПоСвойству Тогда			
		Запрос = Новый Запрос();

		УсловиеПоискаПоСтроке = "";	
		Для инд = 0 По КоличествоСлов - 1 Цикл
			СтрКлючевоеСлово = СокрЛП(МассивСлов[инд]);
			
			Если ПоискУсловиеИЛИ И инд > 0 Тогда
				УсловиеПоискаПоСтроке = УсловиеПоискаПоСтроке + " ИЛИ ВЫРАЗИТЬ(ДополнительныеРеквизиты.Значение КАК СТРОКА(150)) ПОДОБНО &ПодстрокаПоиска"+Строка(инд);
			Иначе
				УсловиеПоискаПоСтроке = УсловиеПоискаПоСтроке + " И ВЫРАЗИТЬ(ДополнительныеРеквизиты.Значение КАК СТРОКА(150)) ПОДОБНО &ПодстрокаПоиска"+Строка(инд);	
			КонецЕсли;
			Запрос.УстановитьПараметр("ПодстрокаПоиска"+Строка(инд),"%"+СтрКлючевоеСлово+"%");
		КонецЦикла;

		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДополнительныеРеквизиты.Ссылка КАК Номенклатура,
		|	ВЫРАЗИТЬ(ДополнительныеРеквизиты.Значение КАК СТРОКА(150)) КАК ЗначениеСвойства
		|ИЗ
		|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
		|ГДЕ
		|	ДополнительныеРеквизиты.Ссылка.ЭтоГруппа = ЛОЖЬ
		|	"+?(ЗначениеЗаполнено(СтруктураПараметров.ВидСвойства)," И ДополнительныеРеквизиты.Свойство = &ВидСвойства","")+"";
		ТекстЗапроса = ТекстЗапроса + УсловиеПоискаПоСтроке; 
		
		Запрос.Текст = ТекстЗапроса;							
		Запрос.УстановитьПараметр("ВидСвойства",СтруктураПараметров.ВидСвойства);
		Выборка = Запрос.Выполнить().Выбрать();		
		Пока Выборка.Следующий() Цикл
			МассивОтбора.Добавить(Выборка.Номенклатура);		
		КонецЦикла;	
	КонецЕсли;
	
	Если ПоискПоШтрихкоду Тогда		
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод ПОДОБНО &ВыбШтрихкод";
		
		Запрос.УстановитьПараметр("ВыбШтрихкод", "%"+ШаблонПоиска+"%");
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивОтбора.Добавить(Выборка.Номенклатура);	
		КонецЦикла;
	КонецЕсли;
	
	Если МассивОтбора.Количество() > 0 Тогда	
		Если СтруктураПараметров.ИспользоватьМегапрайс Тогда			
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	мегапрайсВзаимозаменяемостьНоменклатуры.АналогНоменклатура КАК Номенклатура
			               |ИЗ
			               |	РегистрСведений.мегапрайсВзаимозаменяемостьНоменклатуры КАК мегапрайсВзаимозаменяемостьНоменклатуры
			               |ГДЕ
			               |	мегапрайсВзаимозаменяемостьНоменклатуры.Номенклатура В(&ВыбНоменклатура)";
			
			Запрос = Новый Запрос();
			Запрос.Текст = ТекстЗапроса;							
			Запрос.УстановитьПараметр("ВыбНоменклатура",МассивОтбора);
			ТаблицаАналогов = Запрос.Выполнить().Выгрузить();			
			
			Если ТаблицаАналогов.Количество() > 0 Тогда
				Для Каждого СтрЭлемент Из ТаблицаАналогов Цикл
					МассивОтбора.Добавить(СтрЭлемент.Номенклатура);		
				КонецЦикла;	
			КонецЕсли;
		КонецЕсли;			
	КонецЕсли;
	
	Возврат МассивОтбора;
	
КонецФункции

&НаКлиенте
Процедура ПрименитьПоиск()
	
	Использование = ЗначениеЗаполнено(СтрокаПоиска);	
	Если НЕ Использование Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПодборТаблицаНоменклатура,"Ссылка",Неопределено,ВидСравненияКомпоновкиДанных.Равно,,Ложь);
		Возврат;
	КонецЕсли;	
	
	Если ПоискУбратьМусор Тогда
		СтрокаПоиска = СтрЗаменить(СтрокаПоиска,"-"," ");
		СтрокаПоиска = СтрЗаменить(СтрокаПоиска,"/"," ");
		СтрокаПоиска = СтрЗаменить(СтрокаПоиска,"("," ");
		СтрокаПоиска = СтрЗаменить(СтрокаПоиска,")"," ");
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИспользоватьМегапрайс", Объект.ИспользоватьМегапрайс);
	СтруктураПараметров.Вставить("СтрокаПоиска", СтрокаПоиска);
	СтруктураПараметров.Вставить("ПоискУсловиеИЛИ", ПоискУсловиеИЛИ);
	СтруктураПараметров.Вставить("ПоискПоКоду", ПоискПоКоду);
	СтруктураПараметров.Вставить("ПоискПоАртикулу", ПоискПоАртикулу);
	СтруктураПараметров.Вставить("ПоискВНаименовании", ПоискВНаименовании);
	СтруктураПараметров.Вставить("ПоискВПолномНаименовании", ПоискВПолномНаименовании);
	СтруктураПараметров.Вставить("ПоискПоОписанию", ПоискПоОписанию);
	СтруктураПараметров.Вставить("ПоискПоШтрихкоду", ПоискПоШтрихкоду);
	СтруктураПараметров.Вставить("ПоискПоСвойству", ПоискПоСвойству);
	СтруктураПараметров.Вставить("ВидСвойства", ВидСвойства);     
	
	МассивОтбора = ПоискПоПодстрокеНаСервере(СтруктураПараметров);		
	
	Если МассивОтбора.Количество() > 0 Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПодборТаблицаНоменклатура,"Ссылка",МассивОтбора,ВидСравненияКомпоновкиДанных.ВСписке,,Истина);

		СпискиВыбораКлиентСервер.ОбновитьСписокВыбора(Элементы.СтрокаПоиска.СписокВыбора, СтрокаПоиска);
	Иначе
		Состояние("Ничего не найдено");
	КонецЕсли;
	
	ЭтаФорма.ТекущийЭлемент = ЭлементыПодборТаблицаНоменклатура;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаОчистка(Элемент, СтандартнаяОбработка)
	
	ПрименитьПоиск();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьСловатьАвтозаменСлов(Строка) Экспорт
	
	Если ПустаяСтрока(Строка) Тогда
		Возврат "";
	КонецЕсли;
	
	МассивСлов = СтрРазделить(Строка," "); 
	НовыйМассив = Новый Массив;
	
	Для Каждого Стр Из МассивСлов Цикл	
		
		НайденаНоменклатура = Новый Структура;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	мегапрайсСловарьАвтозамен.ЧтоЗаменить КАК ЧтоЗаменить,
		|	мегапрайсСловарьАвтозамен.ЗначениеЗамены КАК ЗначениеЗамены
		|ИЗ
		|	РегистрСведений.мегапрайсСловарьАвтозамен КАК мегапрайсСловарьАвтозамен
		|ГДЕ
		|	мегапрайсСловарьАвтозамен.ЧтоЗаменить = &ЧтоЗаменить";
		
		Запрос.УстановитьПараметр("ЧтоЗаменить", Стр);		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Стр = Выборка.ЗначениеЗамены;
		КонецЦикла;
		
		НовыйМассив.Добавить(Стр);
	КонецЦикла;
	
	Строка = СтрСоединить(НовыйМассив," "); 
	Возврат Строка;
	
КонецФункции

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	
	Если Объект.ИспользоватьМегапрайс Тогда
		СтрокаПоиска = ПроверитьСловатьАвтозаменСлов(СтрокаПоиска);
	КонецЕсли;

	ПрименитьПоиск();
	
КонецПроцедуры


&НаКлиенте
Процедура АктивироватьПоиск(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПоискПоАртикулу", ПоискПоАртикулу);
	СтруктураПараметров.Вставить("ПоискВНаименовании", ПоискВНаименовании);
	СтруктураПараметров.Вставить("ПоискВПолномНаименовании", ПоискВПолномНаименовании);	
	
	Попытка
		СтруктураВозврата = ОткрытьФормуМодально("ВнешняяОбработка.мегапрайсРасширенныйПомощникПродаж.Форма.ФормаПоисковаяСтрока",СтруктураПараметров,ЭтаФорма); 
	Исключение
		СтруктураВозврата = ОткрытьФормуМодально("Обработка.мегапрайсРасширенныйПомощникПродаж.Форма.ФормаПоисковаяСтрока",СтруктураПараметров,ЭтаФорма); 
	КонецПопытки;
	
	Если СтруктураВозврата <> Неопределено Тогда
		СтрокаПоиска = СтруктураВозврата.СтрокаПоиска;
		ПоискПоАртикулу = СтруктураВозврата.ПоискПоАртикулу;
		ПоискВНаименовании = СтруктураВозврата.ПоискВНаименовании;
		ПоискВПолномНаименовании = СтруктураВозврата.ПоискВПолномНаименовании;	
		
		ПрименитьПоиск();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоиск(Команда)
	
	СтрокаПоиска = "";
	
	ПрименитьПоиск();
	
КонецПроцедуры

//============================================================================
// ПЕРЕНОС В ДОКУМЕНТ

&НаСервере
Функция ПоместитьТоварыВХранилище()
	
	Товары = Объект.Товары.Выгрузить();
	
	АдресТоваровВХранилище = ПоместитьВоВременноеХранилище(Товары, УникальныйИдентификатор);
	
	Возврат АдресТоваровВХранилище;
	
КонецФункции

//============================================================================
// СПИСКИ

&НаСервере
Функция ПолучитьТекстЗапросаЦенаПродажиПоВидуЦеныНоменклатуры(МассивТаблиц = Неопределено)
	
	Если МассивТаблиц <> Неопределено Тогда 
		МассивТаблиц.Добавить("РезультатЗапросаЦеныНоменклатуры");
	КонецЕсли;
	
	Текст = 
	"ВЫБРАТЬ
	|	&ВидЦены КАК ВидЦены,
	|	ЦеныНоменклатуры.Упаковка КАК Упаковка,
	|	ЦеныНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ЦеныНоменклатуры.Упаковка.КоличествоУпаковок, 1) КАК КоличествоУпаковок,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) * ВЫБОР
	|			КОГДА &Валюта <> ЦеныНоменклатуры.Валюта
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.Кратность, 0) > 0
	|								И ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.Курс, 0) > 0
	|								И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.Кратность, 0) > 0
	|								И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.Курс, 0) > 0
	|							ТОГДА КурсыСрезПоследнихВалютаЦены.Курс * КурсыСрезПоследнихВалютаДокумента.Кратность / (КурсыСрезПоследнихВалютаДокумента.Курс * КурсыСрезПоследнихВалютаЦены.Кратность)
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ),
	|			ВидЦены = &ВидЦены
	|				И Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика) КАК ЦеныНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ТекущаяДата, ) КАК КурсыСрезПоследнихВалютаЦены
	|		ПО (КурсыСрезПоследнихВалютаЦены.Валюта = ЦеныНоменклатуры.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ТекущаяДата, Валюта = &Валюта) КАК КурсыСрезПоследнихВалютаДокумента
	|		ПО (ИСТИНА)";
	
	Возврат Текст;
	
КонецФункции

&НаСервере
Функция ПолучитьЦенуПоВидуЦены(Номенклатура, Характеристика, ВидЦены) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаЦенаПродажиПоВидуЦеныНоменклатуры();
	
	Запрос.УстановитьПараметр("Номенклатура",   Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("ВидЦены",        ВидЦены);
	Запрос.УстановитьПараметр("Валюта",         Объект.Валюта);
	Запрос.УстановитьПараметр("ТекущаяДата",    ТекущаяДата());
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[0].Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураЦены = Новый Структура("ВидЦены, Цена, Упаковка, ЕдиницаИзмерения", Выборка.ВидЦены, Выборка.Цена, Выборка.Упаковка, Выборка.ЕдиницаИзмерения);
	Иначе
		СтруктураЦены = Новый Структура("ВидЦены, Цена, Упаковка, ЕдиницаИзмерения", Справочники.ВидыЦен.ПустаяСсылка(), 0, Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка(), Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	КонецЕсли;
	
	Возврат Новый Структура("Цена", СтруктураЦены);
	
КонецФункции

&НаКлиенте
Процедура ПолучитьЦенуТекущегоТовара(ПодборТекущаяНоменклатура, ПодборТекущаяХарактеристика)
	
	Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда		
		СтруктураИнформацииОТоваре = ПолучитьЦенуПоВидуЦены(ПодборТекущаяНоменклатура, ПодборТекущаяХарактеристика, Объект.ВидЦен);
		
		СтруктураЦена = СтруктураИнформацииОТоваре.Цена;
		НаименованиеУпаковкиЕдиницыИзмерения = ?(ЗначениеЗаполнено(СтруктураЦена.Упаковка), Строка(СтруктураЦена.Упаковка), Строка(СтруктураЦена.ЕдиницаИзмерения));
		
		ПодборТекущаяЦена = СтруктураЦена.Цена;
		ВидЦены      = СтруктураЦена.ВидЦены;
		Упаковка     = СтруктураЦена.Упаковка;
		СрокПоставки = 0;		
		
	Иначе		
		ПодборТекущаяЦена = 0;
		ВидЦены      = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
		Упаковка     = ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");		СрокПоставки = 0;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОстаткиПоСкладамПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанныеРасшифровка = Элементы.СписокОстаткиПоСкладам.ТекущиеДанные;
	
	Если НЕ ТекущиеДанныеРасшифровка = Неопределено Тогда
		
		Если ИспользоватьХарактеристикиНоменклатуры Тогда
			ПодборТекущаяХарактеристика = ТекущиеДанныеРасшифровка.Характеристика;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда		
			СтруктураИнформацииОТоваре = ПолучитьЦенуПоВидуЦены(ПодборТекущаяНоменклатура, ПодборТекущаяХарактеристика, Объект.ВидЦен);
			
			СтруктураЦена = СтруктураИнформацииОТоваре.Цена;
			НаименованиеУпаковкиЕдиницыИзмерения = ?(ЗначениеЗаполнено(СтруктураЦена.Упаковка), Строка(СтруктураЦена.Упаковка), Строка(СтруктураЦена.ЕдиницаИзмерения));
			
			ПодборТекущаяЦена = СтруктураЦена.Цена;
			ВидЦены      = СтруктураЦена.ВидЦены;
			Упаковка     = СтруктураЦена.Упаковка;
			СрокПоставки = 0;
		Иначе			
			ПодборТекущаяЦена = 0;
			ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
			Упаковка = ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");
			СрокПоставки = 0;
		КонецЕсли;
		
	Иначе
		ПодборТекущаяХарактеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЩелчокМенеджераПоОкнуСостатками(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанныеНоменклатура = ЭлементыПодборТаблицаНоменклатура.ТекущиеДанные;	
	ТекущиеДанныеОстатки = Элементы.СписокОстаткиПоСкладам.ТекущиеДанные;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда	
		Возврат;
	КОнецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ВариантОбеспечения", Объект.ВариантОбеспечения);
	СтруктураПараметры.Вставить("Номенклатура", ПодборТекущаяНоменклатура);
	
	Если ИспользоватьХарактеристикиНоменклатуры Тогда
		ТекущиеДанныеХарактеристика = ТекущиеДанныеОстатки.Характеристика;
		СтруктураПараметры.Вставить("ХарактеристикиИспользуются", Истина);
	Иначе
		ТекущиеДанныеХарактеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
		СтруктураПараметры.Вставить("ХарактеристикиИспользуются", Ложь);
	КонецЕсли;
	СтруктураПараметры.Вставить("Характеристика", ТекущиеДанныеХарактеристика);
	
	ПолучитьЦенуТекущегоТовара(ПодборТекущаяНоменклатура, ТекущиеДанныеХарактеристика);
	
	Если ИспользоватьУпаковкиНоменклатуры Тогда
		СтруктураПараметры.Вставить("Упаковка", ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка"));
	Иначе
		СтруктураПараметры.Вставить("Упаковка", ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка"));
	КонецЕсли;
	
	//ПОДБОР ЦЕНЫ
	СтруктураПараметры.Вставить("НеЗаполнятьВидЦеныВКорзину", НеЗаполнятьВидЦеныВКорзину);
	СтруктураПараметры.Вставить("ВидЦены", Объект.ВидЦен);
	СтруктураПараметры.Вставить("Цена", ПодборТекущаяЦена);
	
	ТекущиеДанныеЦен = Элементы.РасшифровкаЦеныНоменклатуры.ТекущиеДанные;	
	Если НЕ ТекущиеДанныеЦен = Неопределено Тогда	
		СтруктураПараметры.Вставить("ВидЦены", ТекущиеДанныеЦен.ВидЦены);
		СтруктураПараметры.Вставить("Цена", ТекущиеДанныеЦен.ЦенаПересчет);
	КОнецЕсли;
		
	СтруктураПараметры.Вставить("Склад", ТекущиеДанныеОстатки.Склад);
	СтруктураПараметры.Вставить("ДатаОтгрузки", ТекущаяДата());
	
	ДобавитьВКорзину(СтруктураПараметры, 1);		
	
КонецПроцедуры


&НаКлиенте
Процедура ПодборТаблицаНоменклатураВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанныеНоменклатура = ЭлементыПодборТаблицаНоменклатура.ТекущиеДанные;	
	ПодборТекущаяНоменклатура = ТекущиеДанныеНоменклатура.Ссылка;
	ПодборТекущаяХарактеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	ПодборТекущаяЦена = ТекущиеДанныеНоменклатура.Цена;
		
	Если ОпцияПодборСНесколькихСкладов Тогда
		СтандартнаяОбработка    = Ложь;
		Элементы.ДетализацияСнизу.ТекущаяСтраница = Элементы.ДетализацияСнизу.ПодчиненныеЭлементы.ДетальныеОстатки;
		ЭтаФорма.ТекущийЭлемент = Элементы.СписокОстаткиПоСкладам;
		ОбновитьДанныеДополнительнойИнформации();
		Возврат;
	КонецЕсли;	
		
	Если ИспользоватьХарактеристикиНоменклатуры Тогда
		ТекущиеДанныеРасшифровка = Элементы.СписокОстаткиПоСкладам.ТекущиеДанные;		
		Если ТекущиеДанныеРасшифровка <> Неопределено Тогда
			ПодборТекущаяХарактеристика = ТекущиеДанныеРасшифровка.Характеристика;
		КонецЕсли; 
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда		
		Возврат;
	КонецЕсли;
			
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ВариантОбеспечения", Объект.ВариантОбеспечения);	
	СтруктураПараметры.Вставить("Номенклатура", ПодборТекущаяНоменклатура);
	
	ПолучитьЦенуТекущегоТовара(ПодборТекущаяНоменклатура, ПодборТекущаяХарактеристика);
	
	Если НЕ ТекущиеДанныеРасшифровка = Неопределено Тогда
		Если ИспользоватьХарактеристикиНоменклатуры Тогда
			ТекущиеДанныеХарактеристика = ТекущиеДанныеРасшифровка.Характеристика;
			СтруктураПараметры.Вставить("ХарактеристикиИспользуются", Истина);
		Иначе
			ТекущиеДанныеХарактеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
			СтруктураПараметры.Вставить("ХарактеристикиИспользуются", Ложь);
		КонецЕсли;
	Иначе
		ТекущиеДанныеХарактеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
		СтруктураПараметры.Вставить("ХарактеристикиИспользуются", Ложь);
	КонецЕсли;
	СтруктураПараметры.Вставить("Характеристика", ТекущиеДанныеХарактеристика);
	
	Если ИспользоватьУпаковкиНоменклатуры Тогда
		СтруктураПараметры.Вставить("Упаковка", Упаковка);
	Иначе
		СтруктураПараметры.Вставить("Упаковка", ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка"));
	КонецЕсли;
	
	СтруктураПараметры.Вставить("НеЗаполнятьВидЦеныВКорзину", НеЗаполнятьВидЦеныВКорзину);
	СтруктураПараметры.Вставить("ВидЦены", Объект.ВидЦен);
	СтруктураПараметры.Вставить("Цена", ПодборТекущаяЦена);
	
	СтруктураПараметры.Вставить("Склад", Объект.Склад);
	СтруктураПараметры.Вставить("ДатаОтгрузки", ТекущаяДата());
	СтруктураПараметры.Вставить("СрокПоставки", СрокПоставки);
	
	ДобавитьВКорзину(СтруктураПараметры, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуТовара(Команда)
	
	ТекущаяСтрока = ЭлементыПодборТаблицаНоменклатура.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура("Ключ", ТекущаяСтрока);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы);
	
КонецПроцедуры

//============================================================================
// ПАНЕЛЬ ИНФОРМАЦИИ

Процедура РасшифровкиСформироватьПоследниеПродажиПартнеру(СписокИсторияПродаж,СтруктураПараметры) 
	
	СписокИсторияПродаж.Очистить();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Ссылка.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Номенклатура КАК Номенклатура,
	|	СУММА(РеализацияТоваровУслуг.Количество) КАК Количество,
	|	МАКСИМУМ(РеализацияТоваровУслуг.Сумма / РеализацияТоваровУслуг.Количество) КАК Цена
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка.Партнер = &Партнер
	|	И РеализацияТоваровУслуг.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РеализацияТоваровУслуг.Ссылка.Проведен = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслуг.Ссылка.Дата,
	|	РеализацияТоваровУслуг.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Партнер", СтруктураПараметры.Партнер);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(СтруктураПараметры.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(СтруктураПараметры.КонецПериода));
	
	СписокИсторияПродаж = Запрос.Выполнить().Выгрузить();

КонецПроцедуры

&НаСервереБезКонтекста
Функция РасшифровкиРасшифровкаЦеныНоменклатуры(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = Новый Массив;

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
	|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
	|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Валюта) КАК Валюта,
	|	ВидыЦен.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	|	0 КАК ЦенаПересчет,
	|	0 КАК Наценка
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура = &ВыбНоменклатура) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ВидыЦен.Ссылка = ЦеныНоменклатурыСрезПоследних.ВидЦены
	|ГДЕ
	|	ЦеныНоменклатурыСрезПоследних.ВидЦены.ИспользоватьПриПродаже = ИСТИНА
	|	И ВидыЦен.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияВидовЦен.Действует)
	|{ГДЕ
	|	ЦеныНоменклатурыСрезПоследних.ВидЦены.*}
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.ВидЦены,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика,
	|	ЦеныНоменклатурыСрезПоследних.Упаковка,
	|	ВидыЦен.РеквизитДопУпорядочивания
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеквизитДопУпорядочивания";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВыбНоменклатура",ПараметрыЗапроса.Номенклатура);
		
			
	ВалютаРасчетная = ПараметрыЗапроса.Валюта;	
	СтруктураВалютыРасчета = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРасчетная, ТекущаяДата());
	ПоКурсуНач      = 0;	
	ЦенаПродажи = ПараметрыЗапроса.ЦенаПродажи;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Для Каждого Выборка Из РезультатЗапроса Цикл
		Если ВалютаРасчетная <> Выборка.Валюта Тогда			
			СтруктураВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Выборка.Валюта, ТекущаяДата());
			ПоКурсуНач = СтруктураВалюты.Курс;

			Выборка.ЦенаПересчет = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(Выборка.Цена, Выборка.Валюта, ВалютаРасчетная, ПоКурсуНач, СтруктураВалютыРасчета.Курс,СтруктураВалюты.Кратность,СтруктураВалютыРасчета.Кратность);
			Если ПараметрыЗапроса.ОкруглятьЦены Тогда
				Выборка.ЦенаПересчет = Окр(Выборка.ЦенаПересчет,0);
			КонецЕсли;
		Иначе
			Выборка.ЦенаПересчет = Выборка.Цена;
		КонецЕсли;
		
		Если Выборка.ЦенаПересчет > 0 И ЦенаПродажи > 0 Тогда
			НаценкаКЦенеКомпании = (Выборка.ЦенаПересчет - ЦенаПродажи)*100 / ЦенаПродажи;
			Выборка.Наценка = НаценкаКЦенеКомпании;
		КонецЕсли;

		НоваяСтрока = Новый Структура("ВидЦены, Номенклатура, Характеристика, Упаковка, Цена,ЦенаПересчет,Наценка, Валюта");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		ТаблицаРезультат.Добавить(НоваяСтрока);		
	КонецЦикла;		
	
	Возврат Новый Структура("ТаблицаРезультат",ТаблицаРезультат);

КонецФункции


&НаСервереБезКонтекста
Функция РасшифровкиЦеныПоставщиков(ПараметрыЗапроса) 
	
	ТаблицаРезультат = Новый Массив;
	
	Если ПараметрыЗапроса.ИспользоватьМегапрайс Тогда
		
		ПеречислениеВариантыКурса = Перечисления.мегапрайсВариантКурсаВалютыКонтрагента;

		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЦеныНоменклатурыКонтрагентов.ПрайсПартнера.Партнер КАК Поставщик,
		|	ЦеныНоменклатурыКонтрагентов.Склад КАК ВиртуальныйСклад,
		|	ЦеныНоменклатурыКонтрагентов.Валюта КАК Валюта,
		|	МАКСИМУМ(ЦеныНоменклатурыКонтрагентов.Цена) КАК ЦенаПоставщика,
		|	МАКСИМУМ(ЦеныНоменклатурыКонтрагентов.ЦенаПродажи) КАК ЦенаПродажи,
		|	СУММА(ЦеныНоменклатурыКонтрагентов.Количество) КАК ОстатокКонтрагента,
		|	МАКСИМУМ(ЦеныНоменклатурыКонтрагентов.Период) КАК ДатаЦены,
		|	ЦеныНоменклатурыКонтрагентов.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	0 КАК ЦенаПересчет,
		|	0 КАК Наценка,
		|	ЦеныНоменклатурыКонтрагентов.ПрайсПартнера КАК ПрайсПартнера,
		|	ЦеныНоменклатурыКонтрагентов.ПрайсПартнера.ВариантКурсаВалютыКонтрагента КАК ВариантКурсаВалютыКонтрагента,
		|	ЦеныНоменклатурыКонтрагентов.ПрайсПартнера.ИскажениеКурсаВалюты КАК ИскажениеКурсаВалюты,
		|	ЦеныНоменклатурыКонтрагентов.ПрайсПартнера.ФиксированныйКурс КАК ФиксированныйКурс,
		|	СУММА(ЗаказыПоставщикамОстатки.ЗаказаноОстаток) КАК ЗаказаноОстаток,
		|	СУММА(ЗаказыПоставщикамОстатки.КОформлениюОстаток) КАК КОформлениюОстаток
		|ИЗ
		|	РегистрСведений.мегапрайсЦеныНоменклатурыПоставщиков.СрезПоследних(, Номенклатура = &ВыбНоменклатура) КАК ЦеныНоменклатурыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Остатки(, Номенклатура = &ВыбНоменклатура) КАК ЗаказыПоставщикамОстатки
		|		ПО ЦеныНоменклатурыКонтрагентов.Номенклатура = ЗаказыПоставщикамОстатки.Номенклатура
		|			И ЦеныНоменклатурыКонтрагентов.ХарактеристикаНоменклатуры = ЗаказыПоставщикамОстатки.Характеристика
		|			И ЦеныНоменклатурыКонтрагентов.ПрайсПартнера.Партнер = ЗаказыПоставщикамОстатки.ЗаказПоставщику.Партнер
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыКонтрагентов.ПрайсПартнера.Партнер,
		|	ЦеныНоменклатурыКонтрагентов.Склад,
		|	ЦеныНоменклатурыКонтрагентов.Валюта,
		|	ЦеныНоменклатурыКонтрагентов.Период,
		|	ЦеныНоменклатурыКонтрагентов.ХарактеристикаНоменклатуры,
		|	ЦеныНоменклатурыКонтрагентов.ПрайсПартнера,
		|	ЦеныНоменклатурыКонтрагентов.ПрайсПартнера.ВариантКурсаВалютыКонтрагента,
		|	ЦеныНоменклатурыКонтрагентов.ПрайсПартнера.ИскажениеКурсаВалюты,
		|	ЦеныНоменклатурыКонтрагентов.ПрайсПартнера.ФиксированныйКурс
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦеныНоменклатурыКонтрагентов.ПрайсПартнера.Партнер.Наименование";
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЦеныНоменклатурыКонтрагентов.Партнер КАК Поставщик,
		|	ЦеныНоменклатурыКонтрагентов.Валюта КАК Валюта,
		|	МАКСИМУМ(ЦеныНоменклатурыКонтрагентов.Цена) КАК ЦенаПоставщика,
		|	МАКСИМУМ(ЦеныНоменклатурыКонтрагентов.Период) КАК ДатаЦены,
		|	ЦеныНоменклатурыКонтрагентов.Характеристика КАК ХарактеристикаНоменклатуры,
		|	0 КАК ОстатокКонтрагента,
		|	0 КАК ЦенаПродажи,
		|	0 КАК Наценка,
		|	0 КАК ЦенаПересчет,
		|	СУММА(ЗаказыПоставщикамОстатки.ЗаказаноОстаток) КАК ЗаказаноОстаток,
		|	СУММА(ЗаказыПоставщикамОстатки.КОформлениюОстаток) КАК КОформлениюОстаток
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(, Номенклатура = &ВыбНоменклатура) КАК ЦеныНоменклатурыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Остатки(, Номенклатура = &ВыбНоменклатура) КАК ЗаказыПоставщикамОстатки
		|		ПО ЦеныНоменклатурыКонтрагентов.Номенклатура = ЗаказыПоставщикамОстатки.Номенклатура
		|			И ЦеныНоменклатурыКонтрагентов.Характеристика = ЗаказыПоставщикамОстатки.Характеристика
		|			И ЦеныНоменклатурыКонтрагентов.Партнер = ЗаказыПоставщикамОстатки.ЗаказПоставщику.Партнер
		|ГДЕ
		|	ЦеныНоменклатурыКонтрагентов.Партнер.Поставщик = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыКонтрагентов.Партнер,
		|	ЦеныНоменклатурыКонтрагентов.Валюта,
		|	ЦеныНоменклатурыКонтрагентов.Характеристика
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦеныНоменклатурыКонтрагентов.Партнер.Наименование";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВыбНоменклатура",ПараметрыЗапроса.Номенклатура);
	
	ВозможныеПоставщикиТаб = Запрос.Выполнить().Выгрузить();
	
	ВалютаРасчетная = ПараметрыЗапроса.Валюта;
	СтруктураВалютыРасчета = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРасчетная, ТекущаяДата());
	ПоКурсуНач = 0;	
	ЦенаПродажи = ПараметрыЗапроса.ЦенаПродажи;
	
	Для Каждого Выборка Из ВозможныеПоставщикиТаб Цикл
		//Если Выборка.ЦенаПоставщика = 0  Тогда
		//	Продолжить;
		//КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Валюта) И ВалютаРасчетная <> Выборка.Валюта Тогда			
			СтруктураВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Выборка.Валюта, ТекущаяДата());
			ПоКурсуНач = СтруктураВалюты.Курс;

			Если ПараметрыЗапроса.ИспользоватьМегапрайс Тогда
				Если Выборка.ВариантКурсаВалютыКонтрагента = ПеречислениеВариантыКурса.КурсВалютыЦБ Тогда
				ИначеЕсли Выборка.ВариантКурсаВалютыКонтрагента = ПеречислениеВариантыКурса.КурсВалютыЦБПлюсЧисло Тогда
					ПоКурсуНач = ПоКурсуНач + Выборка.ИскажениеКурсаВалюты;
				ИначеЕсли Выборка.ВариантКурсаВалютыКонтрагента = ПеречислениеВариантыКурса.КурсВалютыЦБПлюсПроцент Тогда	
					ПоКурсуНач = ПоКурсуНач *(1+Выборка.ИскажениеКурсаВалюты/100);
				ИначеЕсли Выборка.ВариантКурсаВалютыКонтрагента = ПеречислениеВариантыКурса.ФиксированныйКурс Тогда	
					ПоКурсуНач = Выборка.ФиксированныйКурс;
				КонецЕсли;
			КонецЕсли;
			Выборка.ЦенаПересчет = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(Выборка.ЦенаПоставщика, Выборка.Валюта, ВалютаРасчетная, ПоКурсуНач, СтруктураВалютыРасчета.Курс,СтруктураВалюты.Кратность,СтруктураВалютыРасчета.Кратность);
		Иначе
			Выборка.ЦенаПересчет = Выборка.ЦенаПоставщика;
		КонецЕсли;
		
		Если Выборка.ЦенаПродажи > 0 И ЦенаПродажи > 0 Тогда
			НаценкаКЦенеКомпании = (ЦенаПродажи - Выборка.ЦенаПродажи)*100 / Выборка.ЦенаПродажи;
			Выборка.Наценка = НаценкаКЦенеКомпании;
		ИначеЕсли Выборка.ЦенаПересчет > 0 И ЦенаПродажи > 0 Тогда
			НаценкаКЦенеКомпании = (ЦенаПродажи - Выборка.ЦенаПересчет)*100 / Выборка.ЦенаПересчет;
			Выборка.Наценка = НаценкаКЦенеКомпании;
		КонецЕсли;

		НоваяСтрока = Новый Структура("ДатаЦены, ПрайсПартнера, Поставщик, ВиртуальныйСклад, ОстатокКонтрагента, ЦенаПоставщика, Валюта, ЦенаПересчет, ЦенаПродажи, Наценка, ЗаказаноОстаток, КОформлениюОстаток");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		ТаблицаРезультат.Добавить(НоваяСтрока);		
	КонецЦикла;	
	
	Возврат Новый Структура("ТаблицаРезультат",ТаблицаРезультат);
	
КонецФункции

&НаСервереБезКонтекста
Функция РасшифровкиСформироватьДинамикаПродаж(ПараметрыЗапроса) 
	
	ТаблицаРезультат = Новый Массив;
	
	ПериодичностьДляЗапроса = Строка(ПараметрыЗапроса.Периодичность);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.КоличествоОборот КАК Продажи,
	|	ВложенныйЗапрос.КоличествоНачальныйОстаток КАК НачальныйОстаток,
	|	ВложенныйЗапрос.КоличествоКонечныйОстаток КАК КонечныйОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		СУММА(ВложенныйЗапрос.КоличествоОборот) КАК КоличествоОборот,
	|		СУММА(ВложенныйЗапрос.КоличествоНачальныйОстаток) КАК КоличествоНачальныйОстаток,
	|		СУММА(ВложенныйЗапрос.КоличествоКонечныйОстаток) КАК КоличествоКонечныйОстаток
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СвободныеОстатки.Период КАК Период,
	|			0 КАК КоличествоОборот,
	|			СвободныеОстатки.ВНаличииНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|			СвободныеОстатки.ВНаличииКонечныйОстаток КАК КоличествоКонечныйОстаток
	|		ИЗ
	|			РегистрНакопления.СвободныеОстатки.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, ДЕНЬ, , Номенклатура = &УсловиеОтбора) КАК СвободныеОстатки
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ПродажиОбороты.Период,
	|			ПродажиОбороты.КоличествоОборот,
	|			0,
	|			0
	|		ИЗ
	|			РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&НачалоПериода, &КонецПериода, ДЕНЬ, ) КАК ПродажиОбороты
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаНоменклатуры
	|				ПО ПродажиОбороты.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.КлючАналитики
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|				ПО ПродажиОбороты.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|		ГДЕ
	|			АналитикаНоменклатуры.Номенклатура = &УсловиеОтбора
	|			И АналитикаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)) КАК ВложенныйЗапрос
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Период) КАК ВложенныйЗапрос
	|ИТОГИ
	|	СУММА(Продажи),
	|	СУММА(НачальныйОстаток),
	|	СУММА(КонечныйОстаток)
	|ПО
	|	Период ПЕРИОДАМИ(ДЕНЬ, &НачалоПериода, &КонецПериода)
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"День",ПериодичностьДляЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ДЕНЬ",ПериодичностьДляЗапроса);
	
	ПараметрыРеквизитов = Новый Структура;
	ПараметрыРеквизитов.Вставить("НачалоПериода", ПараметрыЗапроса.НачалоПериода);
	ПараметрыРеквизитов.Вставить("КонецПериода", ПараметрыЗапроса.КонецПериода);
	ПараметрыРеквизитов.Вставить("Периодичность", ПараметрыЗапроса.Периодичность);
	
	Запрос = Новый Запрос;	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("УсловиеОтбора", ПараметрыЗапроса.Номенклатура);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПараметрыЗапроса.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПараметрыЗапроса.КонецПериода));
	
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "Все");
	Пока Выборка.Следующий() Цикл			
		НоваяСтрока = Новый Структура("Период, Продажи, НачальныйОстаток, КонечныйОстаток");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		ТаблицаРезультат.Добавить(НоваяСтрока);		
	КонецЦикла;
	
	Возврат Новый Структура("ТаблицаРезультат",ТаблицаРезультат);
	
КонецФункции

&НаСервереБезКонтекста
Функция РасшифровкиСформироватьРасшифровкаИсторияПоступлений(ПараметрыЗапроса) 
	
	ТаблицаРезультат = Новый Массив;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваровУслуг.Период КАК Дата,
	|	ПоступлениеТоваровУслуг.Партнер КАК Партнер,
	|	ПоступлениеТоваровУслуг.Регистратор КАК ДокументЗакупки,
	|	СУММА(ПоступлениеТоваровУслуг.КоличествоОборот) КАК Количество,
	|	ВЫБОР
	|		КОГДА СУММА(ПоступлениеТоваровУслуг.КоличествоОборот) > 0
	|			ТОГДА СУММА(ПоступлениеТоваровУслуг.СуммаОборот) / СУММА(ПоступлениеТоваровУслуг.КоличествоОборот)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЦенаЗакупки,
	|	ПоступлениеТоваровУслуг.Регистратор.Валюта КАК Валюта,
	|	ПоступлениеТоваровУслуг.Склад КАК Склад
	|ИЗ
	|	РегистрНакопления.Закупки.Обороты(&НачалоПериода, &КонецПериода, Регистратор, АналитикаУчетаНоменклатуры.Номенклатура = &ВыбНоменклатура) КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслуг.Период,
	|	ПоступлениеТоваровУслуг.Регистратор,
	|	ПоступлениеТоваровУслуг.Партнер,
	|	ПоступлениеТоваровУслуг.Регистратор.Валюта,
	|	ПоступлениеТоваровУслуг.Склад
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВыбНоменклатура",ПараметрыЗапроса.Номенклатура);
	Запрос.УстановитьПараметр("ВыбХарактеристика",ПараметрыЗапроса.ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПараметрыЗапроса.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПараметрыЗапроса.КонецПериода));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ВыборкаСтрока Из РезультатЗапроса Цикл		
		НоваяСтрока = Новый Структура("Дата, Партнер, ДокументЗакупки, Количество, ЦенаЗакупки, Валюта, Склад");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтрока);
		
		ТаблицаРезультат.Добавить(НоваяСтрока);		
	КонецЦикла;	
	
	Возврат Новый Структура("ТаблицаРезультат",ТаблицаРезультат);
	
КонецФункции

&НаСервереБезКонтекста
Функция РасшифровкиСформироватьРасшифровкаЗаказыПоставщикам(ПараметрыЗапроса) 
	
	ТаблицаРезультат = Новый Массив;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПоставщикам.ЗаказПоставщику.Дата КАК Дата,
	|	ЗаказыПоставщикам.ЗаказПоставщику.ЖелаемаяДатаПоступления КАК ЖелаемаяДатаПоступления,
	|	ЗаказыПоставщикам.ЗаказПоставщику.Контрагент КАК Контрагент,
	|	ЗаказыПоставщикам.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ЗаказыПоставщикам.ЗаказПоставщику.Склад КАК Склад,
	|	СУММА(ЗаказыПоставщикам.ЗаказаноОстаток) КАК Заказано,
	|	СУММА(ЗаказыПоставщикам.КОформлениюОстаток) КАК КОформлению
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(, Номенклатура = &ВыбНоменклатура) КАК ЗаказыПоставщикам
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикам.ЗаказПоставщику.Дата,
	|	ЗаказыПоставщикам.ЗаказПоставщику,
	|	ЗаказыПоставщикам.ЗаказПоставщику.Контрагент,
	|	ЗаказыПоставщикам.ЗаказПоставщику.Склад,
	|	ЗаказыПоставщикам.ЗаказПоставщику.ЖелаемаяДатаПоступления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВыбНоменклатура",ПараметрыЗапроса.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ВыборкаСтрока Из РезультатЗапроса Цикл		
		НоваяСтрока = Новый Структура("Дата, ЖелаемаяДатаПоступления, Контрагент, ЗаказПоставщику, Склад, Заказано, КОформлению");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтрока);
		
		ТаблицаРезультат.Добавить(НоваяСтрока);		
	КонецЦикла;	
	
	Возврат Новый Структура("ТаблицаРезультат",ТаблицаРезультат);
	
КонецФункции

&НаСервереБезКонтекста
Функция РасшифровкиСформироватьРасшифровкаЗаказыКлиентов(ПараметрыЗапроса) 
	
	ТаблицаРезультат = Новый Массив;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыКлиентов.ЗаказКлиента.Дата КАК Дата,
	|	ЗаказыКлиентов.ЗаказКлиента.Статус КАК Статус,
	|	ЗаказыКлиентов.ЗаказКлиента.Партнер КАК Партнер,
	|	ЗаказыКлиентов.ЗаказКлиента КАК ЗаказКлиента,
	|	ЗаказыКлиентов.ЗаказКлиента.Склад КАК Склад,
	|	СУММА(ЗаказыКлиентов.ЗаказаноОстаток) КАК Заказано,
	|	СУММА(ЗаказыКлиентов.КОформлениюОстаток) КАК КОформлению,
	|	ВЫБОР
	|		КОГДА СУММА(ЗаказыКлиентов.ЗаказаноОстаток) > 0
	|			ТОГДА СУММА(ЗаказыКлиентов.СуммаОстаток) / СУММА(ЗаказыКлиентов.ЗаказаноОстаток)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов.Остатки(, Номенклатура = &ВыбНоменклатура) КАК ЗаказыКлиентов
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыКлиентов.ЗаказКлиента.Дата,
	|	ЗаказыКлиентов.ЗаказКлиента,
	|	ЗаказыКлиентов.ЗаказКлиента.Склад,
	|	ЗаказыКлиентов.ЗаказКлиента.Статус,
	|	ЗаказыКлиентов.ЗаказКлиента.Партнер,
	|	ЗаказыКлиентов.СуммаОстаток
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВыбНоменклатура",ПараметрыЗапроса.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ВыборкаСтрока Из РезультатЗапроса Цикл		
		НоваяСтрока = Новый Структура("Дата, Статус, Партнер, ЗаказКлиента, Склад, Заказано, КОформлению, Цена");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтрока);
		
		ТаблицаРезультат.Добавить(НоваяСтрока);		
	КонецЦикла;	
	
	Возврат Новый Структура("ТаблицаРезультат",ТаблицаРезультат);
	
КонецФункции

&НаСервереБезКонтекста
Функция РасшифровкиСформироватьИсторияСделок(ПараметрыЗапроса) 
	
	ТаблицаРезультат = Новый Массив;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КоммерческоеПредложениеКлиенту.Ссылка.Дата КАК Дата,
	|	КоммерческоеПредложениеКлиенту.Ссылка.Партнер КАК Партнер,
	|	КоммерческоеПредложениеКлиенту.Номенклатура КАК Номенклатура,
	|	КоммерческоеПредложениеКлиенту.Характеристика КАК ХарактеристикаНоменклатуры,
	|	СУММА(КоммерческоеПредложениеКлиенту.Количество) КАК Количество,
	|	МАКСИМУМ(КоммерческоеПредложениеКлиенту.Сумма / КоммерческоеПредложениеКлиенту.Количество) КАК Цена,
	|	КоммерческоеПредложениеКлиенту.Ссылка КАК Сделка,
	|	КоммерческоеПредложениеКлиенту.ТекстовоеОписание КАК Описание,
	|	ВЫРАЗИТЬ(КоммерческоеПредложениеКлиенту.Ссылка.Комментарий КАК СТРОКА(1000)) КАК Комментарий
	|ИЗ
	|	Документ.КоммерческоеПредложениеКлиенту.Товары КАК КоммерческоеПредложениеКлиенту
	|ГДЕ
	|	КоммерческоеПредложениеКлиенту.Номенклатура = &ВыбНоменклатура
	|	И КоммерческоеПредложениеКлиенту.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И КоммерческоеПредложениеКлиенту.Ссылка.Проведен = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	КоммерческоеПредложениеКлиенту.Ссылка.Дата,
	|	КоммерческоеПредложениеКлиенту.Ссылка.Партнер,
	|	КоммерческоеПредложениеКлиенту.Номенклатура,
	|	КоммерческоеПредложениеКлиенту.Характеристика,
	|	КоммерческоеПредложениеКлиенту.Ссылка,
	|	КоммерческоеПредложениеКлиенту.ТекстовоеОписание,
	|	ВЫРАЗИТЬ(КоммерческоеПредложениеКлиенту.Ссылка.Комментарий КАК СТРОКА(1000))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	//Запрос.УстановитьПараметр("Партнер", ПараметрыЗапроса.Партнер);
	Запрос.УстановитьПараметр("ВыбНоменклатура",ПараметрыЗапроса.Номенклатура);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПараметрыЗапроса.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПараметрыЗапроса.КонецПериода));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ВыборкаСтрока Из РезультатЗапроса Цикл		
		НоваяСтрока = Новый Структура("Дата, Партнер, Сделка, Описание, Количество, Цена, ХарактеристикаНоменклатуры,Комментарий");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтрока);
		
		ТаблицаРезультат.Добавить(НоваяСтрока);		
	КонецЦикла;	
	
	Возврат Новый Структура("ТаблицаРезультат",ТаблицаРезультат);
	
КонецФункции


&НаСервереБезКонтекста
Функция РасшифровкиРасшифровкаИсторияПродажНоменклатуры(ПараметрыЗапроса) 
	
	ТаблицаРезультат = Новый Массив;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Продажи.Период КАК Дата,
	|	Продажи.Регистратор КАК ДокументПродажи,
	|	Продажи.Склад КАК Склад,
	|	АналитикаПоПартнерам.Партнер КАК Партнер,
	|	СУММА(Продажи.КоличествоОборот) КАК Количество,
	|	ВЫБОР
	|		КОГДА СУММА(Продажи.КоличествоОборот) > 0
	|			ТОГДА СУММА(Продажи.СуммаВыручкиОборот) / СУММА(Продажи.КоличествоОборот)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК Продажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО Продажи.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.КлючАналитики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|		ПО Продажи.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|ГДЕ
	|	АналитикаНоменклатуры.Номенклатура = &ВыбНоменклатура
	|	И АналитикаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Склад,
	|	АналитикаПоПартнерам.Партнер,
	|	Продажи.Период,
	|	Продажи.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("НачалоПериода",ПараметрыЗапроса.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",ПараметрыЗапроса.КонецПериода);
	Запрос.УстановитьПараметр("ВыбНоменклатура",ПараметрыЗапроса.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ВыборкаСтрока Из РезультатЗапроса Цикл		
		НоваяСтрока = Новый Структура("Дата, ДокументПродажи, Склад, Партнер, Количество, Цена");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтрока);
		
		ТаблицаРезультат.Добавить(НоваяСтрока);		
	КонецЦикла;	
	
	Возврат Новый Структура("ТаблицаРезультат",ТаблицаРезультат);
	
КонецФункции

&НаСервереБезКонтекста
Функция РасшифровкиРасшифровкаОбеспечениеПотребностейТиповое(ПараметрыЗапроса) 
	
	ТаблицаРезультат = Новый Массив;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбеспечениеЗаказов.Склад КАК Склад,
	|	ОбеспечениеЗаказов.Назначение КАК Назначение,
	|	СУММА(ОбеспечениеЗаказов.ПотребностьОстаток) КАК Потребность,
	|	СУММА(ОбеспечениеЗаказов.КЗаказуОстаток) КАК КЗаказу,
	|	СУММА(ОбеспечениеЗаказов.НаличиеПодЗаказОстаток) КАК НаличиеПодЗаказ
	|ИЗ
	|	РегистрНакопления.ОбеспечениеЗаказов.Остатки(&КонецПериода, ) КАК ОбеспечениеЗаказов
	|ГДЕ
	|	ОбеспечениеЗаказов.Номенклатура = &ВыбНоменклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбеспечениеЗаказов.Склад,
	|	ОбеспечениеЗаказов.Назначение";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("НачалоПериода",ПараметрыЗапроса.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",ПараметрыЗапроса.КонецПериода);
	Запрос.УстановитьПараметр("ВыбНоменклатура",ПараметрыЗапроса.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ВыборкаСтрока Из РезультатЗапроса Цикл		
		НоваяСтрока = Новый Структура("Склад, Назначение, Потребность, КЗаказу, НаличиеПодЗаказ");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтрока);
		
		ТаблицаРезультат.Добавить(НоваяСтрока);		
	КонецЦикла;	
	
	Возврат Новый Структура("ТаблицаРезультат",ТаблицаРезультат);
	
КонецФункции

&НаСервереБезКонтекста
Функция РасшифровкиСформироватьРасшифровкаГрафикДвиженияТоваров(ПараметрыЗапроса) 
	
	ТаблицаРезультат = Новый Массив;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГрафикПоступленияТоваровОстатки.Склад КАК Склад,
	|	ГрафикПоступленияТоваровОстатки.ДатаСобытия КАК ДатаСобытия,
	|	ГрафикПоступленияТоваровОстатки.Назначение КАК Назначение,
	|	СУММА(ГрафикПоступленияТоваровОстатки.КоличествоИзЗаказовОстаток) КАК КоличествоИзЗаказов,
	|	СУММА(ГрафикПоступленияТоваровОстатки.КоличествоПодЗаказОстаток) КАК КоличествоПодЗаказ,
	|	СУММА(ГрафикПоступленияТоваровОстатки.КоличествоИзЗаказовСНеподтвержденнымиОстаток) КАК КоличествоИзЗаказовСНеподтвержденными,
	|	СУММА(ГрафикПоступленияТоваровОстатки.КоличествоПодЗаказСНеподтвержденнымиОстаток) КАК КоличествоПодЗаказСНеподтвержденными,
	|	0 КАК КоличествоИзЗаказовОтгрузка,
	|	0 КАК КоличествоПодЗаказОтгрузка,
	|	0 КАК КоличествоНеобеспеченоОтгрузка
	|ИЗ
	|	РегистрНакопления.ГрафикПоступленияТоваров.Остатки(, Номенклатура = &ВыбНоменклатура) КАК ГрафикПоступленияТоваровОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикПоступленияТоваровОстатки.Склад,
	|	ГрафикПоступленияТоваровОстатки.ДатаСобытия,
	|	ГрафикПоступленияТоваровОстатки.Назначение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГрафикПоступленияТоваровОстатки.Склад,
	|	ГрафикПоступленияТоваровОстатки.ДатаОтгрузки,
	|	ГрафикПоступленияТоваровОстатки.Назначение,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ГрафикПоступленияТоваровОстатки.КоличествоИзЗаказовОстаток),
	|	СУММА(ГрафикПоступленияТоваровОстатки.КоличествоПодЗаказОстаток),
	|	СУММА(ГрафикПоступленияТоваровОстатки.КоличествоНеобеспеченоОстаток)
	|ИЗ
	|	РегистрНакопления.ГрафикОтгрузкиТоваров.Остатки(, Номенклатура = &ВыбНоменклатура) КАК ГрафикПоступленияТоваровОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикПоступленияТоваровОстатки.Склад,
	|	ГрафикПоступленияТоваровОстатки.ДатаОтгрузки,
	|	ГрафикПоступленияТоваровОстатки.Назначение";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВыбНоменклатура",ПараметрыЗапроса.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ВыборкаСтрока Из РезультатЗапроса Цикл		
		НоваяСтрока = Новый Структура("Склад, ДатаСобытия, Назначение, КоличествоИзЗаказов, КоличествоПодЗаказ, КоличествоИзЗаказовСНеподтвержденными, КоличествоПодЗаказСНеподтвержденными,КоличествоИзЗаказовОтгрузка,КоличествоПодЗаказОтгрузка,КоличествоНеобеспеченоОтгрузка");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтрока);
		
		ТаблицаРезультат.Добавить(НоваяСтрока);		
	КонецЦикла;	
	
	Возврат Новый Структура("ТаблицаРезультат",ТаблицаРезультат);
	
КонецФункции

&НаКлиенте
Процедура ПоказатьИсториюЗакупок(Команда)
	
	ПараметрыЗапроса = ПолучитьТекущиеДанныеСтроки(); 
	
	СтруктураИнформации = РасшифровкиСформироватьРасшифровкаИсторияПоступлений(ПараметрыЗапроса);
	РасшифровкаИсторияПоступлений.Очистить();
	
	Для Каждого ВыборкаСтрока Из СтруктураИнформации.ТаблицаРезультат Цикл				
		НоваяСтрока = РасшифровкаИсторияПоступлений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаСтрока);
	КонецЦикла;		
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИсториюПродаж(Команда)
	
	ПараметрыЗапроса = ПолучитьТекущиеДанныеСтроки(); 
	
	СтруктураИнформации = РасшифровкиРасшифровкаИсторияПродажНоменклатуры(ПараметрыЗапроса);
	РасшифровкаИсторияПродажНоменклатуры.Очистить();
	
	Для Каждого ВыборкаСтрока Из СтруктураИнформации.ТаблицаРезультат Цикл				
		НоваяСтрока = РасшифровкаИсторияПродажНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаСтрока);
	КонецЦикла;		

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекДетализацияСнизу(НомерСтраницы)
	
	ПараметрыЗапроса = ПолучитьТекущиеДанныеСтроки(); 
		
	Если НомерСтраницы = 1 Тогда
		
		РасшифровкиПолучитьСвойстваНоменклатуры(ПараметрыЗапроса);
		РасшифровкиПолучитьКартинкуНоменклатуры(ПараметрыЗапроса);		
		ОписаниеНоменклатуры = ПолучитьОписаниеНоменклатуры(ПараметрыЗапроса.Номенклатура);	
		
	ИначеЕсли НомерСтраницы = 20 Тогда
		
		СтруктураИнформации = РасшифровкиСформироватьРасшифровкаГрафикДвиженияТоваров(ПараметрыЗапроса);
		РасшифровкаГрафикДвиженияТоваров.Очистить();
		
		Для Каждого ВыборкаСтрока Из СтруктураИнформации.ТаблицаРезультат Цикл				
			НоваяСтрока = РасшифровкаГрафикДвиженияТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаСтрока);
		КонецЦикла;			
	
	ИначеЕсли НомерСтраницы = 2 Тогда
		
		СтруктураИнформации = РасшифровкиСформироватьРасшифровкаЗаказыКлиентов(ПараметрыЗапроса);
		РасшифровкаЗаказыКлиентов.Очистить();
		
		Для Каждого ВыборкаСтрока Из СтруктураИнформации.ТаблицаРезультат Цикл				
			НоваяСтрока = РасшифровкаЗаказыКлиентов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаСтрока);
		КонецЦикла;			
		
	ИначеЕсли НомерСтраницы = 15 Тогда
		
		СтруктураИнформации = РасшифровкиСформироватьИсторияСделок(ПараметрыЗапроса);
		РасшифровкаИсторияСделок.Очистить();
		
		Для Каждого ВыборкаСтрока Из СтруктураИнформации.ТаблицаРезультат Цикл				
			НоваяСтрока = РасшифровкаИсторияСделок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаСтрока);
		КонецЦикла;		
		
	ИначеЕсли НомерСтраницы = 10 Тогда
		
		Для Ном = 1 По 5 Цикл
			ИмяРеквизита = "КартинкаТовара"+Ном;
			
			ЭтотОбъект[ИмяРеквизита] = ""; 
		КонецЦикла;

		ПоказатьПодчиненныйСправочник(ПараметрыЗапроса);	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьПодчиненныйСправочник(ТекущиеДанные)
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НоменклатураПрисоединенныеФайлы.Ссылка КАК ПрисоединенныйФайл
	|ИЗ
	|	Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
	|ГДЕ
	|	НоменклатураПрисоединенныеФайлы.ВладелецФайла = &ТекНоменклатура";	
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТекНоменклатура",ТекущиеДанные.Номенклатура);
	Запрос.Текст = ТекстЗапроса;
	
	СписокКартинокТовара = Запрос.Выполнить().Выгрузить();
	
	НомерКартинки = 0;
	Для Каждого Выборка Из СписокКартинокТовара Цикл		
		НомерКартинки = НомерКартинки + 1;
		ИмяРеквизита = "КартинкаТовара"+НомерКартинки;
		
		ЭтотОбъект[ИмяРеквизита] = ПолучитьНавигационнуюСсылкуКартинки(Выборка.ПрисоединенныйФайл, УникальныйИдентификатор);
		
		Если НомерКартинки = 5 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;		
	
КонецПроцедуры


&НаКлиенте
Функция ПолучитьТекущиеДанныеСтроки()
	
	ТекущиеДанныеНоменклатура = Элементы.ПодборТаблицаНоменклатура.ТекущиеДанные;	
	Если ТекущиеДанныеНоменклатура = Неопределено Тогда
		Возврат Новый Структура;
	КонецЕсли;		
	
	ПодборТекущаяНоменклатура = ТекущиеДанныеНоменклатура.Ссылка;
	ПодборТекущаяХарактеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	ПодборТекущаяЦена = ТекущиеДанныеНоменклатура.Цена;	

	ТекущиеДанныеСтроки = Новый Структура;
	ТекущиеДанныеСтроки.Вставить("ИспользоватьМегапрайс",Объект.ИспользоватьМегапрайс);
	ТекущиеДанныеСтроки.Вставить("Валюта",Объект.Валюта);
	ТекущиеДанныеСтроки.Вставить("Номенклатура",ПодборТекущаяНоменклатура);
	ТекущиеДанныеСтроки.Вставить("ХарактеристикаНоменклатуры",ПодборТекущаяХарактеристика);
	ТекущиеДанныеСтроки.Вставить("ВидЦенНоменклатуры",Объект.ВидЦен);
	ТекущиеДанныеСтроки.Вставить("СкладОтбор",Объект.Склад);
	ТекущиеДанныеСтроки.Вставить("ОпцияПодборСНесколькихСкладов",ОпцияПодборСНесколькихСкладов);
	ТекущиеДанныеСтроки.Вставить("НачалоПериода",Объект.НачалоПериода);
	ТекущиеДанныеСтроки.Вставить("КонецПериода",Объект.КонецПериода);
	ТекущиеДанныеСтроки.Вставить("ЦенаПродажи", ПодборТекущаяЦена);
	ТекущиеДанныеСтроки.Вставить("ОкруглятьЦены", ОкруглятьЦены);
	
	Возврат ТекущиеДанныеСтроки;
	
КонецФункции


&НаСервере
Процедура РасшифровкиПолучитьКартинкуНоменклатуры(ТекущиеДанныеСтроки)
	
	ПодборКартинкаНоменклатуры = ПолучитьКартинкуНоменклатуры(ТекущиеДанныеСтроки.Номенклатура);		
	Если ЗначениеЗаполнено(ПодборКартинкаНоменклатуры) Тогда
		КартинкаНоменклатуры = ПолучитьНавигационнуюСсылкуКартинки(ПодборКартинкаНоменклатуры, УникальныйИдентификатор)
	Иначе
		КартинкаНоменклатуры = "";
	Конецесли;
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкиПолучитьСвойстваНоменклатуры(ТекущиеДанныеСтроки)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СпрНоменклатура.Свойство КАК Свойство,
	|	СпрНоменклатура.Значение КАК Значение
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК СпрНоменклатура
	|ГДЕ
	|	СпрНоменклатура.Ссылка = &ТекНоменклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Свойство";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекНоменклатура", ТекущиеДанныеСтроки.Номенклатура);
	
	СвойстваНоменклатуры.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция РасшифровкиСформироватьОстаткиПоСкладам(ТекущиеДанныеСтроки) Экспорт
	
	ИспользоватьСерииНоменклатуры = Ложь;
	//ИспользоватьСерииНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры");
	
	Если ИспользоватьСерииНоменклатуры Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СвободныеОстатки.Склад.Родитель КАК СкладРодитель,
		|	СвободныеОстатки.Склад КАК Склад,
		|	СвободныеОстатки.Склад.УчетныйВидЦены КАК ВидЦены,
		|	СвободныеОстатки.Серия КАК СерияНоменклатуры,
		|	СУММА(СвободныеОстатки.ВНаличииОстаток) КАК Свободно,
		|	СУММА(СвободныеОстатки.ВНаличииОстаток) КАК ВНаличии,
		|	МАКСИМУМ(ЦеныНоменклатуры.Цена) КАК Цена
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура = &ВыбНоменклатура) КАК СвободныеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура = &ВыбНоменклатура) КАК ЦеныНоменклатуры
		|		ПО (ЦеныНоменклатуры.Номенклатура = СвободныеОстатки.Номенклатура)
		|			И (ЦеныНоменклатуры.Характеристика = СвободныеОстатки.Характеристика)
		|			И (ЦеныНоменклатуры.ВидЦены = СвободныеОстатки.Склад.УчетныйВидЦены)
		|
		|СГРУППИРОВАТЬ ПО
		|	СвободныеОстатки.Склад,
		|	СвободныеОстатки.Склад.Родитель,
		|	СвободныеОстатки.Серия,
		|	СвободныеОстатки.Склад.УчетныйВидЦены
		|
		|УПОРЯДОЧИТЬ ПО
		|	СвободныеОстатки.Склад.Наименование
		|ИТОГИ
		|	СУММА(Свободно),
		|	СУММА(ВНаличии)
		|ПО
		|	СкладРодитель,
		|	Склад,
		|	СерияНоменклатуры";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СвободныеОстатки.Склад.Родитель КАК СкладРодитель,
		|	СвободныеОстатки.Склад КАК Склад,
		|	СвободныеОстатки.Склад.УчетныйВидЦены КАК ВидЦены,
		|	СУММА(СвободныеОстатки.ВНаличииОстаток - СвободныеОстатки.ВРезервеСоСкладаОстаток) КАК Свободно,
		|	СУММА(СвободныеОстатки.ВНаличииОстаток) КАК ВНаличии,
		|	СУММА(СвободныеОстатки.ВРезервеСоСкладаОстаток) КАК ВРезерве,
		|	МАКСИМУМ(ЦеныНоменклатуры.Цена) КАК Цена
		|ИЗ
		|	РегистрНакопления.СвободныеОстатки.Остатки(, Номенклатура = &ВыбНоменклатура) КАК СвободныеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура = &ВыбНоменклатура) КАК ЦеныНоменклатуры
		|		ПО (ЦеныНоменклатуры.Номенклатура = СвободныеОстатки.Номенклатура)
		|			И (ЦеныНоменклатуры.Характеристика = СвободныеОстатки.Характеристика)
		|			И (ЦеныНоменклатуры.ВидЦены = СвободныеОстатки.Склад.УчетныйВидЦены)
		|
		|СГРУППИРОВАТЬ ПО
		|	СвободныеОстатки.Склад,
		|	СвободныеОстатки.Склад.Родитель,
		|	СвободныеОстатки.Склад.УчетныйВидЦены
		|
		|УПОРЯДОЧИТЬ ПО
		|	СвободныеОстатки.Склад.Наименование
		|ИТОГИ
		|	СУММА(Свободно),
		|	СУММА(ВНаличии),
		|	СУММА(ВРезерве)
		|ПО
		|	СкладРодитель,
		|	Склад";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВыбНоменклатура", ТекущиеДанныеСтроки.Номенклатура);
	Запрос.УстановитьПараметр("ВидЦеныНоменклатуры", ТекущиеДанныеСтроки.ВидЦенНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ГруппыСкладов = Новый Массив;
	ТекущиеОстатки = Новый Массив;
	
	ВыборкаСкладРодитель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СкладРодитель");
	Пока ВыборкаСкладРодитель.Следующий() Цикл					
		НоваяСтрока = Новый Структура("СкладРодитель");
		НоваяСтрока.СкладРодитель = ?(ЗначениеЗаполнено(ВыборкаСкладРодитель.СкладРодитель),ВыборкаСкладРодитель.СкладРодитель,Неопределено);
		
		ГруппыСкладов.Добавить(НоваяСтрока);
		
		ВыборкаСклад = ВыборкаСкладРодитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Склад");
		Пока ВыборкаСклад.Следующий() Цикл	
			
			НоваяСтрока = Новый Структура("СкладРодитель, Склад, Характеристика,СерияНоменклатуры, Свободно, ВНаличии, ВРезерве, ВидЦены, Цена");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСклад);
			
			ТекущиеОстатки.Добавить(НоваяСтрока);
		КонецЦикла;	
	КонецЦикла;
	
	Возврат Новый Структура("ГруппыСкладов,ТекущиеОстатки", ГруппыСкладов,ТекущиеОстатки);
	
КонецФункции

&НаСервереБезКонтекста
Функция РасшифровкиСформироватьОстаткиПоСкладамХарактеристики(ТекущиеДанныеСтроки) Экспорт
	
	ИспользоватьСерииНоменклатуры = Ложь;
	//ИспользоватьСерииНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры");
	
	Если ИспользоватьСерииНоменклатуры Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СвободныеОстатки.Характеристика КАК Характеристика,
		|	СвободныеОстатки.Склад КАК Склад,
		|	СвободныеОстатки.Серия КАК СерияНоменклатуры,
		|	СвободныеОстатки.Склад.УчетныйВидЦены КАК ВидЦены,
		|	СУММА(СвободныеОстатки.ВНаличииОстаток) КАК Свободно,
		|	СУММА(СвободныеОстатки.ВНаличииОстаток) КАК ВНаличии,
		|	МАКСИМУМ(ЦеныНоменклатуры.Цена) КАК Цена
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура = &ВыбНоменклатура) КАК СвободныеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				,
		|				Номенклатура = &ВыбНоменклатура) КАК ЦеныНоменклатуры
		|		ПО (ЦеныНоменклатуры.Номенклатура = СвободныеОстатки.Номенклатура)
		|			И (ЦеныНоменклатуры.Характеристика = СвободныеОстатки.Характеристика)
		|			И (ЦеныНоменклатуры.ВидЦены = СвободныеОстатки.Склад.УчетныйВидЦены)
		|
		|СГРУППИРОВАТЬ ПО
		|	СвободныеОстатки.Характеристика,
		|	СвободныеОстатки.Склад,
		|	СвободныеОстатки.Серия
		|
		|УПОРЯДОЧИТЬ ПО
		|	СвободныеОстатки.Характеристика.Наименование
		|ИТОГИ
		|	СУММА(Свободно),
		|	СУММА(ВНаличии),
		|	МАКСИМУМ(Цена)
		|ПО
		|	Характеристика,
		|	Склад,
		|   СерияНоменклатуры";
		
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СвободныеОстатки.Характеристика КАК Характеристика,
		|	СвободныеОстатки.Склад КАК Склад,
		|	СвободныеОстатки.Склад.УчетныйВидЦены КАК ВидЦены,
		|	СУММА(СвободныеОстатки.ВНаличииОстаток - СвободныеОстатки.ВРезервеСоСкладаОстаток) КАК Свободно,
		|	СУММА(СвободныеОстатки.ВНаличииОстаток) КАК ВНаличии,
		|	СУММА(СвободныеОстатки.ВРезервеСоСкладаОстаток) КАК ВРезерве,
		|	МАКСИМУМ(ЦеныНоменклатуры.Цена) КАК Цена
		|ИЗ
		|	РегистрНакопления.СвободныеОстатки.Остатки(
		|			,
		|			Номенклатура = &ВыбНоменклатура) КАК СвободныеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				,
		|				Номенклатура = &ВыбНоменклатура) КАК ЦеныНоменклатуры
		|		ПО (ЦеныНоменклатуры.Номенклатура = СвободныеОстатки.Номенклатура)
		|			И (ЦеныНоменклатуры.Характеристика = СвободныеОстатки.Характеристика)
		|			И (ЦеныНоменклатуры.ВидЦены = СвободныеОстатки.Склад.УчетныйВидЦены)
		|
		|СГРУППИРОВАТЬ ПО
		|	СвободныеОстатки.Характеристика,
		|	СвободныеОстатки.Склад,
		|	СвободныеОстатки.Склад.УчетныйВидЦены
		|
		|УПОРЯДОЧИТЬ ПО
		|	СвободныеОстатки.Характеристика.Наименование
		|ИТОГИ
		|	СУММА(Свободно),
		|	СУММА(ВНаличии),
		|	СУММА(ВРезерве),
		|	МАКСИМУМ(Цена)
		|ПО
		|	Характеристика,
		|	Склад";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВыбНоменклатура", ТекущиеДанныеСтроки.Номенклатура);
	Запрос.УстановитьПараметр("ВидЦеныНоменклатуры", ТекущиеДанныеСтроки.ВидЦенНоменклатуры);
	Запрос.УстановитьПараметр("СкладОтбор", ТекущиеДанныеСтроки.СкладОтбор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ГруппыСкладов = Новый Массив;
	ТекущиеОстатки = Новый Массив;
	
	Выборка1 = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Характеристика");
	Пока Выборка1.Следующий() Цикл			
		Выборка2 = Выборка1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Склад");
		Пока Выборка2.Следующий() Цикл		
			
			НоваяСтрока = Новый Структура("СкладРодитель, Склад, Характеристика, СерияНоменклатуры, Свободно, ВНаличии, ВРезерве, ВидЦены, Цена");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка2);
			
			ТекущиеОстатки.Добавить(НоваяСтрока);
		КонецЦикла;	
	КонецЦикла;	
	
	Возврат Новый Структура("ГруппыСкладов,ТекущиеОстатки", ГруппыСкладов,ТекущиеОстатки);
	
КонецФункции

&НаКлиенте
Процедура РасшифровкиСформироватьОстаткиПоСкладамСервер(ТекущиеДанныеСтроки)
	
	СписокОстаткиПоСкладам.Очистить();
	                                                                                                      	
	Если ИспользоватьХарактеристикиНоменклатуры Тогда
		СтруктураИнформацииОстаткиНаСкладах = РасшифровкиСформироватьОстаткиПоСкладамХарактеристики(ТекущиеДанныеСтроки);
		
		Для Каждого СтрокаТЧ2 Из СтруктураИнформацииОстаткиНаСкладах.ТекущиеОстатки Цикл				
			ТекущийОстатокСклад = СписокОстаткиПоСкладам.Добавить();
			ТекущийОстатокСклад.Склад          = СтрокаТЧ2.Склад;
			ТекущийОстатокСклад.Характеристика = СтрокаТЧ2.Характеристика;			
			ТекущийОстатокСклад.Свободно       = СтрокаТЧ2.Свободно;
			ТекущийОстатокСклад.ВНаличии       = СтрокаТЧ2.ВНаличии;
			ТекущийОстатокСклад.ВРезерве       = СтрокаТЧ2.ВРезерве;
			ТекущийОстатокСклад.ВидЦены        = СтрокаТЧ2.ВидЦены;
			ТекущийОстатокСклад.Цена           = СтрокаТЧ2.Цена;
		КонецЦикла;			
	Иначе
		СтруктураИнформацииОстаткиНаСкладах = РасшифровкиСформироватьОстаткиПоСкладам(ТекущиеДанныеСтроки);
		
		Для Каждого СтрокаТЧ Из СтруктураИнформацииОстаткиНаСкладах.ГруппыСкладов Цикл	
			
			Если ЗначениеЗаполнено(СтрокаТЧ.СкладРодитель) Тогда
				НовыйУзелДерева = СписокОстаткиПоСкладам.Добавить();
				НовыйУзелДерева.Склад       = СтрокаТЧ.СкладРодитель;
				НовыйУзелДерева.СкладГруппа = Истина;
			КонецЕсли;
			
			Для Каждого СтрокаТЧ2 Из СтруктураИнформацииОстаткиНаСкладах.ТекущиеОстатки Цикл	
				Если ЗначениеЗаполнено(СтрокаТЧ.СкладРодитель) Тогда
					Если СтрокаТЧ2.СкладРодитель <> СтрокаТЧ.СкладРодитель Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				ТекущийОстатокСклад = СписокОстаткиПоСкладам.Добавить();
				ТекущийОстатокСклад.Склад          = СтрокаТЧ2.Склад;
				ТекущийОстатокСклад.Характеристика = СтрокаТЧ2.Характеристика;			
				ТекущийОстатокСклад.Свободно       = СтрокаТЧ2.Свободно;
				ТекущийОстатокСклад.ВНаличии       = СтрокаТЧ2.ВНаличии;
				ТекущийОстатокСклад.ВРезерве       = СтрокаТЧ2.ВРезерве;
				ТекущийОстатокСклад.ВидЦены        = СтрокаТЧ2.ВидЦены;
				ТекущийОстатокСклад.Цена           = СтрокаТЧ2.Цена;
			КонецЦикла;	
		КонецЦикла;			
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьДанныеДополнительнойИнформации()
	
	ТекДетализацияСнизу = Элементы.ДетализацияСнизу.ТекущаяСтраница;
	Если ТекДетализацияСнизу = ЗакладкиДетализацияСнизу.ТоварыГруппа Тогда
		Возврат;
	КонецЕсли;

	ТекущиеДанныеНоменклатура = Элементы.ПодборТаблицаНоменклатура.ТекущиеДанные;	
	Если ТекущиеДанныеНоменклатура = Неопределено Тогда
		Возврат;
	КонецЕсли;		
	
	ПодборТекущаяНоменклатура = ТекущиеДанныеНоменклатура.Ссылка;
	ПодборТекущаяЦена = ТекущиеДанныеНоменклатура.Цена;	
	
	ТекущиеДанныеСтроки = ПолучитьТекущиеДанныеСтроки(); 
	
	Если ТекДетализацияСнизу = ЗакладкиДетализацияСнизу.ДетальныеОстатки Тогда
		
		РасшифровкиСформироватьОстаткиПоСкладамСервер(ТекущиеДанныеСтроки);
		
	ИначеЕсли ТекДетализацияСнизу = ЗакладкиДетализацияСнизу.ГрафикДвиженияТоваров Тогда		
		
		ОбновитьТекДетализацияСнизу(20);	
	
	ИначеЕсли ТекДетализацияСнизу = ЗакладкиДетализацияСнизу.ЗаказыПоставщикам Тогда
		
		//ЗАКАЗЫ ПОСТАВЩИКАМ	
		РасшифровкаЗаказыПоставщикам.Очистить();

		СтруктураИнформации = РасшифровкиСформироватьРасшифровкаЗаказыПоставщикам(ТекущиеДанныеСтроки);		
		Для Каждого ВыборкаСтрока Из СтруктураИнформации.ТаблицаРезультат Цикл				
			НоваяСтрока = РасшифровкаЗаказыПоставщикам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаСтрока);
		КонецЦикла;	
						
	ИначеЕсли ТекДетализацияСнизу = ЗакладкиДетализацияСнизу.НоменклатураПоставщиков Тогда
		
		//ЦЕНЫ ПОСТАВЩИКОВ	
		РасшифровкаЦеныПоставщиков.Очистить();

		СтруктураИнформации = РасшифровкиЦеныПоставщиков(ТекущиеДанныеСтроки);		
		Для Каждого ВыборкаСтрока Из СтруктураИнформации.ТаблицаРезультат Цикл				
			НоваяСтрока = РасшифровкаЦеныПоставщиков.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаСтрока);
		КонецЦикла;	

	ИначеЕсли ТекДетализацияСнизу = ЗакладкиДетализацияСнизу.ИнфоПоТовару Тогда
		
		ОбновитьТекДетализацияСнизу(1);	
			
	ИначеЕсли ТекДетализацияСнизу = ЗакладкиДетализацияСнизу.ЗакладкаИсторияЗаказов Тогда		
		
		ОбновитьТекДетализацияСнизу(15);	
		
	ИначеЕсли ТекДетализацияСнизу = ЗакладкиДетализацияСнизу.ЗаказыКлиентов Тогда
		
		ОбновитьТекДетализацияСнизу(2);		
		
	ИначеЕсли ТекДетализацияСнизу = ЗакладкиДетализацияСнизу.Картинки Тогда	
		
		ОбновитьТекДетализацияСнизу(10);
		
	ИначеЕсли ТекДетализацияСнизу = ЗакладкиДетализацияСнизу.Цены Тогда	
		
		//ЦЕНЫ	
		РасшифровкаЦеныНоменклатуры.Очистить();

		СтруктураИнформации = РасшифровкиРасшифровкаЦеныНоменклатуры(ТекущиеДанныеСтроки);			
		ИдентификаторСтроки = "";
		Для Каждого ВыборкаСтрока Из СтруктураИнформации.ТаблицаРезультат Цикл				
			НоваяСтрока = РасшифровкаЦеныНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаСтрока);
			
			Если Объект.ВидЦен = ВыборкаСтрока.ВидЦены Тогда
				ИдентификаторСтроки = НоваяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
		КонецЦикла;		
		Элементы.РасшифровкаЦеныНоменклатуры.ТекущаяСтрока = ИдентификаторСтроки;
			
	КонецЕсли;		
	
КонецПроцедуры


&НаКлиенте
Процедура ПодборТаблицаНоменклатураПриАктивизацииСтроки(Элемент)	
		
	ПодключитьОбработчикОжидания("ОбновитьДанныеДополнительнойИнформации", 0.2, Истина);
	//ОбновитьДанныеДополнительнойИнформации();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодборТаблицаНоменклатураПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	//ТекстЗапроса = 
	//"ВЫБРАТЬ
	//|	мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура КАК Номенклатура,
	//|	СУММА(мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних.Количество) КАК Количество
	//|ИЗ
	//|	РегистрСведений.мегапрайсЦеныНоменклатурыПоставщиков.СрезПоследних(, Номенклатура В (&ВыбНоменклатура)) КАК мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура";
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = ТекстЗапроса;
	//Запрос.УстановитьПараметр("ВыбНоменклатура",Строки.ПолучитьКлючи());
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	СтрокаСписка = Строки[Выборка.Номенклатура];
	//	СтрокаСписка.Данные["ОстаткиПоставщиков"] = Выборка.Количество;
	//	СтрокаСписка.Оформление["ОстаткиПоставщиков"].УстановитьЗначениеПараметра("Формат","ЧЦ=15; ЧДЦ=2; ЧН=-");
	//КонецЦикла;	
	//
	//ТекстЗапроса = 
	//"ВЫБРАТЬ
	//|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	//|	МАКСИМУМ(ЦеныНоменклатуры.Цена) КАК Цена
	//|ИЗ
	//|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура В (&ВыбНоменклатура)) КАК ЦеныНоменклатуры
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЦеныНоменклатуры.Номенклатура";
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = ТекстЗапроса;
	//Запрос.УстановитьПараметр("ВыбНоменклатура",Строки.ПолучитьКлючи());
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	СтрокаСписка = Строки[Выборка.Номенклатура];
	//	СтрокаСписка.Данные["Цена"] = Выборка.Цена;
	//	СтрокаСписка.Оформление["Цена"].УстановитьЗначениеПараметра("Формат","ЧЦ=15; ЧДЦ=2; ЧН=-");
	//КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура СтраницыСписокНоменклатурыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	РасшифровкаИсторияПоступлений.Очистить();
	РасшифровкаИсторияПродажНоменклатуры.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДопИнформацияПриСменеСтраницы(Элемент, ТекущаяСтраница)
			
	ПодключитьОбработчикОжидания("ОбновитьДанныеДополнительнойИнформации", 0.1, Истина);
	//ОбновитьДанныеДополнительнойИнформации();
	
КонецПроцедуры


&НаКлиенте
Процедура СписокЗаказыКлиентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	CтандартнаяОбработка = Ложь;
	ОткрытьЗначение(Элемент.ТекущиеДанные.ЗаказКлиента);
	
КонецПроцедуры

&НаСервере
Процедура ПоследниеПродажиПартнеруУстановитьОтборПоТоварамСервер(Включить)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	ПодборТаблицаНоменклатура,
	"Ссылка",
	СписокПоследниеПродажиПартнеру.Выгрузить(,"Номенклатура").ВыгрузитьКолонку("Номенклатура"),
	ВидСравненияКомпоновкиДанных.ВСписке, ,Включить);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоследниеПродажиПартнеруУстановитьОтборПоТоварам(Команда)
	
	ПоследниеПродажиПартнеруУстановитьОтборПоТоварамСервер(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоследниеПродажиПартнеруОтключитьОтборПоТоварам(Команда)
	
	ПоследниеПродажиПартнеруУстановитьОтборПоТоварамСервер(Ложь);
	
КонецПроцедуры


&НаСервере
Процедура РасшифровкиСформироватьДосьеКоммерческиеПредложения(ДосьеКоммерческиеПредложения,ПараметрыЗапроса) 
	
	ДосьеКоммерческиеПредложения.Очистить();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КоммерческоеПредложениеКлиенту.Ссылка.Дата КАК Дата,
	|	КоммерческоеПредложениеКлиенту.Ссылка КАК Сделка,
	|	КоммерческоеПредложениеКлиенту.Номенклатура КАК Номенклатура,
	|	КоммерческоеПредложениеКлиенту.Характеристика КАК ХарактеристикаНоменклатуры,
	|	СУММА(КоммерческоеПредложениеКлиенту.Количество) КАК Количество,
	|	МАКСИМУМ(КоммерческоеПредложениеКлиенту.Сумма / КоммерческоеПредложениеКлиенту.Количество) КАК Цена,
	|	КоммерческоеПредложениеКлиенту.ТекстовоеОписание КАК Описание
	|ИЗ
	|	Документ.КоммерческоеПредложениеКлиенту.Товары КАК КоммерческоеПредложениеКлиенту
	|ГДЕ
	|	КоммерческоеПредложениеКлиенту.Ссылка.Партнер = &ВыбПартнер
	|	И КоммерческоеПредложениеКлиенту.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И КоммерческоеПредложениеКлиенту.Ссылка.Проведен = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	КоммерческоеПредложениеКлиенту.Ссылка.Дата,
	|	КоммерческоеПредложениеКлиенту.Ссылка,
	|	КоммерческоеПредложениеКлиенту.Номенклатура,
	|	КоммерческоеПредложениеКлиенту.Характеристика,
	|	КоммерческоеПредложениеКлиенту.ТекстовоеОписание
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	//Запрос.УстановитьПараметр("Партнер", ПараметрыЗапроса.Партнер);
	Запрос.УстановитьПараметр("ВыбПартнер",ПараметрыЗапроса.Партнер);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПараметрыЗапроса.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПараметрыЗапроса.КонецПериода));
	
	ДосьеКоммерческиеПредложения = Запрос.Выполнить().Выгрузить();

КонецПроцедуры


&НаСервере
Процедура РасшифровкиСформироватьПоследниеПродажиПартнеруСервер()
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Партнер", Объект.Партнер);
	СтруктураПараметры.Вставить("НачалоПериода",  Объект.НачалоПериода);
	СтруктураПараметры.Вставить("КонецПериода",  Объект.КонецПериода);
	
	ТаблицаСписокПоследниеПродажиПартнеру = РеквизитФормыВЗначение("СписокПоследниеПродажиПартнеру");
	РасшифровкиСформироватьПоследниеПродажиПартнеру(ТаблицаСписокПоследниеПродажиПартнеру,СтруктураПараметры);
	ЗначениеВРеквизитФормы(ТаблицаСписокПоследниеПродажиПартнеру, "СписокПоследниеПродажиПартнеру");
	
	ТаблицаДосьеКоммерческиеПредложения = РеквизитФормыВЗначение("ДосьеКоммерческиеПредложения");
	РасшифровкиСформироватьДосьеКоммерческиеПредложения(ТаблицаДосьеКоммерческиеПредложения,СтруктураПараметры);
	ЗначениеВРеквизитФормы(ТаблицаДосьеКоммерческиеПредложения, "ДосьеКоммерческиеПредложения");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоследниеПродажиПартнеруЗаполнить(Команда)
	
	РасшифровкиСформироватьПоследниеПродажиПартнеруСервер();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНавигационнуюСсылкуКартинки(ФайлКартинки, ИдентификаторФормы)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат ПрисоединенныеФайлы.ПолучитьДанныеФайла(ФайлКартинки).СсылкаНаДвоичныеДанныеФайла;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОписаниеНоменклатуры(Номенклатура)
	
	ОписаниеНоменклатуры = Номенклатура.Описание;
	
	Возврат ОписаниеНоменклатуры;
	
КонецФункции

&НаСервере
Функция ПолучитьКартинкуНоменклатуры(Номенклатура)
	
	//УстановитьПривилегированныйРежим(Истина);
	
	ФайлКартинкиНоменклатуры = Номенклатура.ФайлКартинки;
	
	Возврат ФайлКартинкиНоменклатуры;
	
КонецФункции

//============================================================================
// КОРЗИНА

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Объект)
	
	//СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);

	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	//СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
	СтруктураДействий.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействий.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	СтруктураДействий.Вставить("ПересчитатьВесОбъем");
	
КонецПроцедуры

&НаСервере
Функция ДобавитьВКорзинуНаСервере(СтруктураПараметры, КоличествоУпаковок, НовыеСтроки)
	
	ТекстОповещенияИтог = "";
	
	Для Каждого НоваяСтрока Из НовыеСтроки Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",               СтруктураПараметры.Номенклатура);
		Отбор.Вставить("Характеристика",             СтруктураПараметры.Характеристика);
		//Отбор.Вставить("ХарактеристикиИспользуются", СтруктураПараметры.ХарактеристикиИспользуются);
		Отбор.Вставить("Упаковка",                   НоваяСтрока.Упаковка);
		Отбор.Вставить("Цена",                       НоваяСтрока.Цена);
		Отбор.Вставить("ВидЦены",                    НоваяСтрока.ВидЦены);
		Отбор.Вставить("Склад",                      НоваяСтрока.Склад);
		Если ИспользоватьДатыОтгрузки Тогда
			Отбор.Вставить("ДатаОтгрузки", НоваяСтрока.ДатаОтгрузки);
		КонецЕсли;
		Отбор.Вставить("СрокПоставки",               0);
		
		РезультатПоиска = Объект.Товары.НайтиСтроки(Отбор);
		Если РезультатПоиска.Количество() = 0 Тогда		
			ТекущаяСтрока = Объект.Товары.Добавить();
			ТекущаяСтрока.ВариантОбеспечения = СтруктураПараметры.ВариантОбеспечения;
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Отбор);			
		Иначе			
			ТекущаяСтрока = РезультатПоиска[0];
		КонецЕсли;
		
		Если СтруктураПараметры.НеЗаполнятьВидЦеныВКорзину Тогда
			ТекущаяСтрока.ВидЦены = "";
		КонецЕсли;
		ТекущаяСтрока.КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковок + НоваяСтрока.КоличествоУпаковок;
		
		СтруктураДействий = Новый Структура;
		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,Объект);
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
		
		ТекстОповещения = НСтр("ru = 'Товар %%Товар%% стоимостью %%Цена%% %%Валюта%% в количестве %%Количество%% %%ЕдиницаИзмерения%% добавлен в корзину'");
		ТекстОповещения = СтрЗаменить(ТекстОповещения, "%%Товар%%",              Строка(ТекущаяСтрока.Номенклатура) + ?(ЗначениеЗаполнено(СтруктураПараметры.Характеристика)," ("+СтруктураПараметры.Характеристика+")",""));
		ТекстОповещения = СтрЗаменить(ТекстОповещения, "%%Цена%%",               ТекущаяСтрока.Цена);
		ТекстОповещения = СтрЗаменить(ТекстОповещения, "%%Валюта%%",             Объект.Валюта);
		ТекстОповещения = СтрЗаменить(ТекстОповещения, "%%ЕдиницаИзмерения%%",   ?(ЗначениеЗаполнено(СтруктураПараметры.Упаковка),СтруктураПараметры.Упаковка,НСтр("ru = 'ед.'")));
		ТекстОповещения = СтрЗаменить(ТекстОповещения, "%%Количество%%", КоличествоУпаковок);
		
		ТекстОповещенияИтог = ?(ТекстОповещенияИтог = "", "", Символы.ПС) + ТекстОповещения;
		
	КонецЦикла;
	
	Если НовыеСтроки.Количество() > 0 Тогда
		
		// Активизируем текущую строку табличной части
		Элементы.Товары.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
		
	КонецЕсли;
	
	Возврат ТекстОповещенияИтог;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьВКорзину(СтруктураПараметры, КоличествоУпаковок)
	
	НовыеСтроки = Новый Массив;
	
	Если ОкруглятьЦены Тогда
		ЦенаПодбора = Окр(СтруктураПараметры.Цена,0);
	Иначе
		ЦенаПодбора = СтруктураПараметры.Цена;
	КонецЕсли;
	
	Если ЗапрашиватьКоличество Тогда		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВариантОбеспечения", СтруктураПараметры.ВариантОбеспечения);
		ПараметрыФормы.Вставить("Номенклатура",   СтруктураПараметры.Номенклатура);
		ПараметрыФормы.Вставить("Характеристика", СтруктураПараметры.Характеристика);
		ПараметрыФормы.Вставить("ВидЦены",        СтруктураПараметры.ВидЦены);
		ПараметрыФормы.Вставить("Упаковка",       СтруктураПараметры.Упаковка);	
		ПараметрыФормы.Вставить("Цена",           ЦенаПодбора);
		ПараметрыФормы.Вставить("Дата",           Дата);
		ПараметрыФормы.Вставить("Валюта",         Объект.Валюта);
		ПараметрыФормы.Вставить("РедактироватьЦену",    Истина);
		ПараметрыФормы.Вставить("РедактироватьВидЦены", Истина);
		ПараметрыФормы.Вставить("Склад",                    СтруктураПараметры.Склад);
		ПараметрыФормы.Вставить("Склады",                   Склады.ВыгрузитьЗначения());
		ПараметрыФормы.Вставить("ДатаОтгрузки",             ТекущаяДата());
		//ПараметрыФормы.Вставить("ЭтоУслуга", СтруктураПараметры.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));
		ПараметрыФормы.Вставить("ИспользоватьДатыОтгрузки", ИспользоватьДатыОтгрузки);
		
		Попытка
			МассивСтруктур = ОткрытьФормуМодально("ВнешняяОбработка.мегапрайсРасширенныйПомощникПродаж.Форма.ЗапросКоличества", ПараметрыФормы, ЭтаФорма);
		Исключение
			МассивСтруктур = ОткрытьФормуМодально("Обработка.мегапрайсРасширенныйПомощникПродаж.Форма.ЗапросКоличества", ПараметрыФормы, ЭтаФорма);
		КонецПопытки;
		
		Если МассивСтруктур <> Неопределено Тогда
			Для Каждого ЭлементМассива Из МассивСтруктур Цикл				
				НоваяСтрока = Новый Структура;
				НоваяСтрока.Вставить("ВариантОбеспечения",         СтруктураПараметры.ВариантОбеспечения);
				НоваяСтрока.Вставить("Номенклатура",               СтруктураПараметры.Номенклатура);
				НоваяСтрока.Вставить("Характеристика",             СтруктураПараметры.Характеристика);
				НоваяСтрока.Вставить("ХарактеристикиИспользуются", СтруктураПараметры.ХарактеристикиИспользуются);
				НоваяСтрока.Вставить("Упаковка",                   ЭлементМассива.Упаковка);
				НоваяСтрока.Вставить("Цена",                       ЭлементМассива.Цена);
				НоваяСтрока.Вставить("ВидЦены",                    ЭлементМассива.ВидЦены);
				НоваяСтрока.Вставить("Склад",                      СтруктураПараметры.Склад);
				НоваяСтрока.Вставить("ДатаОтгрузки",               ЭлементМассива.ДатаОтгрузки);
				НоваяСтрока.Вставить("КоличествоУпаковок",         ЭлементМассива.КоличествоУпаковок);
				НоваяСтрока.Вставить("СрокПоставки",               0);
				НовыеСтроки.Добавить(НоваяСтрока);				
			КонецЦикла;			
		Иначе
			Возврат;
		КонецЕсли;
	Иначе
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("ВариантОбеспечения",         СтруктураПараметры.ВариантОбеспечения);
		НоваяСтрока.Вставить("Номенклатура",               СтруктураПараметры.Номенклатура);
		НоваяСтрока.Вставить("Характеристика",             СтруктураПараметры.Характеристика);
		НоваяСтрока.Вставить("ХарактеристикиИспользуются", СтруктураПараметры.ХарактеристикиИспользуются);
		НоваяСтрока.Вставить("Упаковка",                   СтруктураПараметры.Упаковка);
		НоваяСтрока.Вставить("Цена",                       ЦенаПодбора);
		НоваяСтрока.Вставить("ВидЦены",                    СтруктураПараметры.ВидЦены);
		НоваяСтрока.Вставить("Склад",                      СтруктураПараметры.Склад);
		НоваяСтрока.Вставить("ДатаОтгрузки",               СтруктураПараметры.ДатаОтгрузки);
		НоваяСтрока.Вставить("КоличествоУпаковок",         КоличествоУпаковок);
		НоваяСтрока.Вставить("СрокПоставки",               0);
		НовыеСтроки.Добавить(НоваяСтрока);
	КонецЕсли;
	
	ДобавитьВКорзинуНаСервере(СтруктураПараметры, КоличествоУпаковок, НовыеСтроки);
	
	ЭтаФорма.ТекущийЭлемент = ЭлементыПодборТаблицаНоменклатура;
	Элементы.ДетализацияСнизу.ТекущаяСтраница = Элементы.ДетализацияСнизу.ПодчиненныеЭлементы.ТоварыГруппа;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварПодЗаказ(Команда)
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ВариантОбеспечения", ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Требуется"));	
	СтруктураПараметры.Вставить("Номенклатура", ПодборТекущаяНоменклатура);	
	ТекущиеДанныеХарактеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	СтруктураПараметры.Вставить("ХарактеристикиИспользуются", Ложь);
	СтруктураПараметры.Вставить("Характеристика", ТекущиеДанныеХарактеристика);	
	ПолучитьЦенуТекущегоТовара(ПодборТекущаяНоменклатура, ТекущиеДанныеХарактеристика);
	СтруктураПараметры.Вставить("Упаковка", ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка"));
	
	//ПОДБОР ЦЕНЫ
	СтруктураПараметры.Вставить("НеЗаполнятьВидЦеныВКорзину", НеЗаполнятьВидЦеныВКорзину);
	СтруктураПараметры.Вставить("ВидЦены", Объект.ВидЦен);
	СтруктураПараметры.Вставить("Цена", ПодборТекущаяЦена);
	
	//ТекущиеДанныеЦен = Элементы.РасшифровкаЦеныНоменклатуры.ТекущиеДанные;	
	//Если НЕ ТекущиеДанныеЦен = Неопределено Тогда	
	//	СтруктураПараметры.Вставить("ВидЦены", ТекущиеДанныеЦен.ВидЦены);
	//	СтруктураПараметры.Вставить("Цена", ТекущиеДанныеЦен.ЦенаПересчет);
	//КОнецЕсли;		
	СтруктураПараметры.Вставить("Склад", Объект.Склад);
	СтруктураПараметры.Вставить("ДатаОтгрузки", ТекущаяДата());
	
	ДобавитьВКорзину(СтруктураПараметры, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварПодЗаказОбособленно(Команда)
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ВариантОбеспечения", ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Обособленно"));	
	СтруктураПараметры.Вставить("Номенклатура", ПодборТекущаяНоменклатура);	
	ТекущиеДанныеХарактеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	СтруктураПараметры.Вставить("ХарактеристикиИспользуются", Ложь);
	СтруктураПараметры.Вставить("Характеристика", ТекущиеДанныеХарактеристика);	
	ПолучитьЦенуТекущегоТовара(ПодборТекущаяНоменклатура, ТекущиеДанныеХарактеристика);
	СтруктураПараметры.Вставить("Упаковка", ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка"));
	
	//ПОДБОР ЦЕНЫ
	СтруктураПараметры.Вставить("НеЗаполнятьВидЦеныВКорзину", НеЗаполнятьВидЦеныВКорзину);
	СтруктураПараметры.Вставить("ВидЦены", Объект.ВидЦен);
	СтруктураПараметры.Вставить("Цена", ПодборТекущаяЦена);
	
	//ТекущиеДанныеЦен = Элементы.РасшифровкаЦеныНоменклатуры.ТекущиеДанные;	
	//Если НЕ ТекущиеДанныеЦен = Неопределено Тогда	
	//	СтруктураПараметры.Вставить("ВидЦены", ТекущиеДанныеЦен.ВидЦены);
	//	СтруктураПараметры.Вставить("Цена", ТекущиеДанныеЦен.ЦенаПересчет);
	//КОнецЕсли;		
	СтруктураПараметры.Вставить("Склад", Объект.Склад);
	СтруктураПараметры.Вставить("ДатаОтгрузки", ТекущаяДата());
	
	ДобавитьВКорзину(СтруктураПараметры, 1);
	
КонецПроцедуры


&НаКлиенте
Процедура КорзинаНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу",    ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	Если ЗначениеЗаполнено(Объект.Соглашение) Тогда
		
		СтруктураЗаполненияЦены = Новый Структура;
		СтруктураЗаполненияЦены.Вставить("Дата",       ТекущаяДата());
		СтруктураЗаполненияЦены.Вставить("Валюта",     Объект.Валюта);
		СтруктураЗаполненияЦены.Вставить("Соглашение", Объект.Соглашение);
		СтруктураЗаполненияЦены.Вставить("Ссылка",     Неопределено);
		
		СтруктураДействий.Вставить("ЗаполнитьУсловияПродаж", СтруктураЗаполненияЦены);
		
	Иначе
		
		СтруктураЗаполненияЦены = Новый Структура;
		СтруктураЗаполненияЦены.Вставить("Дата",   ТекущаяДата());
		СтруктураЗаполненияЦены.Вставить("Валюта", Объект.Валюта);
		
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", СтруктураЗаполненияЦены);
		
	КонецЕсли;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,Объект);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура КонрзинаВариантОбеспеченияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияУТКлиент.ЗаполнитьСписокВыбораВариантаОбеспечения(
	Элементы.Товары.ТекущиеДанные,
	ДанныеВыбора,
	СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КорзинаХарактеристикаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	Если ЗначениеЗаполнено(Объект.Соглашение) Тогда
		
		СтруктураЗаполненияЦены = Новый Структура;
		СтруктураЗаполненияЦены.Вставить("Дата",       ТекущаяДата());
		СтруктураЗаполненияЦены.Вставить("Валюта",     Объект.Валюта);
		СтруктураЗаполненияЦены.Вставить("Соглашение", Объект.Соглашение);
		СтруктураЗаполненияЦены.Вставить("Ссылка",     Неопределено);
		
		СтруктураДействий.Вставить("ЗаполнитьУсловияПродаж", СтруктураЗаполненияЦены);
		
	Иначе
		
		СтруктураЗаполненияЦены = Новый Структура;
		СтруктураЗаполненияЦены.Вставить("Дата",   ТекущаяДата());
		СтруктураЗаполненияЦены.Вставить("Валюта", Объект.Валюта);
		
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", СтруктураЗаполненияЦены);
		
	КонецЕсли;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,Объект);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура КорзинаУпаковкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	Если ТекущаяСтрока.Количество > 0 Тогда
		СтруктураДействий.Вставить("ПересчитатьЦенуЗаУпаковку", ТекущаяСтрока.Количество);
	ИначеЕсли ЗначениеЗаполнено(Объект.Соглашение) Тогда
		
		СтруктураЗаполненияЦены = Новый Структура;
		СтруктураЗаполненияЦены.Вставить("Дата",       ТекущаяДата());
		СтруктураЗаполненияЦены.Вставить("Валюта",     Объект.Валюта);
		СтруктураЗаполненияЦены.Вставить("Соглашение", Объект.Соглашение);
		СтруктураЗаполненияЦены.Вставить("Ссылка",     Неопределено);
		
		СтруктураДействий.Вставить("ЗаполнитьУсловияПродаж", СтруктураЗаполненияЦены);
	ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.ВидЦены) Тогда
		
		СтруктураЗаполненияЦены = Новый Структура;
		СтруктураЗаполненияЦены.Вставить("Дата",   ТекущаяДата());
		СтруктураЗаполненияЦены.Вставить("Валюта", Объект.Валюта);
		
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", СтруктураЗаполненияЦены);
	КонецЕсли;
	
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура КорзинаВидЦеныПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураЗаполненияЦены = Новый Структура;
	СтруктураЗаполненияЦены.Вставить("Дата",   ТекущаяДата());
	СтруктураЗаполненияЦены.Вставить("Валюта", Объект.Валюта);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", СтруктураЗаполненияЦены);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура КорзинаКоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,Объект);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура КорзинаЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура КорзинаСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаЦены  = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаЦеныСкидкиВПродажахВТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьЦенуСкидкуПоСуммеВПродажах", СтруктураПересчетаЦены);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяПродажа(Команда)
	
	Объект.Товары.Очистить();
	
	Объект.Партнер = "";
	Объект.Контрагент = "";
	Объект.Соглашение = "";
	Объект.Договор = "";
	КонтрагентПриИзменении();
	
	Элементы.СтраницыСписокНоменклатуры.ТекущаяСтраница = Элементы.СтраницыСписокНоменклатуры.ПодчиненныеЭлементы.Документ; 
	
КонецПроцедуры

&НаСервере
Процедура КорзинаУстановитьОтборПоТоварамСервер(Включить)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	ПодборТаблицаНоменклатура,
	"Ссылка",
	Объект.Товары.Выгрузить(,"Номенклатура").ВыгрузитьКолонку("Номенклатура"),
	ВидСравненияКомпоновкиДанных.ВСписке, ,Включить);
	
КонецПроцедуры

&НаКлиенте
Процедура КорзинаУстановитьОтборПоТоварам(Команда)
	
	КорзинаУстановитьОтборПоТоварамСервер(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КорзинаОтключитьОтборПоТоварам(Команда)
	
	КорзинаУстановитьОтборПоТоварамСервер(Ложь);
	
КонецПроцедуры

//============================================================================
// ФОРМИРОВАНИЕ ДОКУМЕНТОВ

&НаКлиенте
Процедура СоздатьДокумент(Команда)
		
	Если Объект.ВидОперации = "Заказ покупателя" Тогда
		
		МассивДокументов = мЗаказПокупателя();
		Для Каждого Строка Из МассивДокументов Цикл
			ФормаДока = ПолучитьФорму("Документ.ЗаказКлиента.Форма.ФормаДокумента", Новый Структура("Ключ", Строка));    
			ФормаДока.Открыть();
		КонецЦикла;
		
	ИначеЕсли Объект.ВидОперации = "Реализация" Тогда
		
		МассивДокументов = мРеализацияТоваров();
		Для Каждого Строка Из МассивДокументов Цикл
			ФормаДока = ПолучитьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента", Новый Структура("Ключ", Строка));    
			ФормаДока.Открыть();
		КонецЦикла;
		
	ИначеЕсли Объект.ВидОперации = "Коммерческое предложение" Тогда
		
		МассивДокументов = мКоммерческоеПредложение();
		Для Каждого Строка Из МассивДокументов Цикл
			ФормаДока = ПолучитьФорму("Документ.КоммерческоеПредложениеКлиенту.Форма.ФормаДокумента", Новый Структура("Ключ", Строка));    
			ФормаДока.Открыть();
		КонецЦикла;
		
	ИначеЕсли Объект.ВидОперации = "Установка цен номенклатуры" Тогда
		
		МассивДокументов = мУстановкаЦенНоменклатуры();
		Для Каждого Строка Из МассивДокументов Цикл
			ФормаДока = ПолучитьФорму("Документ.УстановкаЦенНоменклатуры.Форма.ФормаДокумента", Новый Структура("Ключ", Строка));    
			ФормаДока.Открыть();
		КонецЦикла;
	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция мКоммерческоеПредложение()
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивДокументов = Новый Массив;
	
	Если Объект.РазбиватьДокументыПоСкладам Тогда
		
		Объект.Товары.Сортировать("Организация,Склад");
		
		НовыйДокумент = Документы.КоммерческоеПредложениеКлиенту.ПустаяСсылка();
		
		ВремОрганизация = Справочники.Организации.ПустаяСсылка();
		ВремРазмещение = Справочники.Склады.ПустаяСсылка();
		
		ТаблицаРазделения = Объект.Товары.Выгрузить();
		ТаблицаРазделения.Свернуть("Организация,Склад");
		
		Для Каждого Шапка Из ТаблицаРазделения Цикл		
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Организация", Шапка.Организация);
			ПараметрыОтбора.Вставить("Склад", Шапка.Склад);
			
			ТаблЧасть = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
			
			НовыйДокумент = Документы.КоммерческоеПредложениеКлиенту.СоздатьДокумент(); 
			НовыйДокумент.Дата        = ТекущаяДата();
			НовыйДокумент.Комментарий = "";
			НовыйДокумент.Организация = Объект.Организация;
			НовыйДокумент.ХозяйственнаяОперация = Объект.ХозяйственнаяОперация;
			НовыйДокумент.Статус      = Перечисления.СтатусыКоммерческихПредложенийКлиентам.Действует;
			НовыйДокумент.Согласован  = Истина;
			НовыйДокумент.Менеджер    = ПараметрыСеанса.ТекущийПользователь;
			НовыйДокумент.Партнер     = Объект.Партнер;
			НовыйДокумент.Соглашение  = Объект.Соглашение;
						
			Если ЗначениеЗаполнено(НовыйДокумент.Соглашение) Тогда
				Попытка //113
					НовыйДокумент.ЗаполнитьУсловияПродажПоСоглашению();
				Исключение //112
					НовыйДокумент.ЗаполнитьУсловияПродажПоCоглашению();
				КонецПопытки;			
			Иначе
				НовыйДокумент.ЗаполнитьУсловияПродажПоУмолчанию();
			КонецЕсли;
			
			НовыйДокумент.Валюта      = Объект.Валюта;
			НовыйДокумент.Склад       = Шапка.Склад;			
			
			Для Каждого Стр из ТаблЧасть Цикл					
				СтрокаТЧ = НовыйДокумент.Товары.Добавить();
				СтрокаТЧ.Номенклатура     = Стр.Номенклатура;
				СтрокаТЧ.Характеристика   = Стр.Характеристика;
				СтрокаТЧ.Упаковка         = Стр.Упаковка;
				СтрокаТЧ.Количество       = Стр.Количество;
				СтрокаТЧ.КоличествоУпаковок = Стр.КоличествоУпаковок;
				СтрокаТЧ.ВидЦены          = Объект.ВидЦен;
				СтрокаТЧ.Цена             = Стр.Цена;
				СтрокаТЧ.Сумма            = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
			КонецЦикла;
			
			//СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент);
			СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент);
			
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС",Новый Структура("НалогообложениеНДС, Дата", НовыйДокумент.НалогообложениеНДС, НовыйДокумент.Дата));
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
			СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
			СтруктураДействий.Вставить("ПересчитатьСумму");
			СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
			СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
			
			ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(НовыйДокумент.Товары, СтруктураДействий,Неопределено);
			
			НовыйДокумент.Записать();
			МассивДокументов.Добавить(НовыйДокумент.Ссылка);
		КонецЦикла;
		
	Иначе
		
		НовыйДокумент = Документы.КоммерческоеПредложениеКлиенту.СоздатьДокумент(); 
		НовыйДокумент.Дата        = ТекущаяДата();
		НовыйДокумент.Комментарий = "";
		НовыйДокумент.ХозяйственнаяОперация = Объект.ХозяйственнаяОперация;
		НовыйДокумент.Статус      = Перечисления.СтатусыКоммерческихПредложенийКлиентам.Действует;
		НовыйДокумент.Согласован  = Истина;
		НовыйДокумент.Менеджер    = ПараметрыСеанса.ТекущийПользователь;
		НовыйДокумент.Организация = Объект.Организация;
		НовыйДокумент.Партнер     = Объект.Партнер;
		НовыйДокумент.Соглашение  = Объект.Соглашение;
				
		Если ЗначениеЗаполнено(НовыйДокумент.Соглашение) Тогда
			Попытка //113
				НовыйДокумент.ЗаполнитьУсловияПродажПоСоглашению();
			Исключение //112
				НовыйДокумент.ЗаполнитьУсловияПродажПоCоглашению();
			КонецПопытки;			
		Иначе
			НовыйДокумент.ЗаполнитьУсловияПродажПоУмолчанию();
		КонецЕсли;
				
		НовыйДокумент.Валюта      = Объект.Валюта;
		НовыйДокумент.Склад       = Объект.Склад;

		Для Каждого Стр из Объект.Товары Цикл					
			СтрокаТЧ = НовыйДокумент.Товары.Добавить();
			СтрокаТЧ.Номенклатура     = Стр.Номенклатура;
			СтрокаТЧ.Характеристика   = Стр.Характеристика;
			СтрокаТЧ.Упаковка         = Стр.Упаковка;
			СтрокаТЧ.Количество       = Стр.Количество;
			СтрокаТЧ.КоличествоУпаковок = Стр.Количество;
			СтрокаТЧ.ВидЦены          = Объект.ВидЦен;
			СтрокаТЧ.Цена             = Стр.Цена;
			СтрокаТЧ.Сумма            = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
		КонецЦикла;
		
		//СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент);
		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС",Новый Структура("НалогообложениеНДС, Дата", НовыйДокумент.НалогообложениеНДС, НовыйДокумент.Дата));
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
		
		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(НовыйДокумент.Товары, СтруктураДействий,Неопределено);
		
		НовыйДокумент.Записать();
		МассивДокументов.Добавить(НовыйДокумент.Ссылка);
		
	КонецЕсли;
	
	Возврат МассивДокументов;
	
КонецФункции

&НаСервере
Функция мЗаказПокупателя()
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивДокументов = Новый Массив;
	
	Если Объект.РазбиватьДокументыПоСкладам Тогда
		
		Объект.Товары.Сортировать("Организация,Склад");
		
		НовыйДокумент = Документы.ЗаказКлиента.ПустаяСсылка();
		
		ВремОрганизация = Справочники.Организации.ПустаяСсылка();
		ВремРазмещение = Справочники.Склады.ПустаяСсылка();
		
		ТаблицаРазделения = Объект.Товары.Выгрузить();
		ТаблицаРазделения.Свернуть("Организация,Склад");
		
		Для Каждого Шапка Из ТаблицаРазделения Цикл		
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Организация", Шапка.Организация);
			ПараметрыОтбора.Вставить("Склад", Шапка.Склад);
			
			ТаблЧасть = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
			
			НовыйДокумент = Документы.ЗаказКлиента.СоздатьДокумент(); 
			НовыйДокумент.Дата        = ТекущаяДата();
			НовыйДокумент.Организация = Объект.Организация;
			НовыйДокумент.Партнер     = Объект.Партнер;
			НовыйДокумент.Соглашение  = Объект.Соглашение;   
			НовыйДокумент.Контрагент  = Объект.Контрагент;
			НовыйДокумент.Договор     = Объект.Договор;
			
			ПартнерыИКонтрагенты.ЗаполнитьКонтактноеЛицоПартнераПоУмолчанию(НовыйДокумент.Партнер, НовыйДокумент.КонтактноеЛицо);
						
			Если ЗначениеЗаполнено(НовыйДокумент.Соглашение) Тогда
				Попытка //113
					НовыйДокумент.ЗаполнитьУсловияПродажПоСоглашению();
				Исключение //112
					НовыйДокумент.ЗаполнитьУсловияПродажПоCоглашению();
				КонецПопытки;			
			Иначе
				НовыйДокумент.ЗаполнитьУсловияПродажПоУмолчанию();
			КонецЕсли;
			
			НовыйДокумент.ХозяйственнаяОперация = Объект.ХозяйственнаяОперация;
			НовыйДокумент.СпособДоставки = Объект.СпособДоставки;
			НовыйДокумент.ЗонаДоставки = Объект.ЗонаДоставки;
			НовыйДокумент.ВремяДоставкиС = Объект.ВремяДоставкиС;
			НовыйДокумент.ВремяДоставкиПо = Объект.ВремяДоставкиПо;
			НовыйДокумент.ДатаОтгрузки = Объект.ДатаОтгрузки;
			НовыйДокумент.ДополнительнаяИнформацияПоДоставке = Объект.ДополнительнаяИнформацияПоДоставке;
			
			НовыйДокумент.Статус      = Объект.СтатусЗаказаКлиента;
			НовыйДокумент.Согласован  = Истина;
			НовыйДокумент.Менеджер    = Объект.Менеджер;
			НовыйДокумент.ДатаСогласования = ТекущаяДата();

			НовыйДокумент.Валюта      = Объект.Валюта;
			НовыйДокумент.Приоритет   = Объект.Приоритет;
			НовыйДокумент.Склад       = Шапка.Склад;
			НовыйДокумент.Подразделение = Объект.Подразделение;
			НовыйДокумент.ЖелаемаяДатаОтгрузки = Объект.ДатаОтгрузки;
			
			НовыйДокумент.Комментарий = "";
			
			Для Каждого Стр из ТаблЧасть Цикл					
				СтрокаТЧ = НовыйДокумент.Товары.Добавить();
				СТрокаТЧ.ВариантОбеспечения = Стр.ВариантОбеспечения;
				СтрокаТЧ.Номенклатура     = Стр.Номенклатура;
				СтрокаТЧ.Характеристика   = Стр.Характеристика;
				СтрокаТЧ.Упаковка         = Стр.Упаковка;
				СтрокаТЧ.Количество       = Стр.Количество;
				СтрокаТЧ.КоличествоУпаковок = Стр.Количество;
				СтрокаТЧ.ВидЦены          = Стр.ВидЦены;
				СтрокаТЧ.Цена             = Стр.Цена;
				СтрокаТЧ.Сумма            = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
				СтрокаТЧ.Склад            = Шапка.Склад;
				СтрокаТЧ.СрокПоставки     = 1;
				СтрокаТЧ.ДатаОтгрузки     = Объект.ДатаОтгрузки;
			КонецЦикла;
			
			//СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент);
			СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент);
			
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС",Новый Структура("НалогообложениеНДС, Дата", НовыйДокумент.НалогообложениеНДС, НовыйДокумент.Дата));
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
			СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
			СтруктураДействий.Вставить("ПересчитатьСумму");
			СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
			СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
			
			ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(НовыйДокумент.Товары, СтруктураДействий,Неопределено);
			
			НовыйДокумент.ЗаполнитьЭтапыГрафикаОплаты();
			
			НовыйДокумент.Записать();
			МассивДокументов.Добавить(НовыйДокумент.Ссылка);
		КонецЦикла;
		
	Иначе
		
		НовыйДокумент = Документы.ЗаказКлиента.СоздатьДокумент(); 
		НовыйДокумент.Дата        = ТекущаяДата();		
		НовыйДокумент.Организация = Объект.Организация;
		НовыйДокумент.Партнер     = Объект.Партнер;
		НовыйДокумент.Соглашение  = Объект.Соглашение;
		НовыйДокумент.Контрагент  = Объект.Контрагент;
		НовыйДокумент.Договор     = Объект.Договор;

		ПартнерыИКонтрагенты.ЗаполнитьКонтактноеЛицоПартнераПоУмолчанию(НовыйДокумент.Партнер, НовыйДокумент.КонтактноеЛицо);
		
		Если ЗначениеЗаполнено(НовыйДокумент.Соглашение) Тогда
			Попытка //113
				НовыйДокумент.ЗаполнитьУсловияПродажПоСоглашению();
			Исключение //112
				НовыйДокумент.ЗаполнитьУсловияПродажПоCоглашению();
			КонецПопытки;
		Иначе
			НовыйДокумент.ЗаполнитьУсловияПродажПоУмолчанию();
		КонецЕсли;

		НовыйДокумент.ХозяйственнаяОперация = Объект.ХозяйственнаяОперация;
		НовыйДокумент.Валюта      = Объект.Валюта;
		НовыйДокумент.СпособДоставки = Объект.СпособДоставки;
		НовыйДокумент.ДатаОтгрузки   = Объект.ДатаОтгрузки;
		
		НовыйДокумент.Статус      = Объект.СтатусЗаказаКлиента;
		НовыйДокумент.Согласован  = Истина;
		НовыйДокумент.Менеджер    = Объект.Менеджер;
		НовыйДокумент.ДатаСогласования = ТекущаяДата();
		
		НовыйДокумент.Приоритет   = Объект.Приоритет;
		НовыйДокумент.Склад       = Объект.Склад;
		НовыйДокумент.Подразделение = Объект.Подразделение;
						
		НовыйДокумент.Комментарий = "";
		
		Для Каждого Стр из Объект.Товары Цикл					
			СтрокаТЧ = НовыйДокумент.Товары.Добавить();
			СТрокаТЧ.ВариантОбеспечения = Стр.ВариантОбеспечения;
			СтрокаТЧ.Номенклатура     = Стр.Номенклатура;
			СтрокаТЧ.Характеристика   = Стр.Характеристика;
			
			СтрокаТЧ.Упаковка         = Стр.Упаковка;
			СтрокаТЧ.Количество       = Стр.Количество;
			СтрокаТЧ.КоличествоУпаковок = Стр.Количество;
			СтрокаТЧ.ВидЦены          = Стр.ВидЦены;
			СтрокаТЧ.Цена             = Стр.Цена;
			СтрокаТЧ.Сумма            = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
			
			СтрокаТЧ.Склад            = Стр.Склад;
			СтрокаТЧ.СрокПоставки     = 1;
			СтрокаТЧ.ДатаОтгрузки     = Объект.ДатаОтгрузки;
		КонецЦикла;
		
		//СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент);
		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС",Новый Структура("НалогообложениеНДС, Дата", НовыйДокумент.НалогообложениеНДС, НовыйДокумент.Дата));
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
		
		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(НовыйДокумент.Товары, СтруктураДействий,Неопределено);
		
		НовыйДокумент.ЗаполнитьЭтапыГрафикаОплаты();
		
		НовыйДокумент.Записать();
		МассивДокументов.Добавить(НовыйДокумент.Ссылка);
		
	КонецЕсли;
	
	Возврат МассивДокументов;
	
КонецФункции

&НаСервере
Функция мРеализацияТоваров()
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивДокументов = Новый Массив;
	
	Если Объект.РазбиватьДокументыПоСкладам Тогда
		
		Объект.Товары.Сортировать("Организация,Склад");
		
		НовыйДокумент = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
		
		ВремОрганизация = Справочники.Организации.ПустаяСсылка();
		ВремРазмещение = Справочники.Склады.ПустаяСсылка();
		
		ТаблицаРазделения = Объект.Товары.Выгрузить();
		ТаблицаРазделения.Свернуть("Организация,Склад");
		
		Для Каждого Шапка Из ТаблицаРазделения Цикл		
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Организация", Шапка.Организация);
			ПараметрыОтбора.Вставить("Склад", Шапка.Склад);
			
			ТаблЧасть = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
			
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата        = ТекущаяДата(); 		
			НовыйДокумент.ХозяйственнаяОперация = Объект.ХозяйственнаяОперация;
			НовыйДокумент.Организация = Объект.Организация;
			НовыйДокумент.Партнер     = Объект.Партнер;
			НовыйДокумент.Соглашение  = Объект.Соглашение;
			
			Если ЗначениеЗаполнено(НовыйДокумент.Соглашение) Тогда
				Попытка //113
					НовыйДокумент.ЗаполнитьУсловияПродажПоСоглашению();
				Исключение //112
					НовыйДокумент.ЗаполнитьУсловияПродажПоCоглашению();
				КонецПопытки;
			Иначе
				НовыйДокумент.ЗаполнитьУсловияПродажПоУмолчанию();
			КонецЕсли;
						
			НовыйДокумент.Статус      = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;
			НовыйДокумент.Валюта      = Объект.Валюта;
			НовыйДокумент.Склад       = Шапка.Склад;
			НовыйДокумент.Подразделение = Объект.Подразделение;
			НовыйДокумент.Согласован    = Истина;
			НовыйДокумент.ДатаРаспоряжения = ТекущаяДата();
			
			НовыйДокумент.Менеджер    = Объект.Менеджер;
			НовыйДокумент.Комментарий = "";
			
			Для Каждого Стр из ТаблЧасть Цикл					
				СтрокаТЧ = НовыйДокумент.Товары.Добавить();
				СтрокаТЧ.Номенклатура     = Стр.Номенклатура;
				СтрокаТЧ.Характеристика   = Стр.Характеристика;
				СтрокаТЧ.Упаковка         = Стр.Упаковка;
				СтрокаТЧ.Количество       = Стр.Количество;
				СтрокаТЧ.КоличествоУпаковок = Стр.Количество;
				СтрокаТЧ.ВидЦены          = Стр.ВидЦены;
				СтрокаТЧ.Цена             = Стр.Цена;
				СтрокаТЧ.Сумма            = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
				СтрокаТЧ.Склад            = Шапка.Склад;
			КонецЦикла;
			
			//СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент);
			СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент);
			
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС",Новый Структура("НалогообложениеНДС, Дата", НовыйДокумент.НалогообложениеНДС, НовыйДокумент.Дата));
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
			СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
			СтруктураДействий.Вставить("ПересчитатьСумму");
			СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
			СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
			
			ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(НовыйДокумент.Товары, СтруктураДействий,Неопределено);
			
			НовыйДокумент.Записать();
			МассивДокументов.Добавить(НовыйДокумент.Ссылка);
		КонецЦикла;
		
	Иначе
		
		НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйДокумент.Дата        = ТекущаяДата(); 
		НовыйДокумент.ХозяйственнаяОперация = Объект.ХозяйственнаяОперация;
		НовыйДокумент.Организация = Объект.Организация;
		НовыйДокумент.Партнер     = Объект.Партнер;
		НовыйДокумент.Соглашение  = Объект.Соглашение;
		
		Если ЗначениеЗаполнено(НовыйДокумент.Соглашение) Тогда
			Попытка //113
				НовыйДокумент.ЗаполнитьУсловияПродажПоСоглашению();
			Исключение //112
				НовыйДокумент.ЗаполнитьУсловияПродажПоCоглашению();
			КонецПопытки;
		Иначе
			НовыйДокумент.ЗаполнитьУсловияПродажПоУмолчанию();
		КонецЕсли;
					
		НовыйДокумент.Валюта      = Объект.Валюта;
		НовыйДокумент.Менеджер    = Объект.Менеджер;	
		НовыйДокумент.Согласован  = Истина;
		НовыйДокумент.ДатаРаспоряжения = ТекущаяДата();	
		НовыйДокумент.Статус      = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;
		НовыйДокумент.Склад       = Объект.Склад;
		НовыйДокумент.Подразделение = Объект.Подразделение;
		
		НовыйДокумент.Комментарий = "";
		
		Для Каждого Стр из Объект.Товары Цикл					
			СтрокаТЧ = НовыйДокумент.Товары.Добавить();
			СтрокаТЧ.Номенклатура     = Стр.Номенклатура;
			СтрокаТЧ.Характеристика   = Стр.Характеристика;
			СтрокаТЧ.Упаковка         = Стр.Упаковка;
			СтрокаТЧ.Количество       = Стр.Количество;
			СтрокаТЧ.КоличествоУпаковок = Стр.Количество;
			СтрокаТЧ.ВидЦены          = Стр.ВидЦены;
			СтрокаТЧ.Цена             = Стр.Цена;
			СтрокаТЧ.Сумма            = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
			СтрокаТЧ.Склад            = Стр.Склад;
		КонецЦикла;
		
		//СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент);
		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС",Новый Структура("НалогообложениеНДС, Дата", НовыйДокумент.НалогообложениеНДС, НовыйДокумент.Дата));
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
		
		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(НовыйДокумент.Товары, СтруктураДействий,Неопределено);
		
		НовыйДокумент.Записать();
		МассивДокументов.Добавить(НовыйДокумент.Ссылка);
		
	КонецЕсли;
	
	Возврат МассивДокументов;
	
КонецФункции

&НаСервере
Функция мУстановкаЦенНоменклатуры()
	
	МассивДокументов = Новый Массив;

	НовыйДокумент = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	НовыйДокумент.Дата        = ТекущаяДата();
	НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокумент.Комментарий = "";
	НовыйДокумент.Согласован = Истина;
	НовыйДокумент.Статус     = Перечисления.СтатусыУстановокЦенНоменклатуры.Согласован;
	
	СтрокаТЧ = НовыйДокумент.ВидыЦен.Добавить();
	СтрокаТЧ.ВидЦены = Объект.ВидЦен;	
	
	Для Каждого Стр Из Объект.Товары Цикл
		
		СтрокаТЧ = НовыйДокумент.Товары.Добавить();
		СтрокаТЧ.Номенклатура     = Стр.Номенклатура;
		СтрокаТЧ.Характеристика   = Стр.Характеристика;
		СтрокаТЧ.ВидЦены          = Объект.ВидЦен;
		СтрокаТЧ.Цена             = Стр.Цена;	
		СтрокаТЧ.ЦенаИзмененаВручную = Истина;
		
	КонецЦикла;
	
	НовыйДокумент.Записать();
	МассивДокументов.Добавить(НовыйДокумент.Ссылка);

	
	Возврат МассивДокументов;
	
КонецФункции

//============================================================================
// ЖУРНАЛ ЗАКАЗОВ

&НаКлиенте
Процедура ПанельЗакладокПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьМониторЗаказовПокупателей(Команда)
	
	Объект.МониторЗаказы.Очистить();
	
	ОбновитьМониторЗаказовПокупателей();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьМониторЗаказовПокупателей()
	
	Объект.МониторЗаказы.Очистить();
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыКлиентовОстатки.ЗаказКлиента.Дата КАК ДатаЗаказа,
	|	ЗаказыКлиентовОстатки.ЗаказКлиента КАК ЗаказКлиента,
	|	ЗаказыКлиентовОстатки.ЗаказКлиента.ХозяйственнаяОперация,
	|	ЗаказыКлиентовОстатки.ЗаказКлиента.Статус КАК Статус,
	|	ЗаказыКлиентовОстатки.ЗаказКлиента.ПорядокРасчетов,
	|	ЗаказыКлиентовОстатки.ЗаказКлиента.СуммаАвансаДоОбеспечения,
	|	ЗаказыКлиентовОстатки.ЗаказКлиента.СуммаПредоплатыДоОтгрузки,
	|	ЗаказыКлиентовОстатки.ЗаказКлиента.СуммаДокумента,
	|	ЗаказыКлиентовОстатки.ЗаказКлиента.Партнер КАК Партнер,
	|	ЗаказыКлиентовОстатки.ЗаказКлиента.Организация КАК Организация,
	|	ЗаказыКлиентовОстатки.ЗаказКлиента.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЗаказыКлиентовОстатки.ЗаказКлиента.Склад КАК Склад,
	|	ЗаказыКлиентовОстатки.ЗаказКлиента.Менеджер КАК Менеджер,
	|	ЗаказыКлиентовОстатки.ЗаказКлиента.Автор КАК Ответственный,
	|	ЗаказыКлиентовОстатки.ЗаказКлиента.Комментарий КАК Комментарий,
	|	ВЫБОР
	|		КОГДА ЗаказыКлиентовОстатки.ЗаказКлиента.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|				И ЗаказыКлиентовОстатки.ЗаказКлиента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	|				И ЗаказыКлиентовОстатки.ЗаказКлиента.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
	|				И ЗаказыКлиентовОстатки.ЗаказКлиента.СуммаДокумента > 0
	|			ТОГДА ВЫРАЗИТЬ(ЗаказыКлиентовОстатки.ЗаказКлиента.СуммаДокумента - ЕСТЬNULL(РасчетыСКлиентамиОстатки.КОплатеОстаток, 0) КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаОплаты,
	|	ВЫБОР
	|		КОГДА ЗаказыКлиентовОстатки.ЗаказКлиента.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|				И ЗаказыКлиентовОстатки.ЗаказКлиента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	|				И ЗаказыКлиентовОстатки.ЗаказКлиента.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
	|				И ЗаказыКлиентовОстатки.ЗаказКлиента.СуммаДокумента > 0
	|			ТОГДА ВЫРАЗИТЬ((ЗаказыКлиентовОстатки.ЗаказКлиента.СуммаДокумента - ЕСТЬNULL(РасчетыСКлиентамиОстатки.КОплатеОстаток, 0)) * 100 / ЗаказыКлиентовОстатки.ЗаказКлиента.СуммаДокумента КАК ЧИСЛО(15, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентОплаты,
	|	ВЫБОР
	|		КОГДА ЗаказыКлиентовОстатки.ЗаказКлиента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	|				И ЗаказыКлиентовОстатки.ЗаказКлиента.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
	|				И ЗаказыКлиентовОстатки.ЗаказКлиента.СуммаДокумента > 0
	|				И ЕСТЬNULL(РасчетыСКлиентамиОстаткиНаДатуАктуальности.КОплатеОстаток, 0) > 0
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(РасчетыСКлиентамиОстаткиНаДатуАктуальности.КОплатеОстаток, 0) КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПросроченнойОплаты,
	|	ВЫБОР
	|		КОГДА ЗаказыКлиентовОстатки.ЗаказКлиента.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
	|				И ЗаказыКлиентовОстатки.ЗаказКлиента.СуммаДокумента > 0
	|			ТОГДА ЗаказыКлиентовОстатки.ЗаказКлиента.СуммаДокумента - ЕСТЬNULL(ЗаказыКлиентовОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаОтгрузки,
	|	ВЫБОР
	|		КОГДА ЗаказыКлиентовОстатки.ЗаказКлиента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	|				И ЗаказыКлиентовОстатки.ЗаказКлиента.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
	|				И ЗаказыКлиентовОстатки.ЗаказКлиента.СуммаДокумента > 0
	|				И ЕСТЬNULL(РасчетыСКлиентамиОстатки.СуммаОстаток, 0) < 0
	|			ТОГДА ВЫРАЗИТЬ(-ЕСТЬNULL(РасчетыСКлиентамиОстатки.СуммаОстаток, 0) КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НашДолг,
	|	ВЫБОР
	|		КОГДА ЗаказыКлиентовОстатки.ЗаказКлиента.Проведен
	|				И ЗаказыКлиентовОстатки.ЗаказКлиента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	|				И ЗаказыКлиентовОстатки.ЗаказКлиента.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
	|				И ЗаказыКлиентовОстатки.ЗаказКлиента.СуммаДокумента > 0
	|				И ЕСТЬNULL(РасчетыСКлиентамиОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(РасчетыСКлиентамиОстатки.СуммаОстаток, 0) КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДолгКлиента,
	|	ЗаказыКлиентовОстатки.ЗаказаноОстаток,
	|	ЗаказыКлиентовОстатки.КОформлениюОстаток,
	|	ЗаказыКлиентовОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов.Остатки(, ) КАК ЗаказыКлиентовОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Остатки КАК РасчетыСКлиентамиОстатки
	|		ПО ЗаказыКлиентовОстатки.ЗаказКлиента = РасчетыСКлиентамиОстатки.ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Остатки(, ) КАК РасчетыСКлиентамиОстаткиНаДатуАктуальности
	|		ПО ЗаказыКлиентовОстатки.ЗаказКлиента = РасчетыСКлиентамиОстаткиНаДатуАктуальности.ЗаказКлиента
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказыКлиентовОстатки.ЗаказКлиента.Дата";
	
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДатаАктуальности",ТекущаяДата());
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Строка = Объект.МониторЗаказы.Добавить();
		ЗаполнитьЗначенияСвойств(Строка,Выборка);	 		
	КонецЦикла;
	
	НавигацияКлиентыМониторЗаказов.Очистить();
	НавигацияДатаОтгрузкиМониторЗаказов.Очистить();
	НавигацияМенеджерыМониторЗаказов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Партнеры.Ссылка КАК Партнер,
	|	Партнеры.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|ГДЕ
	|	Партнеры.Ссылка В(&СписокКонтрагентов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Запрос.УстановитьПараметр("СписокКонтрагентов", Объект.МониторЗаказы.Выгрузить(,"Партнер"));
	Результат = Запрос.Выполнить();
	НавигацияКлиентыМониторЗаказов.Загрузить(Результат.Выгрузить());
	
	НоваяСтрока = НавигацияКлиентыМониторЗаказов.Вставить(0);
	НоваяСтрока.Наименование = "[Все контрагенты]";
	НоваяСтрока.Партнер = Справочники.Партнеры.ПустаяСсылка();
	
	ВремТаблица = Объект.МониторЗаказы.Выгрузить(,"ДатаОтгрузки");
	ВремТаблица.Свернуть("ДатаОтгрузки");
	Для Каждого Стр Из ВремТаблица ЦИкл
		Если НЕ ЗначениеЗаполнено(Стр) Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтр = НавигацияДатаОтгрузкиМониторЗаказов.Добавить();
		НовСтр.Наименование = Формат(Стр.ДатаОтгрузки,"ДЛФ = ""Д""");
		НовСтр.ДатаОтгрузки = Стр.ДатаОтгрузки;
	КонецЦикла;
	НавигацияДатаОтгрузкиМониторЗаказов.Сортировать("ДатаОтгрузки");
	
	НоваяСтрока = НавигацияДатаОтгрузкиМониторЗаказов.Вставить(0);
	НоваяСтрока.Наименование = "[Все даты]";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Менеджер,
	|	Пользователи.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка В(&СписокМенеджеров)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Запрос.УстановитьПараметр("СписокМенеджеров", Объект.МониторЗаказы.Выгрузить(,"Менеджер"));
	Результат = Запрос.Выполнить();
	НавигацияМенеджерыМониторЗаказов.Загрузить(Результат.Выгрузить());
	
	НоваяСтрока = НавигацияМенеджерыМониторЗаказов.Вставить(0);
	НоваяСтрока.Наименование = "[Все менеджеры]";
	НоваяСтрока.Менеджер = Справочники.Пользователи.ПустаяСсылка();
	
КонецПроцедуры



Функция РасшифровкиСостояниеВыполненияЗаказа(ПараметрыЗапроса) 
	
	ТаблицаРезультат = Новый Массив;

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ВЫБОР
	|			КОГДА ЗаказыКлиентов.ЗаказаноПриход > 0
	|				ТОГДА ЗаказыКлиентов.ЗаказаноПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Заказано,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаказыКлиентов.ЗаказаноПриход < 0
	|				ТОГДА ЗаказыКлиентов.ЗаказаноПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) * -1 КАК Отменено,
	|	ЗаказыКлиентов.Номенклатура КАК Номенклатура,
	|	ЗаказыКлиентов.Характеристика КАК Характеристика,
	|	ЗаказыКлиентов.ЗаказКлиента КАК ЗаказКлиента,
	|	ЗаказыКлиентов.Склад КАК Склад,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаказыКлиентов.СуммаПриход > 0
	|				ТОГДА ЗаказыКлиентов.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаЗаказано
	|ПОМЕСТИТЬ ЗаказыКлиентов
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов.Обороты(, , Запись, ЗаказКлиента = &Заказ) КАК ЗаказыКлиентов
	|ГДЕ
	|	ЗаказыКлиентов.ЗаказаноПриход <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыКлиентов.Номенклатура,
	|	ЗаказыКлиентов.Характеристика,
	|	ЗаказыКлиентов.ЗаказКлиента,
	|	ЗаказыКлиентов.Склад
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказКлиента,
	|	Номенклатура,
	|	Характеристика,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыКОформлению.КОформлениюКонечныйОстаток КАК КОформлению,
	|	ТоварыКОформлению.КОформлениюРасход КАК Оформлено,
	|	ТоварыКОформлению.КОформлениюПриход КАК НеобходимоОформить,
	|	ТоварыКОформлению.Номенклатура КАК Номенклатура,
	|	ТоварыКОформлению.Характеристика КАК Характеристика,
	|	ТоварыКОформлению.ЗаказКлиента КАК ЗаказКлиента,
	|	ТоварыКОформлению.Склад КАК Склад,
	|	ТоварыКОформлению.СуммаКонечныйОстаток КАК СуммаКОформлению,
	|	ВЫБОР
	|		КОГДА ТоварыКОформлению.СуммаРасход > 0
	|			ТОГДА ТоварыКОформлению.СуммаРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаОформлено
	|ПОМЕСТИТЬ ТоварыКОформлению
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов.ОстаткиИОбороты(, , , , ЗаказКлиента = &Заказ) КАК ТоварыКОформлению
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказКлиента,
	|	Номенклатура,
	|	Характеристика,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ТоварыКОтгрузке.КОтгрузкеКонечныйОстаток) КАК КОтгрузке,
	|	СУММА(ТоварыКОтгрузке.СобираетсяКонечныйОстаток) КАК Собирается,
	|	СУММА(ТоварыКОтгрузке.СобраноКонечныйОстаток) КАК Собрано,
	|	СУММА(ТоварыКОтгрузке.КОтгрузкеРасход) КАК Отгружено,
	|	СУММА(ТоварыКОтгрузке.КОтгрузкеПриход) КАК НеобходимоОтгрузить,
	|	ТоварыКОтгрузке.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузке.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузке.Склад КАК Склад,
	|	ТоварыКОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ТоварыКОтгрузке.ДокументОтгрузки.ЗаказКлиента КАК ЗаказКлиента
	|ПОМЕСТИТЬ ТоварыКОтгрузке
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.ОстаткиИОбороты(
	|			,
	|			,
	|			,
	|			,
	|			ДокументОтгрузки В
	|				(ВЫБРАТЬ
	|					РеализацияТовары.Ссылка КАК Ссылка
	|				ИЗ
	|					Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТовары
	|				ГДЕ
	|					РеализацияТовары.ЗаказКлиента = &Заказ)) КАК ТоварыКОтгрузке
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОтгрузке.Номенклатура,
	|	ТоварыКОтгрузке.Характеристика,
	|	ТоварыКОтгрузке.ДокументОтгрузки,
	|	ТоварыКОтгрузке.Склад,
	|	ТоварыКОтгрузке.ДокументОтгрузки.ЗаказКлиента
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОтгрузки,
	|	Номенклатура,
	|	Характеристика,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыКлиентов.Номенклатура.Артикул КАК Артикул,
	|	ЗаказыКлиентов.Номенклатура КАК Номенклатура,
	|	ЗаказыКлиентов.Характеристика КАК Характеристика,
	|	ЗаказыКлиентов.ЗаказКлиента КАК ЗаказКлиента,
	|	ЗаказыКлиентов.Склад КАК Склад,
	|	ЗаказыКлиентов.Заказано КАК Заказано,
	|	ЗаказыКлиентов.Отменено КАК Отменено,
	|	ВЫБОР
	|		КОГДА ЗаказыКлиентов.Заказано > 0
	|			ТОГДА ЗаказыКлиентов.Отменено / ЗаказыКлиентов.Заказано * 100
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентОтмены,
	|	ТоварыКОтгрузке.КОтгрузке КАК КОтгрузке,
	|	ТоварыКОтгрузке.Отгружено КАК Отгружено,
	|	ТоварыКОтгрузке.Собирается КАК Собирается,
	|	ТоварыКОтгрузке.Собрано КАК Собрано,
	|	ТоварыКОтгрузке.НеобходимоОтгрузить КАК НеобходимоОтгрузить,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузке.НеобходимоОтгрузить >= 0
	|			ТОГДА ТоварыКОтгрузке.Отгружено / ТоварыКОтгрузке.НеобходимоОтгрузить * 100
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентОтгрузки,
	|	ТоварыКОформлению.КОформлению КАК КОформлению,
	|	ТоварыКОформлению.Оформлено КАК Оформлено,
	|	ТоварыКОформлению.НеобходимоОформить КАК НеобходимоОформить,
	|	ВЫБОР
	|		КОГДА ТоварыКОформлению.НеобходимоОформить > 0
	|			ТОГДА ТоварыКОформлению.Оформлено / ТоварыКОформлению.НеобходимоОформить * 100
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентОформления,
	|	ВЫБОР
	|		КОГДА ЗаказыКлиентов.Заказано - ЗаказыКлиентов.Отменено - ЕСТЬNULL(ВЫБОР
	|					КОГДА ТоварыКОтгрузке.Отгружено < ТоварыКОформлению.Оформлено
	|							И ЗаказыКлиентов.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|						ТОГДА ТоварыКОтгрузке.Отгружено
	|					ИНАЧЕ ТоварыКОформлению.Оформлено
	|				КОНЕЦ, 0) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Выполнен,
	|	ЗаказыКлиентов.СуммаЗаказано КАК СуммаЗаказано,
	|	ТоварыКОформлению.СуммаКОформлению КАК СуммаКОформлению,
	|	ТоварыКОформлению.СуммаОформлено КАК СуммаОформлено
	|ИЗ
	|	ЗаказыКлиентов КАК ЗаказыКлиентов
	|		{ЛЕВОЕ СОЕДИНЕНИЕ ТоварыКОтгрузке КАК ТоварыКОтгрузке
	|		ПО (ВЫБОР
	|				КОГДА ТоварыКОтгрузке.ЗаказКлиента = НЕОПРЕДЕЛЕНО
	|						ИЛИ ТоварыКОтгрузке.ЗаказКлиента = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|						ИЛИ ТоварыКОтгрузке.ЗаказКлиента = ЗНАЧЕНИЕ(Документ.ЗаявкаНаВозвратТоваровОтКлиента.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЗаказыКлиентов.ЗаказКлиента = ТоварыКОтгрузке.ЗаказКлиента
	|			КОНЕЦ)
	|			И ЗаказыКлиентов.Номенклатура = ТоварыКОтгрузке.Номенклатура
	|			И ЗаказыКлиентов.Характеристика = ТоварыКОтгрузке.Характеристика
	|			И ЗаказыКлиентов.Склад = ТоварыКОтгрузке.Склад
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыКОформлению КАК ТоварыКОформлению
	|		ПО ЗаказыКлиентов.ЗаказКлиента = ТоварыКОформлению.ЗаказКлиента
	|			И ЗаказыКлиентов.Номенклатура = ТоварыКОформлению.Номенклатура
	|			И ЗаказыКлиентов.Характеристика = ТоварыКОформлению.Характеристика
	|			И ЗаказыКлиентов.Склад = ТоварыКОформлению.Склад}
	|{ГДЕ
	|	(ВЫБОР
	|			КОГДА ЗаказыКлиентов.Заказано - ЗаказыКлиентов.Отменено - ЕСТЬNULL(ВЫБОР
	|						КОГДА ТоварыКОтгрузке.Отгружено < ТоварыКОформлению.Оформлено
	|								И ЗаказыКлиентов.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|							ТОГДА ТоварыКОтгрузке.Отгружено
	|						ИНАЧЕ ТоварыКОформлению.Оформлено
	|					КОНЕЦ, 0) = 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Выполнен}
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказыКлиентов.Номенклатура.Наименование";		
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Заказ", ПараметрыЗапроса.ТекущийЗаказКлиента);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ВыборкаСтрока Из РезультатЗапроса Цикл		
		НоваяСтрока = Новый Структура("Артикул, Номенклатура, Характеристика, Количество, Склад, Заказано, Отменено, КОтгрузке, Отгружено, Собирается, Собрано, НеобходимоОтгрузить, КОформлению, НеобходимоОформить");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтрока);
		
		ТаблицаРезультат.Добавить(НоваяСтрока);		
	КонецЦикла;	
	
	Возврат Новый Структура("ТаблицаРезультат",ТаблицаРезультат);

КонецФункции

&НаКлиенте
Процедура МониторЗаказыПриАктивизацииСтрокиСервер(ПараметрыЗапроса)
	
	
	СтруктураИнформации = РасшифровкиСостояниеВыполненияЗаказа(ПараметрыЗапроса);
	СостояниеВыполненияЗаказа.Очистить();
	
	Для Каждого ВыборкаСтрока Из СтруктураИнформации.ТаблицаРезультат Цикл				
		НоваяСтрока = СостояниеВыполненияЗаказа.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаСтрока);
	КонецЦикла;	
		
	
КонецПроцедуры

&НаКлиенте
Процедура МониторЗаказыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанныеЗаказ = Элементы.МониторЗаказы.ТекущиеДанные;
	
	Если НЕ ТекущиеДанныеЗаказ = Неопределено Тогда
		
		ТекущийЗаказКлиента = ТекущиеДанныеЗаказ.ЗаказКлиента;
		
		ТекущиеДанныеСтроки = Новый Структура;
		ТекущиеДанныеСтроки.Вставить("ТекущийЗаказКлиента",ТекущийЗаказКлиента);
		
		МониторЗаказыПриАктивизацииСтрокиСервер(ТекущиеДанныеСтроки);
		
	Иначе
		СостояниеВыполненияЗаказа.Очистить();
	КонецЕсли;
	
КонецПроцедуры

//============================================================================
// 

&НаКлиенте
Процедура НавигацияЗаказовПриАктивизацииСтроки(Элемент)
	
	//Элементы.МониторЗаказы.ОтборСтрок = Неопределено;	
	
	Если Элементы.НавигацияМониторЗаказов.ТекущаяСтраница = Элементы.НавигацияМониторЗаказов.ПодчиненныеЭлементы.Клиенты Тогда
		
		ТекущиеДанные = Элементы.НавигацияКлиентыМониторЗаказов.ТекущиеДанные;
		Если НЕ ТекущиеДанные = Неопределено Тогда
			Если ЗначениеЗаполнено(ТекущиеДанные.Партнер) Тогда
				Элементы.МониторЗаказы.ОтборСтрок = Новый ФиксированнаяСтруктура("Партнер",ТекущиеДанные.Партнер);
			Иначе
				Элементы.МониторЗаказы.ОтборСтрок = Неопределено;
			КонецЕсли;
		Иначе
			Элементы.МониторЗаказы.ОтборСтрок = Неопределено;	
		КонецЕсли;
		
	ИначеЕсли Элементы.НавигацияМониторЗаказов.ТекущаяСтраница = Элементы.НавигацияМониторЗаказов.ПодчиненныеЭлементы.ДатаОтгрузки Тогда
		
		ТекущиеДанные = Элементы.НавигацияДатаОтгрузкиМониторЗаказов.ТекущиеДанные;
		Если НЕ ТекущиеДанные = Неопределено Тогда
			Если ЗначениеЗаполнено(ТекущиеДанные.ДатаОтгрузки) Тогда
				Элементы.МониторЗаказы.ОтборСтрок = Новый ФиксированнаяСтруктура("ДатаОтгрузки",ТекущиеДанные.ДатаОтгрузки);
			Иначе
				Элементы.МониторЗаказы.ОтборСтрок = Неопределено;
			КонецЕсли;
		Иначе
			Элементы.МониторЗаказы.ОтборСтрок = Неопределено;	
		КонецЕсли;
		
	ИначеЕсли Элементы.НавигацияМониторЗаказов.ТекущаяСтраница = Элементы.НавигацияМониторЗаказов.ПодчиненныеЭлементы.Менеджеры Тогда
		
		ТекущиеДанные = Элементы.НавигацияМенеджерыМониторЗаказов.ТекущиеДанные;
		Если НЕ ТекущиеДанные = Неопределено Тогда
			Если ЗначениеЗаполнено(ТекущиеДанные.Менеджер) Тогда
				Элементы.МониторЗаказы.ОтборСтрок = Новый ФиксированнаяСтруктура("Менеджер",ТекущиеДанные.Менеджер);
			Иначе
				Элементы.МониторЗаказы.ОтборСтрок = Неопределено;
			КонецЕсли;
		Иначе
			Элементы.МониторЗаказы.ОтборСтрок = Неопределено;	
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МониторЗаказовПометкаУстановить(Команда)
	
	Для Каждого Стр Из Объект.МониторЗаказы Цикл
		Стр.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МониторЗаказовПометкаОтключить(Команда)
	
	Для Каждого Стр Из Объект.МониторЗаказы Цикл
		Стр.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МониторЗаказовОтменитьЗаказы(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура МониторЗаказовСоздатьРеализации(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельНавигацииПоказатьСкрыть(Команда)
	
	ОбновитьВсеОтборыСервер();
	
	Элементы.Навигация.Видимость = ИспользоватьНавигацию;
	
КонецПроцедуры


//============================================================================
// ШТРИХКОДЫ И ТОРГОВОЕ ОБОРУДОВАНИЕ


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//ЭтаФорма.ТекущийЭлемент = Элементы.СтрокаПоиска;
	//Сообщить("ьвапфвапф");
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		
		Если ИмяСобытия = "ScanData" Тогда
			
			//Преобразуем предварительно к ожидаемому формату
			Данные = Новый Массив();
			
			Если Параметр[1] = Неопределено Тогда
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[0], 1)); // Достаем штрихкод из основных данных
			Иначе
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[1][1], 1)); // Достаем штрихкод из дополнительных данных
			КонецЕсли;			
		КонецЕсли;
		
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	// Неизвестные штрихкоды
	Если Источник = "ПодключаемоеОборудование"
		И ИмяСобытия = "НеизвестныеШтрихкоды"
		И Параметр.ФормаВладелец = УникальныйИдентификатор Тогда
		
		КэшированныеЗначения.Штрихкоды.Очистить();
		ДанныеШтрихкодов = Новый Массив;
		
		ПолученныйШтрихкод = "";
		
		Для Каждого ПолученныйШтрихкод Из Параметр.ПолученыНовыеШтрихкоды Цикл
			ДанныеШтрихкодов.Добавить(ПолученныйШтрихкод);
		КонецЦикла;
		
		Для Каждого ПолученныйШтрихкод Из Параметр.ЗарегистрированныеШтрихкоды Цикл
			ДанныеШтрихкодов.Добавить(ПолученныйШтрихкод);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	//ЭтаФорма.ТекущийЭлемент = Элементы.СтрокаПоиска;
	//Сообщить("325463564");
	
КонецПроцедуры

//============================================================================
// 

&НаКлиенте
Процедура АналогиДобавитьЭлемент(Команда)
	
	ТекущиеДанныеСтроки = Новый Структура;
	ТекущиеДанныеСтроки.Вставить("Номенклатура",ПодборТекущаяНоменклатура);
	ТекущиеДанныеСтроки.Вставить("Характеристика",ПодборТекущаяХарактеристика);
	
	ОткрытьФорму("РегистрСведений.мегапрайсВзаимозаменяемостьНоменклатуры.Форма.ФормаЗаписи", ТекущиеДанныеСтроки, ЭтаФорма);
	
	ОбновитьДанныеДополнительнойИнформации();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборАналогиСервер(ТекущиеДанныеСтроки,ОтборПоказатьАналоги)
		
	ОтборСписок = Новый Массив;
	ОтборСписок.Добавить(ТекущиеДанныеСтроки.Номенклатура);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	мегапрайсВзаимозаменяемостьНоменклатуры.АналогНоменклатура КАК АналогНоменклатура,
	|	мегапрайсВзаимозаменяемостьНоменклатуры.АртикулАналога КАК АналогАртикул,
	|	мегапрайсВзаимозаменяемостьНоменклатуры.АналогНоменклатура.Производитель КАК Производитель,
	|	мегапрайсВзаимозаменяемостьНоменклатуры.Главный КАК Главный
	|ИЗ
	|	РегистрСведений.мегапрайсВзаимозаменяемостьНоменклатуры КАК мегапрайсВзаимозаменяемостьНоменклатуры
	|ГДЕ
	|	мегапрайсВзаимозаменяемостьНоменклатуры.Номенклатура = &ВыбНоменклатура";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВыбНоменклатура", ТекущиеДанныеСтроки.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ВыборкаСтрока Из РезультатЗапроса Цикл	
		ОтборСписок.Добавить(ВыборкаСтрока.АналогНоменклатура);	
	КонецЦикла;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	ПодборТаблицаНоменклатура,
	"Ссылка",
	ОтборСписок,
	ВидСравненияКомпоновкиДанных.ВСписке, ,ОтборПоказатьАналоги);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоказатьАналогиПриИзменении(Элемент)
	
	Если ОтборПоказатьАналоги = Ложь Тогда
		ОтборСписок = Новый Массив;

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ПодборТаблицаНоменклатура,
		"Ссылка",
		Неопределено,
		ВидСравненияКомпоновкиДанных.ВСписке, ,Ложь);
		Возврат;
	КонецЕсли;

	ТекущиеДанныеНоменклатура = ЭлементыПодборТаблицаНоменклатура.ТекущиеДанные;
	
	ТекущиеДанныеСтроки = Новый Структура;
	ТекущиеДанныеСтроки.Вставить("Номенклатура",ТекущиеДанныеНоменклатура.Ссылка);
	
	УстановитьОтборАналогиСервер(ТекущиеДанныеСтроки,Истина);
	
	Элементы.СтраницыСписокНоменклатуры.ТекущаяСтраница = Элементы.СтраницыСписокНоменклатуры.ПодчиненныеЭлементы.ГруппаНоменклатура;

КонецПроцедуры

//============================================================================
// 

&НаКлиенте
Процедура СоздатьПартнера(Команда)
	
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		
		ТекстВопроса = НСтр("ru = 'Текущий клиент %Партнер% будет заменен на нового. Создать нового клиента?'");
		ТекстВопроса = СтрЗаменить(ТекстВопроса, "%Партнер%", Объект.Партнер);
		
		СписокКнопок = Новый СписокЗначений();
		СписокКнопок.Добавить("СоздатьНовогоКлиента", НСтр("ru = 'Создать нового'"));
		СписокКнопок.Добавить("ОставитьТекущегоКлиента", НСтр("ru = 'Оставить текущего'"));
		
		ОтветНаВопрос = Вопрос(ТекстВопроса, СписокКнопок);
		
		Если ОтветНаВопрос = "ОставитьТекущегоКлиента" Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Партнеры.Форма.ПомощникНового",Новый Структура("ЗаголовокФормыВладельца", НСтр("ru='Партнеры (Клиенты)'")), ЭтаФорма);
	
КонецПроцедуры



&НаКлиенте
Процедура ВыборПериода(Команда)
	
	ПараметрыВыбора = Новый Структура("НачалоПериода,КонецПериода", Объект.НачалоПериода, Объект.КонецПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Объект, РезультатВыбора, "НачалоПериода,КонецПериода");
	
КонецПроцедуры

&НаКлиенте
Процедура МониторЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.МониторЗаказы.ТекущиеДанные;
	ПоказатьЗначение(Неопределено, ТекущаяСтрока.ЗаказКлиента);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииСервер()
	
	ПродажиСервер.ЗаполнитьБанковскиеСчетаПоДоговору(Объект.Договор, Объект.БанковскийСчет, Объект.БанковскийСчетКонтрагента);
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		Объект.ПорядокОплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор,"ПорядокОплаты");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КорзинаПроцентРучнойСкидкиПриИзменении(Элемент)
	
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры



#Область ЦенообразованиеИСкидки

&НаСервере
Функция ЗаполнитьЦеныПоСоглашениюСервер()
	МассивСтрок = Новый Массив;
	Для Каждого Строка Из Элементы.Товары.ВыделенныеСтроки Цикл
		МассивСтрок.Добавить(Объект.Товары.НайтиПоИдентификатору(Строка));
	КонецЦикла;
	
	НаборыВызовСервера.ДополнитьДоПолногоНабора(Объект.Товары, МассивСтрок);
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ОчиститьАвтоматическуюСкидку");
	
	ЦеныРассчитаны = ПродажиСервер.ЗаполнитьЦены(
	Объект.Товары,
	МассивСтрок, // Массив строк или структура отбора
	Новый Структура( // Параметры заполнения
	"Дата, Валюта, Соглашение, Организация, РасчитыватьНаборы, ПоляЗаполнения",
	Объект.Дата,
	Объект.Валюта,
	Объект.Соглашение,
	Объект.Организация,
	Истина,
	"Цена, СтавкаНДС, ВидЦены, СрокПоставки"
	),
	СтруктураДействий);
	
	//ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Товары, ЗависимыеРеквизиты());
	//РассчитатьИтоговыеПоказатели(ЭтаФорма);
	
	Возврат ЦеныРассчитаны;
	
КонецФункции

&НаСервере
Функция ЗаполнитьЦеныВыделенныхСтрокПоВидуЦенСервер(ВидЦен)
	
	МассивСтрок = Новый Массив;
	Для Каждого Строка Из Элементы.Товары.ВыделенныеСтроки Цикл
		МассивСтрок.Добавить(Объект.Товары.НайтиПоИдентификатору(Строка));
	КонецЦикла;
	
	НаборыВызовСервера.ДополнитьДоПолногоНабора(Объект.Товары, МассивСтрок);
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ОчиститьАвтоматическуюСкидку");
	
	ЦеныРассчитаны = ПродажиСервер.ЗаполнитьЦены(
	Объект.Товары,
	МассивСтрок, // Массив строк или структура отбора
	Новый Структура( // Параметры заполнения
	"Дата, Валюта, ВидЦены, ЦенаВключаетНДС, РасчитыватьНаборы, ПоляЗаполнения",
	Объект.Дата,
	Объект.Валюта,
	ВидЦен,
	Объект.ЦенаВключаетНДС,
	Истина,
	"Цена, ВидЦены"
	),
	СтруктураДействий);
	
	//ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Товары, ЗависимыеРеквизиты());
	//РассчитатьИтоговыеПоказатели(ЭтаФорма);
	
	Возврат ЦеныРассчитаны;
	
КонецФункции

&НаСервере
Процедура РассчитатьСкидкиБезПримененияКОбъекту()
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Ложь);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
	СтруктураПараметры.Вставить("УправляемыеСкидки", УправляемыеСкидки);
	
	ПримененныеСкидки = СкидкиНаценкиСервер.Рассчитать(Объект, СтруктураПараметры);
	АдресПримененныхСкидокВоВременномХранилище = ПоместитьВоВременноеХранилище(ПримененныеСкидки, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Функция РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры, ВзятьИзВременногоХранилища = Ложь)
	
	Если ВзятьИзВременногоХранилища Тогда
		ПримененныеСкидки = ПолучитьИзВременногоХранилища(АдресПримененныхСкидокВоВременномХранилище);
		СкидкиНаценкиСервер.ПрименитьРезультатРасчета(Объект, ПримененныеСкидки);
	Иначе
		ПримененныеСкидки = СкидкиНаценкиСервер.Рассчитать(Объект, СтруктураПараметры);
		АдресПримененныхСкидокВоВременномХранилище = ПоместитьВоВременноеХранилище(ПримененныеСкидки, УникальныйИдентификатор);
	КонецЕсли;
	
	Объект.СкидкиРассчитаны = Истина;
	
	//ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Товары, ЗависимыеРеквизиты());
	//РассчитатьИтоговыеПоказатели(ЭтаФорма);
	
	СтруктураСообщений = СкидкиНаценкиСервер.ПолучитьСтруктуруСообщений(Объект);
	//СкидкиНаценкиСервер.НастроитьКомандуПоказатьСообщения(Объект, Элементы.ПоказатьСообщения);
	
	Возврат СтруктураСообщений;
	
КонецФункции

&НаСервере
Процедура НазначитьРучнуюСкидкуНаСервере(СуммаСкидкиНаценки, Знач ВыделенныеСтроки = Неопределено, АдресВоВременномХранилище)
	
	Если СуммаСкидкиНаценки <> 0 Тогда
		
		ПараметрыСкидки = Новый Структура();
		ПараметрыСкидки.Вставить("ИспользуютсяАвтоматическиеСкидки", Истина);
		ПараметрыСкидки.Вставить("ТолькоДляАктивныхСтрок", Ложь);
		ПараметрыСкидки.Вставить("РассчитыватьСуммуСНДС", Истина);
		ПараметрыСкидки.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
		ПараметрыСкидки.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
		ПараметрыСкидки.Вставить("РеализацияСверхЗаказа", Ложь);
		
		СкидкиНаценкиСервер.НазначитьРучнуюСкидку(Объект, "Товары", СуммаСкидкиНаценки, ПараметрыСкидки);
		
	Иначе
		СкидкиНаценкиСервер.ОтменитьРучныеСкидки(Объект, "Товары", Истина, Истина);
	КонецЕсли;
	//ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Товары, ЗависимыеРеквизиты());
КонецПроцедуры

&НаСервере
Функция ВыполнитьПредварительныйРасчетСкидокНаСервере()
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Ложь);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Истина);
	СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
	СтруктураПараметры.Вставить("УправляемыеСкидки", УправляемыеСкидки);
	
	Возврат ПоместитьВоВременноеХранилище(СкидкиНаценкиСервер.Рассчитать(Объект, СтруктураПараметры), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(Объект) Экспорт
	
	СтруктураЗаполненияЦены = Новый Структура;
	СтруктураЗаполненияЦены.Вставить("Дата",       Объект.Дата);
	СтруктураЗаполненияЦены.Вставить("Валюта",     Объект.Валюта);
	СтруктураЗаполненияЦены.Вставить("Соглашение", Объект.Соглашение);
	
	Возврат СтруктураЗаполненияЦены;
	
КонецФункции

&НаСервере
Функция АдресДанныхДляРасчетаРучныхСкидокВоВременномХранилище(ТолькоВыделенныеСтроки)
	
	Возврат СкидкиНаценкиСервер.АдресДанныхДляРасчетаРучныхСкидокВоВременномХранилище(ЭтаФорма, "Товары", УникальныйИдентификатор, ТолькоВыделенныеСтроки);
	
КонецФункции

&НаСервере
Процедура ОтменитьРучныеСкидкиНаСервере()
	
	СкидкиНаценкиСервер.ОтменитьРучныеСкидки(Объект, "Товары", Истина, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СчитанаКартаЛояльности(Знач Оповещение, КартаЛояльности)
	
	ДанныеКартыЛояльности = КартыЛояльностиВызовСервера.ПолучитьДанныеКартыЛояльности(КартаЛояльности);
	Если ЗначениеЗаполнено(ДанныеКартыЛояльности.Ссылка) Тогда
		
		Если Не ДанныеКартыЛояльности.ПартнерДоступен Тогда
			ПоказатьПредупреждение(Новый ОписаниеОповещения("СчитанаКартаЛояльностиЗавершение", ЭтотОбъект, Новый Структура("Оповещение", Оповещение)), НСтр("ru = 'Нет доступа к партнеру-владельцу карты лояльности.'"));
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДанныеКартыЛояльности.Партнер) Тогда // Обезличенная карта
			
			СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
			Модифицированность = Истина;
			Объект.КартаЛояльности   = КартаЛояльности;
			
			ВыполнитьОбработкуОповещения(Оповещение);
			Возврат;
			
		ИначеЕсли Объект.Партнер <> ДанныеКартыЛояльности.Партнер Тогда // Партнер в карте отличается от партнера в погмощнике.
			
			Если ЗначениеЗаполнено(Объект.Партнер) Тогда
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("Оповещение", Оповещение);
				ДополнительныеПараметры.Вставить("КартаЛояльности", КартаЛояльности);
				ДополнительныеПараметры.Вставить("ДанныеКартыЛояльности", ДанныеКартыЛояльности);
				ПоказатьВопрос(
				Новый ОписаниеОповещения("СчитанаКартаЛояльностиВопросЗавершение", ЭтотОбъект, ДополнительныеПараметры),
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Карта лояльности принадлежит партнеру ""%1"". Изменить партнера в помощнике?'"), ДанныеКартыЛояльности.Партнер),
				РежимДиалогаВопрос.ДаНет);
				Возврат;
			КонецЕсли;
			
		Иначе // Партнер в документе равен партнеру в карте.
			
			ВопросОбИзмененииКонтрагента = Ложь;
			Если ЗначениеЗаполнено(ДанныеКартыЛояльности.Контрагент)
				И ЗначениеЗаполнено(Объект.Контрагент) И ДанныеКартыЛояльности.Контрагент <> Объект.Контрагент Тогда
				ВопросОбИзмененииКонтрагента = Истина;
			КонецЕсли;
			
			ВопросОбИзмененииСоглашения = Ложь;
			Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(ДанныеКартыЛояльности.Соглашение)
				И ЗначениеЗаполнено(Объект.Соглашение) И ДанныеКартыЛояльности.Соглашение <> Объект.Соглашение Тогда
				ВопросОбИзмененииСоглашения = Истина;
			КонецЕсли;
			
			Если ВопросОбИзмененииКонтрагента Или ВопросОбИзмененииСоглашения Тогда
				
				Если ВопросОбИзмененииКонтрагента И ВопросОбИзмененииСоглашения Тогда
					ТекстВопроса = НСтр("ru = 'Для карты лояльности заданы контрагент ""%1"" и соглашение ""%2"". Применить карту лояльности и подставить в помощник контрагента ""%1"" и соглашение ""%2""?'");
				ИначеЕсли ВопросОбИзмененииКонтрагента Тогда
					ТекстВопроса = НСтр("ru = 'Для карты лояльности задан контрагент ""%1"". Применить карту лояльности и подставить в помощник контрагента ""%1""?'");
				ИначеЕсли ВопросОбИзмененииСоглашения Тогда
					ТекстВопроса = НСтр("ru = 'Для карты лояльности задано соглашение ""%2"". Применить карту лояльности и подставить в помощник соглашение ""%2""?'");
				КонецЕсли;
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("Оповещение", Оповещение);
				ДополнительныеПараметры.Вставить("КартаЛояльности", КартаЛояльности);
				ДополнительныеПараметры.Вставить("ДанныеКартыЛояльности", ДанныеКартыЛояльности);
				ПоказатьВопрос(
				Новый ОписаниеОповещения("СчитанаКартаЛояльностиВопросЗавершение", ЭтотОбъект, ДополнительныеПараметры),
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, ДанныеКартыЛояльности.Контрагент, ДанныеКартыЛояльности.Соглашение),
				РежимДиалогаВопрос.ДаНет);
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
		Модифицированность = Истина;
		Объект.КартаЛояльности   = КартаЛояльности;
		СчитанаКартаЛояльностиНаСервере(ДанныеКартыЛояльности);
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СчитанаКартаЛояльностиВопросЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.Оповещение);
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		
		СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
		Модифицированность = Истина;
		Объект.КартаЛояльности   = ДополнительныеПараметры.КартаЛояльности;
		СчитанаКартаЛояльностиНаСервере(ДополнительныеПараметры.ДанныеКартыЛояльности);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчитанаКартаЛояльностиЗавершение(ДополнительныеПараметры) Экспорт
	
	Оповещение = ДополнительныеПараметры.Оповещение;
	
	
	ВыполнитьОбработкуОповещения(Оповещение);
	
КонецПроцедуры

&НаСервере
Процедура СчитанаКартаЛояльностиНаСервере(ДанныеКартыЛояльности)
	
	Если ЗначениеЗаполнено(ДанныеКартыЛояльности.Партнер) И ДанныеКартыЛояльности.Партнер <> Объект.Партнер Тогда
		Объект.Партнер = ДанныеКартыЛояльности.Партнер;
		Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		Объект.Соглашение = Справочники.СоглашенияСКлиентами.ПустаяСсылка();
		ПриИзмененииПартнераСервер();
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеКартыЛояльности.Соглашение)
		И ДанныеКартыЛояльности.Соглашение <> Объект.Соглашение
		И ДанныеКартыЛояльности.СоглашениеДоступно Тогда
		Объект.Соглашение = ДанныеКартыЛояльности.Соглашение;
		ПриИзмененииСоглашенияСервер();
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеКартыЛояльности.Контрагент)
		И ДанныеКартыЛояльности.Контрагент <> Объект.Контрагент
		И ДанныеКартыЛояльности.КонтрагентДоступен Тогда
		Объект.Контрагент = ДанныеКартыЛояльности.Контрагент;
		//КонтрагентПриИзмененииСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолученыСообщения(Сообщения)
	
	СкидкиНаценкиСервер.СохранитьОтработанныеСообщения(Объект, Сообщения);
	СкидкиНаценкиСервер.НастроитьКомандуПоказатьСообщения(Объект, Элементы.ПоказатьСообщения);
	
КонецПроцедуры

&НаСервере
Функция СкидкиИзменились()
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Ложь);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
	СтруктураПараметры.Вставить("УправляемыеСкидки", УправляемыеСкидки);
	
	ПримененныеСкидки = СкидкиНаценкиСервер.Рассчитать(Объект, СтруктураПараметры);
	
	СкидкиИзменились = Ложь;
	
	КоличествоСтрок = ПримененныеСкидки.ТаблицаСкидкиНаценки.Количество();
	Если КоличествоСтрок <> Объект.СкидкиНаценки.Количество() Тогда
		СкидкиИзменились = Истина;
	Иначе
		
		Если Объект.Товары.Итог("СуммаАвтоматическойСкидки") <> Объект.СкидкиНаценки.Итог("Сумма") Тогда
			СкидкиИзменились = Истина;
		КонецЕсли;
		
		Для НомерСтроки = 1 По КоличествоСтрок Цикл
			Если    Объект.СкидкиНаценки[НомерСтроки-1].Сумма <> ПримененныеСкидки.ТаблицаСкидкиНаценки[НомерСтроки-1].Сумма
				ИЛИ Объект.СкидкиНаценки[НомерСтроки-1].КлючСвязи <> ПримененныеСкидки.ТаблицаСкидкиНаценки[НомерСтроки-1].КлючСвязи
				ИЛИ Объект.СкидкиНаценки[НомерСтроки-1].СкидкаНаценка <> ПримененныеСкидки.ТаблицаСкидкиНаценки[НомерСтроки-1].СкидкаНаценка
				ИЛИ Объект.СкидкиНаценки[НомерСтроки-1].НапомнитьПозже <> ПримененныеСкидки.ТаблицаСкидкиНаценки[НомерСтроки-1].НапомнитьПозже Тогда
				СкидкиИзменились = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если СкидкиИзменились Тогда
		АдресПримененныхСкидокВоВременномХранилище = ПоместитьВоВременноеХранилище(ПримененныеСкидки, УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат СкидкиИзменились;
	
КонецФункции

&НаКлиенте
Процедура ПрименитьИзмененияСкидокНаценокНаКлиенте(Знач Оповещение)
	
	СтруктураСообщений = РассчитатьСкидкиНаценкиНаСервере(Неопределено, Истина);
	Если СтруктураСообщений.Сообщения.Количество() > 0 И СтруктураСообщений.АвтоматическиОткрывать Тогда
		ОткрытьФорму("ОбщаяФорма.СообщенияСкидокНаценок", СтруктураСообщений, ЭтаФорма,,,, Новый ОписаниеОповещения("ПрименитьИзмененияСкидокНаценокНаКлиентеЗавершение", ЭтотОбъект, Новый Структура("Оповещение", Оповещение)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;
	КонецЕсли;
	
	ПрименитьИзмененияСкидокНаценокНаКлиентеФрагмент(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИзмененияСкидокНаценокНаКлиентеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Оповещение = ДополнительныеПараметры.Оповещение;
	
	
	ПрименитьИзмененияСкидокНаценокНаКлиентеФрагмент(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИзмененияСкидокНаценокНаКлиентеФрагмент(Знач Оповещение)
	
	ПоказатьОповещениеПользователя(
	НСтр("ru = 'Скидки (наценки)'"),
	,
	НСтр("ru = 'Скидки (наценки) рассчитаны'"),
	БиблиотекаКартинок.Информация32);
	//ОбновитьТекстИнформационнойНадписиФормируемыеДокументы();
	ВыполнитьОбработкуОповещения(Оповещение);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруСообщений()
	
	Возврат СкидкиНаценкиСервер.ПолучитьСтруктуруСообщений(Объект);
	
КонецФункции

&НаКлиенте
Процедура ПоказатьСообщения(Команда)
	
	СкидкиНаценкиКлиент.ОткрытьФормуСообщений(ПолучитьСтруктуруСообщений(), ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти





&НаКлиенте
Процедура НазначитьАвтоматическиеСкидки(Команда)
	
	АдресВХранилище = ВыполнитьПредварительныйРасчетСкидокНаСервере();
	Оповещение = Новый ОписаниеОповещения("НазначитьАвтоматическиеСкидкиЗавершение", ЭтотОбъект);
	СкидкиНаценкиКлиент.ОткрытьФормуНазначенияУправляемыхСкидокНаценок(АдресВХранилище, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьАвтоматическиеСкидкиЗавершение(ВозвращенноеЗначение, ДополнительныеПараметры) Экспорт 
	
	Если ВозвращенноеЗначение <> Неопределено Тогда
		УправляемыеСкидки = ВозвращенноеЗначение;
		
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
		СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
		СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Ложь);
		СтруктураПараметры.Вставить("УправляемыеСкидки", УправляемыеСкидки);
		
		СтруктураСообщений = РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры);
		Если СтруктураСообщений.Сообщения.Количество() > 0 И СтруктураСообщений.АвтоматическиОткрывать Тогда
			ОткрытьФорму("ОбщаяФорма.СообщенияСкидокНаценок", СтруктураСообщений, ЭтаФорма, УникальныйИдентификатор);
		КонецЕсли;
		
		ПоказатьОповещениеПользователя(
		НСтр("ru = 'Скидки (наценки)'"),
		,
		НСтр("ru = 'Скидки (наценки) рассчитаны'"),
		БиблиотекаКартинок.Информация32);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьРучнуюСкидку(Команда)
	
	Если Не СкидкиНаценкиКлиент.ВозможноНазначениеРучнойСкидкиНаценки(Объект, "Товары", НСтр("ru='Товары'")) Тогда
		Возврат;
	КонецЕсли;
	
	АдресВоВременномХранилище = АдресДанныхДляРасчетаРучныхСкидокВоВременномХранилище(Ложь);
	
	Оповещение = Новый ОписаниеОповещения(
	"НазначитьРучнуюСкидкуЗавершение", 
	ЭтотОбъект, 
	Новый Структура("АдресВоВременномХранилище", АдресВоВременномХранилище));
	
	СкидкиНаценкиКлиент.ОткрытьФормуНазначенияРучныхСкидок(
	АдресВоВременномХранилище,
	Объект.Валюта,
	Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьРучнуюСкидкуЗавершение(СуммаРучнойСкидкиНаценки, ДополнительныеПараметры) Экспорт 
	
	АдресВоВременномХранилище = ДополнительныеПараметры.АдресВоВременномХранилище;
	
	Если СуммаРучнойСкидкиНаценки <> Неопределено Тогда
		
		НазначитьРучнуюСкидкуНаСервере(СуммаРучнойСкидкиНаценки,, АдресВоВременномХранилище);
		СкидкиНаценкиКлиент.ОповеститьОбОкончанииНазначенияРучныхСкидокНаценок(СуммаРучнойСкидкиНаценки, Объект.Валюта);
		
		//РассчитатьИтоговыеПоказатели(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьРучнуюСкидкуДляВыделенныхСтрок(Команда)
	
	Если Не СкидкиНаценкиКлиент.ВозможноНазначениеРучнойСкидкиНаценки(Объект, "Товары", НСтр("ru='Товары'")) Тогда
		Возврат;
	КонецЕсли;
	
	АдресВоВременномХранилище = АдресДанныхДляРасчетаРучныхСкидокВоВременномХранилище(Истина);
	
	Оповещение = Новый ОписаниеОповещения(
	"НазначитьРучнуюСкидкуДляВыделенныхСтрокЗавершение", 
	ЭтотОбъект, 
	Новый Структура("АдресВоВременномХранилище", АдресВоВременномХранилище));
	
	СкидкиНаценкиКлиент.ОткрытьФормуНазначенияРучныхСкидок(
	АдресВоВременномХранилище,
	Объект.Валюта,
	Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьРучнуюСкидкуДляВыделенныхСтрокЗавершение(СуммаРучнойСкидкиНаценки, ДополнительныеПараметры) Экспорт 
	
	АдресВоВременномХранилище = ДополнительныеПараметры.АдресВоВременномХранилище;
	
	Если СуммаРучнойСкидкиНаценки <> Неопределено Тогда
		
		НазначитьРучнуюСкидкуНаСервере(СуммаРучнойСкидкиНаценки, Элементы.Товары.ВыделенныеСтроки, АдресВоВременномХранилище);
		СкидкиНаценкиКлиент.ОповеститьОбОкончанииНазначенияРучныхСкидокНаценок(СуммаРучнойСкидкиНаценки, Объект.Валюта);
		
		//РассчитатьИтоговыеПоказатели(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьРучныеСкидки(Команда)
	
	Если Не СкидкиНаценкиКлиент.ВозможнаОтменаРучныхСкидокНаценок(Объект, "Товары", НСтр("ru='Товары'")) Тогда
		Возврат;
	КонецЕсли;
	
	ОтменитьРучныеСкидкиНаСервере();
	СкидкиНаценкиКлиент.ОповеститьОбОкончанииНазначенияРучныхСкидокНаценок();
	
	//РассчитатьИтоговыеПоказатели(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнформациюОСкидках(Команда)
	
	Если НЕ Объект.СкидкиРассчитаны Тогда
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
		СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
		СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
		СтруктураПараметры.Вставить("УправляемыеСкидки", УправляемыеСкидки);
		
		СтруктураСообщений = РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры);
		Если СтруктураСообщений.Сообщения.Количество() > 0 И СтруктураСообщений.АвтоматическиОткрывать Тогда
			ОткрытьФорму("ОбщаяФорма.СообщенияСкидокНаценок", СтруктураСообщений, ЭтаФорма, УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(АдресПримененныхСкидокВоВременномХранилище) Тогда
		РассчитатьСкидкиБезПримененияКОбъекту();
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	СкидкиНаценкиКлиент.ОткрытьФормуПримененныеСкидки(ТекущиеДанные, Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныПоСоглашению(Команда) Экспорт
	
	Если ПродажиКлиент.НеобходимоЗаполнениеЦенПоСоглашению(Объект, "Товары", НСтр("ru='Товары'")) Тогда
		
		ЦеныРассчитаны = ЗаполнитьЦеныПоСоглашениюСервер();
		ПродажиКлиент.ОповеститьОбОкончанииЗаполненияЦенПоСоглашению(ЦеныРассчитаны);
		
	КонецЕсли;
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныВыделенныхСтрокПоВидуЦен(Команда)
	
	Если ПродажиКлиент.НеобходимоЗаполнениеЦенПоВидуЦен(Объект, "Товары", НСтр("ru='Товары'")) Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ПродажиКлиент.ВыбратьВидЦен(
		Новый ОписаниеОповещения("ЗаполнитьЦеныВыделенныхСтрокПоВидуЦенЗавершение", ЭтотОбъект, ДополнительныеПараметры),
		Объект.ЦенаВключаетНДС,
		Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныВыделенныхСтрокПоВидуЦенЗавершение(ВидЦен, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ВидЦен) Тогда
		
		ЦеныРассчитаны = ЗаполнитьЦеныВыделенныхСтрокПоВидуЦенСервер(ВидЦен);
		ПродажиКлиент.ОповеститьОбОкончанииЗаполненияЦенПоВидуЦен(ЦеныРассчитаны, ВидЦен);
		СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаЦеныНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗакрытьОбработку Тогда
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), НСтр("ru = 'Работа будет завершена, все введенные данные будут потеряны. Закрыть?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗакрытьОбработку = Истина;
        Закрыть();
    КонецЕсли;

КонецПроцедуры



&НаКлиенте
Процедура ОткрытьСправочникСловарьАвтозамен(Команда)
	
	ОткрытьФорму("РегистрСведений.мегапрайсСловарьАвтозамен.ФормаСписка");

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьАналоги(Команда)
	
	ТекущиеДанныеСтроки = Новый Структура;
	ТекущиеДанныеСтроки.Вставить("Номенклатура",ПодборТекущаяНоменклатура);
	
	ОткрытьФорму("РегистрСведений.мегапрайсВзаимозаменяемостьНоменклатуры.Форма.ФормаЗаписи", ТекущиеДанныеСтроки, ЭтаФорма);

КонецПроцедуры


&НаКлиенте
Процедура ОткрытьЖурналЗаказов(Команда)
	
	ОткрытьФорму("Документ.ЗаказКлиента.ФормаСписка");

КонецПроцедуры

 &НаКлиенте
 Процедура ОткрытьЖурналМегапрайс(Команда)
	 
	 ОткрытьФорму("РегистрСведений.мегапрайсЦеныНоменклатурыПоставщиков.ФормаСписка");
	 
 КонецПроцедуры





ЗакрытьОбработку = Ложь;






































