
Процедура ПередУдалением(Отказ)
	
	УдалитьРегламентноеЗадание();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИдентификаторРегламентногоЗадания = Неопределено;
	
КонецПроцедуры

Функция ПолучитьРегламентноеЗадание() Экспорт
	
	Если ЗначениеЗаполнено(ИдентификаторРегламентногоЗадания) Тогда
		УстановитьПривилегированныйРежим(Истина);	
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторРегламентногоЗадания);
		УстановитьПривилегированныйРежим(Ложь);
	Иначе
		Задание = Неопределено;
	КонецЕсли;
	
	Возврат Задание;
	
КонецФункции

Процедура УдалитьРегламентноеЗадание() Экспорт
	
	Задание = ПолучитьРегламентноеЗадание();
	
	Если НЕ Задание = Неопределено Тогда
		УстановитьПривилегированныйРежим(Истина);
		Задание.Удалить();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры
