&НаСервереБезКонтекста
Функция УжеЕсть(лСсылка,лИсходныйДокумент)
	Если лИсходныйДокумент<>Неопределено тогда
		Если не лИсходныйДокумент.Пустая() тогда
			Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДатаМобайл_ДокументыТСД.Ссылка
			|ИЗ
			|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
			|ГДЕ
			|	ДатаМобайл_ДокументыТСД.ИсходныйДокумент = &ИсходныйДокумент
			|	И ДатаМобайл_ДокументыТСД.Ссылка <> &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",лСсылка);
			Запрос.УстановитьПараметр("ИсходныйДокумент",лИсходныйДокумент);
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() тогда
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если УжеЕсть(Объект.Ссылка,Объект.ИсходныйДокумент) тогда
		Если Вопрос("Для документа "+Объект.ИсходныйДокумент+" уже создан документ ТСД. Продолжить?",РежимДиалогаВопрос.ДаНет,10,КодВозвратаДиалога.Нет,КодВозвратаДиалога.Нет)=КодВозвратаДиалога.Нет тогда
			Отказ=Истина;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
