
Процедура ПередУдалением(Отказ)
	
	УдалитьРегламентноеЗадание();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИдентификаторРегламентногоЗадания = НеОпределено;
	
КонецПроцедуры

Функция ПолучитьРегламентноеЗадание() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторРегламентногоЗадания);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Задание;
	
КонецФункции

Процедура УдалитьРегламентноеЗадание() Экспорт
	
	Задание = ПолучитьРегламентноеЗадание();
	Если НЕ Задание = НеОпределено Тогда
		УстановитьПривилегированныйРежим(Истина);
		Задание.Удалить();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры
