
&НаСервере
Процедура УстановитьСоответствияПроизводителей(ТабличнаяЧасть,СоответствияПроизводителей) Экспорт
	
	СпрПроизводители = Справочники.Производители;
	ПустаяСсылка     = СпрПроизводители.ПустаяСсылка();
	ПустаяСсылкаМегапрайс = Справочники.мегапрайсСоответствияПроизводителей.ПустаяСсылка();
	
	Для Каждого Стр Из СоответствияПроизводителей Цикл
		
		Если ЗначениеЗаполнено(Стр.ПроизводительСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		НайденнаяСсылкаПроизводитель = ПустаяСсылка;
		
		СтрПоле_Производитель = СокрЛП(Стр.Поле_Производитель);
		
		Попытка
			НайтиСоответствие = Справочники.мегапрайсСоответствияПроизводителей.НайтиПоНаименованию(СтрПоле_Производитель,Истина);
			Если НЕ НайтиСоответствие = ПустаяСсылкаМегапрайс Тогда
				НайденнаяСсылкаПроизводитель = НайтиСоответствие.Производитель; 
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Если НайденнаяСсылкаПроизводитель = ПустаяСсылка Тогда
			НайденнаяСсылкаПроизводитель = СпрПроизводители.НайтиПоНаименованию(СтрПоле_Производитель,Истина);
		КонецЕсли;
		
		Если НайденнаяСсылкаПроизводитель = ПустаяСсылка Тогда
			НовыйПроизводитель = СпрПроизводители.СоздатьЭлемент();
			НовыйПроизводитель.Наименование = СтрПоле_Производитель;
			НовыйПроизводитель.Записать();
			
			НайденнаяСсылкаПроизводитель = НовыйПроизводитель.Ссылка;
		КонецЕсли;
				
		Стр.ПроизводительСсылка = НайденнаяСсылкаПроизводитель;
		
		Отбор = Новый Структура();
		Отбор.Вставить("Поле_Производитель",СтрПоле_Производитель);
		НайтиСтроки = ТабличнаяЧасть.НайтиСтроки(Отбор);
		Если НайтиСтроки.Количество() > 0 Тогда
			Для Каждого СтрТаблицы Из НайтиСтроки Цикл
				СтрТаблицы.ПроизводительСсылка = НайденнаяСсылкаПроизводитель;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
