
Функция ШаблонURLsavealldata(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
    Данные = Запрос.ПолучитьТелоКакСтроку(); 
	
//ТекстДок = Новый ТекстовыйДокумент;

	Пароль       = Запрос.Заголовки["Password"];  		
	result = "ok";
	
Попытка
	ДанныеСтрока      = мпПредметныйСервер.СохранитьДанныеСМобильногоПриложения(Пароль, Данные);
		
Исключение
	
	result = "error";
	
	ДанныеСтрока = мпОбщегоНазначения.ДанныеПереводимВСтроку(ОписаниеОшибки());
//	//ДанныеСтрока = мпОбщегоНазначения.ДанныеПереводимВСтроку(СтруктураВозврат);
//	
КонецПопытки;
////	
	Ответ.Заголовки.Вставить("result",result);
	Ответ.УстановитьТелоИзСтроки(ДанныеСтрока);
	
	
	Возврат Ответ;
	
КонецФункции
