

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СхемаЗапроса");
	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	Объект.КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	Объект.КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);

КонецПроцедуры

 &НаКлиенте
 Процедура ФайлКаталогНаЛокальномДискеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	 
	 СтандартнаяОбработка = Ложь;
	 
	 ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	 ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите путь'");
	 
	 ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ФайлКаталогНаЛокальномДискеНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ДиалогОткрытияФайла", ДиалогОткрытияФайла)));		
	 
 КонецПроцедуры
 
 &НаКлиенте
 Процедура ФайлКаталогНаЛокальномДискеНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	 
	 ДиалогОткрытияФайла = ДополнительныеПараметры.ДиалогОткрытияФайла;
	 	 
	 Если (ВыбранныеФайлы <> Неопределено) Тогда
		 Объект.ПутьКФайлу = ДиалогОткрытияФайла.Каталог;
	 КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ВыгрузитьНаСервере()
	
	ОбработкаОбъект =  РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СформироватьВыгрузку();
		
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ВыгрузитьНаСервере();
	Сообщить("Выгрузка успешно завершена.");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	
	Объект.ТабличнаяЧасть.Очистить();
	
	ТекстовыйФайл = Новый ЧтениеТекста(Объект.ПутьКФайлу+"\megaprice_export.csv",КодировкаТекста.ANSI);            
	ВыборкаСтрока =  ТекстовыйФайл.ПрочитатьСтроку();
	
	Пока ВыборкаСтрока <> Неопределено Цикл // строки читаются до символа перевода строки
		
		//Сообщить(ВыборкаСтрока);
		ВыборкаСтрока =  ТекстовыйФайл.ПрочитатьСтроку();
		Если ПустаяСтрока(ВыборкаСтрока) Тогда
			Продолжить;
		КонецЕсли;
		
		Массив = СтрРазделить(ВыборкаСтрока,";");
		НоваяСтрока = Объект.ТабличнаяЧасть.Добавить();
		НоваяСтрока.Поле_Код = Массив.Получить(0);
		НоваяСтрока.Поле_Артикул = Массив.Получить(1);
		НоваяСтрока.Поле_Наименование = Массив.Получить(2);
		НоваяСтрока.Поле_Характеристика = Массив.Получить(3);
		НоваяСтрока.Поле_Склад = Массив.Получить(4);
		НоваяСтрока.Поле_Количество = Массив.Получить(5);
		НоваяСтрока.Поле_Цена = Массив.Получить(6);
		
	КонецЦикла;	
	
	ТекстовыйФайл.Закрыть(); 		
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ЗагрузитьНаСервере();
	Сообщить("Загрузка успешно завершена.");
	
КонецПроцедуры

&НаСервере
Процедура СинхронизироватьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.мСинхронизироватьСервер();	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

	Для Каждого ВыборкаСтрока ИЗ Объект.ТабличнаяЧасть Цикл
		
		Если НЕ ПустаяСтрока(ВыборкаСтрока.Поле_Склад) Тогда
			НайтиСклад = Справочники.Склады.НайтиПоНаименованию(ВыборкаСтрока.Поле_Склад);
			Если НайтиСклад = Справочники.Склады.ПустаяСсылка() Тогда
				НайтиСклад = Справочники.Склады.СоздатьЭлемент();
				НайтиСклад.Наименование = ВыборкаСтрока.Поле_Склад;
				НайтиСклад.Записать();
			КонецЕсли;
			ВыборкаСтрока.Склад = НайтиСклад.Ссылка;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ВыборкаСтрока.Поле_Характеристика) Тогда
			ВыборкаСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(ВыборкаСтрока.Поле_Характеристика,,,ВыборкаСтрока.Номенклатура);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Синхронизировать(Команда)
	
	СинхронизироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура МегапрайсРегистрацияНаСервере()
	
	
	Если НЕ ЗначениеЗаполнено(Объект.ПрофильПрайсЛиста) Тогда
		Сообщить("Не выбран профиль прайса поставщика");
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.мегапрайсЦеныНоменклатурыПоставщиков.УдалитьПрайсЛист(Объект.ПрофильПрайсЛиста);
	
	ПустаяСсылка  = Справочники.Номенклатура.ПустаяСсылка();
		
	НаборЗаписей = РегистрыСведений.мегапрайсЦеныНоменклатурыПоставщиков.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПрайсПартнера.Установить(Объект.ПрофильПрайсЛиста);
	
	МаксСтрокЗапись = 10000;
	КолОбработанныхСтрок = 0;
	Для Каждого Стр из Объект.ТабличнаяЧасть Цикл			
		КолОбработанныхСтрок = КолОбработанныхСтрок +1;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период        = ТекущаяДата();	
		НоваяЗапись.КлючСтроки    = Стр.НомерСтроки;
		НоваяЗапись.ПрайсПартнера = Объект.ПрофильПрайсЛиста;
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Стр);
		НоваяЗапись.Количество   = Стр.Поле_Количество;	
		НоваяЗапись.Валюта       = "";			
		НоваяЗапись.Цена         = 0;
		НоваяЗапись.ЦенаПродажи  = Стр.Поле_Цена;	
		НоваяЗапись.МинимальныйЗаказ  = 0;	
		//Если КолОбработанныхСтрок = 20000 Тогда
		//	//НаборЗаписей.ОбменДанными.Загрузка = Истина;
		//	НаборЗаписей.Записать(Ложь);
		//	НаборЗаписей.Очистить();
		//	КолОбработанныхСтрок = 0;
		//КонецЕсли;
	КонецЦикла;
	
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	
	//ТекстСОобщения = "Прайс загружен (вручную). - "+ПрайсПартнера+"  идентификатор прайса - "+ИдентификаторПрайса;
	//СообщениеВЖурнал(ТекстСОобщения);
	//Если НЕ ЗагруженРоботом Тогда
	//	мегапрайсЗаписатьСобытиеВЖурнал(ПрайсПартнера,ТекстСОобщения);	
	//КонецЕсли;
	
	//ПрофильОбъект = ПрайсПартнера.ПолучитьОбъект();
	//ПрофильОбъект.ИдентификаторПрайса = ИдентификаторПрайса;
	//ПрофильОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура МегапрайсРегистрация(Команда)
	
	МегапрайсРегистрацияНаСервере();
	
КонецПроцедуры
