
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Обработка.ЗагрузкаДанныхИзВнешнихФайловЦеновыеГруппы.Форма.Форма" Тогда
		
		ПолучитьЗагруженныеТоварыИзХранилища(ВыбранноеЗначение.АдресТоваровВХранилище); 
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗагруженныеТоварыИзХранилища(АдресТоваровВХранилище)
	
	ТоварыИзХранилища = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	
	ТоварыИзХранилища.Колонки.Добавить("ЦеноваяГруппа");
	
	Для Каждого СтрокаТоваров Из ТоварыИзХранилища Цикл
		Если ТипЗнч(СтрокаТоваров.Номенклатура) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
			СтрокаТоваров.ЦеноваяГруппа = СтрокаТоваров.Номенклатура;
		Иначе	
			СтрокаТоваров.ЦеноваяГруппа = СтрокаТоваров.Номенклатура.ЦеноваяГруппа;
		КонецЕсли; 
		
	КонецЦикла;
	
	ТоварыИзХранилища.Свернуть("ЦеноваяГруппа, Цена");
	
	Для Каждого СтрокаТоваров Из ТоварыИзХранилища Цикл
		
		ПараметрыОтбора = Новый Структура("ЦеноваяГруппа", СтрокаТоваров.ЦеноваяГруппа);
		НайденныеСтроки = Объект.ЗначенияПоЦеновымГруппам.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() Тогда
			Для каждого Строка Из НайденныеСтроки Цикл
			
				Строка.Значение = СтрокаТоваров.Цена;
			
			КонецЦикла; 
		Иначе	
		    НоваяСтрока = Объект.ЗначенияПоЦеновымГруппам.Добавить();
			НоваяСтрока.ЦеноваяГруппа = СтрокаТоваров.ЦеноваяГруппа;
			НоваяСтрока.Значение = СтрокаТоваров.Цена;
		КонецЕсли; 
		
		НоваяЦена 			= СтрокаТоваров.Цена;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайла(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗагружатьЦены", Истина);
	ПараметрыФормы.Вставить("ЗагружатьКоличество", Ложь);
		
	ОткрытьФорму(
		"Обработка.ЗагрузкаДанныхИзВнешнихФайловЦеновыеГруппы.Форма.Форма",
		ПараметрыФормы,
		ЭтаФорма,
		УникальныйИдентификатор);
	
КонецПроцедуры