

//Нажатие кнопки заполнить
&НаСервере
Процедура КомандаЗаполнитьНаСервере()
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ГАЛ_МаршрутыСрезПоследних.ЗаказНаДоставку,
	                |	ГАЛ_МаршрутыСрезПоследних.ЗаказНаДоставку.СуммаДокумента КАК СуммаДокумента
	                |ИЗ
	                |	РегистрСведений.ГАЛ_Маршруты.СрезПоследних КАК ГАЛ_МаршрутыСрезПоследних
	                |ГДЕ
	                |	ГАЛ_МаршрутыСрезПоследних.ДатаДоставки = &ДатаДоставки
	                |	И ГАЛ_МаршрутыСрезПоследних.КурьерЭкспедитор = &КурьерЭкспедитор";
	 
	 Запрос.УстановитьПараметр("ДатаДоставки", Объект.ДатаДоставки);
	 Запрос.УстановитьПараметр("КурьерЭкспедитор", Объект.КурьерЭкспедитор);
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 
	 Если Выборка.Количество()> 0 Тогда
		 Пока Выборка.Следующий() Цикл
			 
			   НоваяСтрока = Объект.Оплаты.Добавить();
			   НоваяСтрока.ЗаказНаДоставку = Выборка.ЗаказНаДоставку;
			   НоваяСтрока.ТипДС = Перечисления.ГАЛ_ТипыДенежныхСредств.Наличные;
			   НоваяСтрока.Сумма = Выборка.СуммаДокумента;
		 КонецЦикла;
	 КонецЕсли;
	 
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаДоставки) Тогда
		СообщитьП=Новый СообщениеПользователю;
		СообщитьП.Текст = "Необходимо заполнить дату доставки!";
		СообщитьП.Поле="ДатаДоставки";
		СообщитьП.ПутьКДанным = "Объект";
		СообщитьП.Сообщить();
		Возврат;
	КонецЕсли;
	
		Если НЕ ЗначениеЗаполнено(Объект.КурьерЭкспедитор) Тогда
		СообщитьП=Новый СообщениеПользователю;
		СообщитьП.Текст = "Необходимо заполнить курьера!";
		СообщитьП.Поле="КурьерЭкспедитор";
		СообщитьП.ПутьКДанным = "Объект";
		СообщитьП.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Объект.Оплаты.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
		ЭтотОбъект);	
		
		ПоказатьВопрос(Оповещение,
		"Очистить табличную часть перед заполнением?",
		РежимДиалогаВопрос.ДаНет,
		0, // таймаут в секундах
		КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
		"Внимание" // (необ.) заголовок
		);   
	Иначе
		КомандаЗаполнитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры


//Обработка после вопроса
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
        Объект.Оплаты.Очистить();
		КомандаЗаполнитьНаСервере();
	КонецЕсли;	
 
КонецПроцедуры