
&НаСервереБезКонтекста
Функция ПолучитьПустуюСсылку()
	
	Возврат Справочники.Номенклатура.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура ТаблицыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.ТаблицыДанныеПрайса.ТекущаяСтраница = Элементы.ТаблицыДанныеПрайса.ПодчиненныеЭлементы.ТаблицаВсе Тогда
		
		Элементы.Товары.ОтборСтрок = Неопределено;
		
	ИначеЕсли Элементы.ТаблицыДанныеПрайса.ТекущаяСтраница = Элементы.ТаблицыДанныеПрайса.ПодчиненныеЭлементы.БезСоответствий Тогда
		
		Элементы.ТоварыБезСоответствий.ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура",ПолучитьПустуюСсылку());	

	КонецЕсли;
	
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// Обработчик подсистемы "Внешние обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	// Обработчик подсистемы "Свойства"
	//УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, Объект, "ГруппаДополнительныеРеквизиты");

КонецПроцедуры
