
&НаКлиенте
Процедура ОткрытьАнализаторПрайсов(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Сообщить("Станьте на строку с видом нужной цены.");
		Возврат;
	КонецЕсли;

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РасширенныйВидЦен", ТекущиеДанные.Ссылка);

	ОткрытьФорму("Обработка.мегапрайсАнализаторПрайсов.Форма.Форма",СтруктураПараметров,ЭтаФорма);

КонецПроцедуры



&НаКлиенте
Процедура ВыполнитьРобот(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьВопрос", ЭтотОбъект), НСтр("ru = 'Вы уверены?'"), РежимДиалогаВопрос.ДаНет);	
		
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;	
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	МегапрайсРобот.мегапрайсУстановкаЦенВыборка(ТекущиеДанные.Ссылка);
	
КонецПроцедуры

