
&НаСервереБезКонтекста
&НаСервереБезКонтекста
Функция ДокументПодходит(МетаДок)
	Для Каждого МетаТЧ из МетаДок.ТабличныеЧасти цикл
		Для Каждого МетаРеквизитТЧ из МетаТЧ.Реквизиты цикл
			Если МетаРеквизитТЧ.Тип.СодержитТип(Тип("СправочникСсылка.Номенклатура")) ИЛИ МетаРеквизитТЧ.Тип.СодержитТип(Тип("СправочникСсылка.КлассификаторАлкогольнойПродукцииЕГАИС")) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	Возврат ложь;
КонецФункции
&НаСервереБезКонтекста
Функция СобратьВидыДокументов(Список)
	для каждого МетаДок из метаданные.Документы Цикл
		Если ДокументПодходит(МетаДок) тогда
			Список.Добавить(МетаДок.Имя,МетаДок.Синоним);
		КонецЕсли;	
	КонецЦикла;
КонецФункции	
&НаСервереБезКонтекста
Функция СобратьТабЧастиДокументов(ВидДокумента,Список)
	Список.Очистить();
	МетаДок=Метаданные.Документы.Найти(ВидДокумента);
	Если МетаДок=Неопределено тогда
		Возврат Ложь;
	КонецЕсли;	
	Для Каждого МетаТЧ из МетаДок.ТабличныеЧасти цикл
		Для Каждого МетаРеквизитТЧ из МетаТЧ.Реквизиты цикл
			Если МетаРеквизитТЧ.Тип.СодержитТип(Тип("СправочникСсылка.Номенклатура")) ИЛИ
				МетаРеквизитТЧ.Тип.СодержитТип(Тип("СправочникСсылка.КлассификаторАлкогольнойПродукцииЕГАИС")) Тогда
				Список.Добавить(МетаТЧ.Имя);
				Прервать;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
КонецФункции	
&НаСервереБезКонтекста
Функция СобратьРеквизитыДокумента(ВидДокумента,Список)
	Список.Очистить();
	МетаДок=Метаданные.Документы.Найти(ВидДокумента);
	Если МетаДок=Неопределено тогда
		Возврат Ложь;
	КонецЕсли;	
	Для Каждого МетаРеквизит из МетаДок.Реквизиты цикл
		Список.Добавить(МетаРеквизит.Имя);
	КонецЦикла;
КонецФункции	

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	НовСписок=Новый СписокЗначений();
	СобратьТабЧастиДокументов(Объект.ВидДокумента,НовСписок);
	Элементы.ИмяТабличнойЧастиПодбор.СписокВыбора.ЗагрузитьЗначения(НовСписок.ВыгрузитьЗначения());
	Элементы.ИмяТабличнойЧастиПриемка.СписокВыбора.ЗагрузитьЗначения(НовСписок.ВыгрузитьЗначения());
	Если Объект.ВидДокументаНового="" тогда
		НовСписок=Новый СписокЗначений();
		СобратьРеквизитыДокумента(Объект.ВидДокумента,НовСписок);
		Элементы.НовыеЗначенияРеквизитовИмяРеквизита.СписокВыбора.ЗагрузитьЗначения(НовСписок.ВыгрузитьЗначения());
	КонецЕслИ;	
	
	Объект.ИмяТабличнойЧастиПодбор = ?(Объект.ИспользоватьПодбор,"Товары","");
	Объект.ИмяТабличнойЧастиПриемка = ?(Объект.ИспользоватьПриемку,"Товары","");	
	
	Если НЕ ПроверитьВозможностьАдресногоХранения("Подбор", Объект.ВидДокумента, Объект.ИмяТабличнойЧастиПодбор, Объект.ИмяТабличнойЧастиПриемка) ИЛИ НЕ ПроверитьВозможностьАдресногоХранения("Приемка", Объект.ВидДокумента,  Объект.ИмяТабличнойЧастиПодбор, Объект.ИмяТабличнойЧастиПриемка) Тогда
		
			Предупреждение("Документ "+элементы.ВидДокумента.ТекстРедактирования+" не поддерживает адресное хранение. ",,"Отсутствуют реквизиты А.Х.");
		
	КонецЕсли;
	
	
КонецПроцедуры
&НаКлиенте
Процедура ВидДокументаНовогоПриИзменении(Элемент)
	НовСписок=Новый СписокЗначений();
	СобратьТабЧастиДокументов(Объект.ВидДокументаНового,НовСписок);
	Элементы.ИмяТабличнойЧастиНовойПодбор.СписокВыбора.ЗагрузитьЗначения(НовСписок.ВыгрузитьЗначения());
	Элементы.ИмяТабличнойЧастиНовойПриемка.СписокВыбора.ЗагрузитьЗначения(НовСписок.ВыгрузитьЗначения());
	НовСписок=Новый СписокЗначений();
	СобратьРеквизитыДокумента(Объект.ВидДокументаНового,НовСписок);
	Элементы.НовыеЗначенияРеквизитовИмяРеквизита.СписокВыбора.ЗагрузитьЗначения(НовСписок.ВыгрузитьЗначения());
	Элементы.ТабличнуюЧастьПриЗагрузкеПодбор.Заголовок=?(Объект.ВидДокументаНового="","Табличную часть исходного документа при загрузке","Табличную часть нового документа при загрузке");
	Элементы.ТабличнуюЧастьПриЗагрузкеПриемка.Заголовок=?(Объект.ВидДокументаНового="","Табличную часть исходного документа при загрузке","Табличную часть нового документа при загрузке");
	
	Объект.ИмяТабличнойЧастиНовойПодбор = ?(Объект.ИспользоватьПодбор,"Товары","");
	Объект.ИмяТабличнойЧастиНовойПриемка = ?(Объект.ИспользоватьПриемку,"Товары","");	
	
	Если НЕ (ПроверитьВозможностьАдресногоХранения("Подбор", Объект.ВидДокументаНового, Объект.ИмяТабличнойЧастиНовойПодбор, Объект.ИмяТабличнойЧастиНовойПриемка)) ИЛИ НЕ(ПроверитьВозможностьАдресногоХранения("Приемка", Объект.ВидДокументаНового,  Объект.ИмяТабличнойЧастиНовойПодбор, Объект.ИмяТабличнойЧастиНовойПриемка)) Тогда
		
			Предупреждение("Документ "+элементы.ВидДокументаНового.ТекстРедактирования+" не поддерживает адресное хранение. ",,"Отсутствуют реквизиты А.Х.");
		
	КонецЕсли;

	
КонецПроцедуры

Функция СобратьВидыДокументовЕГАИС(Список)
	для каждого МетаДок из метаданные.Документы Цикл
		Если ДокументПодходитЕГАИС(МетаДок) тогда
			Список.Добавить(МетаДок.Имя,МетаДок.Синоним);
		КонецЕсли;	
	КонецЦикла;
КонецФункции

&НаСервере

Функция ДокументПодходитЕГАИС(МетаДок)
	Для Каждого МетаТЧ из МетаДок.ТабличныеЧасти цикл
		Для Каждого МетаРеквизитТЧ из МетаТЧ.Реквизиты цикл
			Если МетаРеквизитТЧ.Тип.СодержитТип(Тип("СправочникСсылка.КлассификаторАлкогольнойПродукцииЕГАИС")) ИЛИ
				 МетаРеквизитТЧ.Имя = "КодАкцизнойМарки"	Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	Возврат ложь;
КонецФункции

Процедура СформироватьшаблонЕГАИС(ИЗОткрытия = ЛОЖЬ)
	
	ПризнакЕГАИС = Не Объект.ЕГАИС;
	
	Элементы.ВидДокумента.СписокВыбора.Очистить();
	
	Если ПризнакЕГАИС Тогда
		СобратьВидыДокументов(Элементы.ВидДокумента.СписокВыбора);
		Объект.СопоставлениеЕГАИС = ЛОЖЬ;
		Элементы.СопоставлениеЕГАИС.Доступность = ЛОЖЬ;
		Объект.ЕГАИСИспользоватьДатуРозлива = ЛОЖЬ;
		Элементы.ЕГАИСИспользоватьДатуРозлива.Доступность = ЛОЖЬ;
		Объект.ЕгаисИспользоватьМарку = 0;
		Элементы.ЕгаисИспользоватьМарку.Доступность = ЛОЖЬ;
		Элементы.ЕГАИСРежимВВодаPDF417.Доступность = ЛОЖЬ;
		Элементы.ВерсияЕГАИС.Доступность = ЛОЖЬ;
		Элементы.ИспользоватьПодбор.Доступность = Истина;
		
		Элементы.ЕГАИСИспользоватьПроверкуМарок.Доступность = ЛОЖЬ;
		Объект.ЕГАИСИспользоватьПроверкуМарок = 0;
		
		Элементы.ЕГАИСИспользоватьСправкуА.Доступность = ЛОЖЬ;
		Элементы.ЕГАИСИспользоватьСправкуБ.Доступность = ЛОЖЬ;
		
		Объект.ЕГАИСИспользоватьСправкуА = 0;
		Объект.ЕГАИСИспользоватьСправкуБ = 0;
	Иначе
		СобратьВидыДокументовЕГАИС(Элементы.ВидДокумента.СписокВыбора);
		Элементы.СопоставлениеЕГАИС.Доступность = Истина;
		Элементы.ЕГАИСИспользоватьДатуРозлива.Доступность = Истина;
		Элементы.ЕгаисИспользоватьМарку.Доступность = Истина;
		Объект.ЕГАИСРежимВВодаPDF417 = 0;
		Элементы.ЕГАИСИспользоватьПроверкуМарок.Доступность = Истина;

		Элементы.ЕГАИСРежимВВодаPDF417.Доступность = Истина;
		Элементы.ВерсияЕГАИС.Доступность = Истина;
		Элементы.ИспользоватьПодбор.Доступность = Истина;
		Элементы.ЕГАИСИспользоватьСправкуА.Доступность = Истина;
		Элементы.ЕГАИСИспользоватьСправкуБ.Доступность = Истина;
	КонецЕсли;

	Если НЕ ИзОткрытия Тогда
		Объект.ВидДокумента = ?(Элементы.ВидДокумента.СписокВыбора.Количество()>0,Элементы.ВидДокумента.СписокВыбора[0].Значение,"");
	КонецЕсли;
	
	
	Если НЕ ИЗОткрытия Тогда
		Наименование = ?(ПризнакЕГАИС,"","[ЕГАИС] ")+?(Элементы.ВидДокумента.СписокВыбора.Количество()>0,Элементы.ВидДокумента.СписокВыбора[0].Представление,"");
	КонецЕсли;
	
	Если НЕ ИЗОткрытия Тогда
		//ВидДокументаПриИзменении(Элементы.ВидДокумента);
		Объект.РезервироватьТовар = ЛОЖЬ;
		Объект.РазрешеноСозданиеНаТСД = ИСТИНА;
		Объект.ОбновлятьТоварыСДокументом = ЛОЖЬ;
		Объект.ПриСканированииНовогоТовара = 1;
		Объект.ГенерацияПаклистаНаСервере = ЛОЖЬ;
		Объект.ШтрихкодыТолькоПоШаблонам = ЛОЖЬ;
		Объект.УникальныеШтрихкодыНоменклатурыВДокументе = ЛОЖЬ;
		Объект.КардРидер_Трек1 = ЛОЖЬ;
		Объект.КардРидер_Трек2 = ЛОЖЬ;
		Объект.КардРидер_Трек3 = ЛОЖЬ;
		Объект.ГрупповаяРабота = ЛОЖЬ;
		Объект.ГрупповаяРаботаЗвуковоеОповещение = ЛОЖЬ;
		Объект.ГрупповаяРаботаИнтервалОпроса = 0;
		Объект.ИспользоватьПодбор = ИСТИНА;
		Объект.ИмяТабличнойЧастиНовойПодбор = "";	
		Объект.ИспользованиеСерийниковПодбор = 0;
		Объект.УчитыватьСерийниковВЗаданииПодбор = ЛОЖЬ;
		Объект.ИспользованиеУпаковочныхЛистовПодбор = 0;
		Объект.ИспользованиеЯчеекПодбор = 0;
		Объект.УчитыватьЯчеекВЗаданииПодбор = ЛОЖЬ;
		Объект.ВыгрузкаЯчеекПодбор = 0;
		Объект.ВидДокументаНового = "";
		Объект.ИспользоватьПриемку = ЛОЖЬ;
		Объект.ТабличнуюЧастьПриЗагрузкеПодбор = 1;
	КонецЕсли;
	
	Элементы.РезервироватьТовар.Доступность = ПризнакЕГАИС;
	
	//Элементы.ТабличнуюЧастьПриЗагрузкеПодбор.Доступность = ПризнакЕГАИС;
	
	Элементы.ОбновлятьТоварыСДокументом.Доступность = ПризнакЕГАИС;
	
	Элементы.ГенерацияПаклистаНаСервере.Доступность = ПризнакЕГАИС;
	
	Элементы.ШтрихкодыТолькоПоШаблонам.Доступность = ПризнакЕГАИС;
	
	Элементы.УникальныеШтрихкодыНоменклатурыВДокументе.Доступность = ПризнакЕГАИС;
	
	Элементы.ИспользоватьФотофиксациюПодбор.Доступность = ПризнакЕГАИС;
	Элементы.ПутьВыгрузкиИзображенияПодбор.Доступность = ПризнакЕГАИС;
	Элементы.ПутьВыгрузкиИзображения.Доступность = ПризнакЕГАИС;
	
	Элементы.КардРидер_Трек1.Доступность = ПризнакЕГАИС;
	Элементы.КардРидер_Трек2.Доступность = ПризнакЕГАИС;
	Элементы.КардРидер_Трек3.Доступность = ПризнакЕГАИС;
	
	//Элементы.ГрупповаяРабота.Доступность = ПризнакЕГАИС;
	//Элементы.ГрупповаяРаботаЗвуковоеОповещение.Доступность = ПризнакЕГАИС;
	//Элементы.ГрупповаяРаботаИнтервалОпроса.Доступность = ПризнакЕГАИС;
	
	
	Элементы.ИмяТабличнойЧастиНовойПодбор.Доступность = ПризнакЕГАИС;
	
	Элементы.ИспользованиеСерийниковПодбор.Доступность = ПризнакЕГАИС;
	Элементы.УчитыватьСерийниковВЗаданииПодбор.Доступность = ПризнакЕГАИС;
	
	//Элементы.ИспользованиеУпаковочныхЛистовПодбор.Доступность = ПризнакЕГАИС;
	
	Элементы.ИспользованиеЯчеекПодбор.Доступность = ПризнакЕГАИС;
	Элементы.ЗагружатьCписокЯчеекССервераПодбор.Доступность = ПризнакЕГАИС;
	Элементы.ВыгрузкаЯчеекПодбор.Доступность = ПризнакЕГАИС;
	
	Элементы.ВидДокументаНового.Доступность = ПризнакЕГАИС;
	
	Элементы.Приемка.Доступность = ПризнакЕГАИС;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕГАИСРежимВВодаPDF417ПриИзменении(Элемент)
			
	Если Объект.ЕГАИСРежимВВодаPDF417 = 1 И Объект.ЕгаисИспользоватьМарку = 2 Тогда
		
		Объект.ЕгаисИспользоватьМарку = 1;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕгаисИспользоватьМаркуПриИзменении(Элемент)
	
	Если Объект.ЕГАИСРежимВВодаPDF417 = 1 И Объект.ЕгаисИспользоватьМарку = 2 Тогда
		
		Объект.ЕГАИСРежимВВодаPDF417 = 0;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеЕГАИСПриИзменении(Элемент)
	
	Если Объект.СопоставлениеЕГАИС Тогда
		
		Элементы.ЕГАИСРежимВВодаPDF417.Доступность = ИСТИНА;
		
	Иначе
		
		Объект.ЕГАИСРежимВВодаPDF417 = 0;
		Элементы.ЕГАИСРежимВВодаPDF417.Доступность = ЛОЖЬ;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЕГАИСПриИзменении(Элемент)
	
	ИЗОткрытия = ЛОЖЬ;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаИзмененияШаблонаЕГАИС",
      ЭтотОбъект,Объект);		
	  
	Если ИЗОткрытия Тогда
		СформироватьШаблонЕГАИС(ИзОткрытия);	
	Иначе
	    ПоказатьВопрос(Оповещение,
        "Шаблон будет изменен. Продолжить?",
        РежимДиалогаВопрос.ДаНет,
        0, // таймаут в секундах
        КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
        "Шаблон" // (необ.) заголовок
    	);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаИзмененияШаблонаЕГАИС(Результат, Объект) Экспорт		
    Если Результат = КодВозвратаДиалога.Да Тогда
        СформироватьШаблонЕГАИС(ЛОЖЬ);
	Иначе
		Объект.ЕГАИС = НЕ Объект.ЕГАИС;
		Объект.ВидДокумента = Элементы.ВидДокумента.СписокВыбора[0].Значение; 
    КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИспользоватьПодборПриИзменении(Элементы.ИспользоватьПодбор);
	ИспользоватьПриемкуПриИзменении(Элементы.ИспользоватьПриемку);
	Элементы.ТабличнуюЧастьПриЗагрузкеПодбор.Заголовок=?(Объект.ВидДокументаНового="","Табличную часть исходного документа при загрузке","Табличную часть нового документа при загрузке");
	Элементы.ТабличнуюЧастьПриЗагрузкеПриемка.Заголовок=?(Объект.ВидДокументаНового="","Табличную часть исходного документа при загрузке","Табличную часть нового документа при загрузке");
	
	Если Объект.ИспользованиеЯчеекПодбор = 3 Тогда
		Объект.ВыгрузкаЯчеекПодбор = 1;
		Элементы.ВыгрузкаЯчеекПодбор.Доступность=ЛОЖЬ;
	Иначе
		Элементы.ВыгрузкаЯчеекПодбор.Доступность=ИСТИНА;
	КонецЕсли;


	Если Объект.ИспользованиеЯчеекПриемка = 3 Тогда
		Объект.ВыгрузкаЯчеекПриемка = 1;
		Элементы.ВыгрузкаЯчеекПриемка.Доступность=ЛОЖЬ;
	Иначе
		Элементы.ВыгрузкаЯчеекПриемка.Доступность=ИСТИНА;
	КонецЕсли;

	
	ИспользоватьФотофиксациюПодборПриИзменении(Элементы.ИспользоватьФотофиксациюПодбор);
	ИспользоватьФотофиксациюПриемкаПриИзменении(Элементы.ИспользоватьФотофиксациюПриемка);
	
		СформироватьшаблонЕГАИС(Истина);
	ЕГАИСРежимВВодаPDF417ПриИзменении(Элементы.ЕГАИСРежимВВодаPDF417);
	СопоставлениеЕГАИСПриИзменении(Элементы.СопоставлениеЕГАИС);
	ЕгаисИспользоватьМаркуПриИзменении(Элементы.ЕгаисИспользоватьМарку);

КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() тогда
		Объект.ИспользоватьПодбор=Истина;
		Объект.ВсеШтрихкодыТовара=Истина;
	КонецЕсли;	
	СобратьВидыДокументов(Элементы.ВидДокумента.СписокВыбора);
	СобратьТабЧастиДокументов(Объект.ВидДокумента,Элементы.ИмяТабличнойЧастиПодбор.СписокВыбора);
	СобратьТабЧастиДокументов(Объект.ВидДокумента,Элементы.ИмяТабличнойЧастиПриемка.СписокВыбора);
	СобратьВидыДокументов(Элементы.ВидДокументаНового.СписокВыбора);
	СобратьТабЧастиДокументов(Объект.ВидДокументаНового,Элементы.ИмяТабличнойЧастиНовойПодбор.СписокВыбора);
	СобратьТабЧастиДокументов(Объект.ВидДокументаНового,Элементы.ИмяТабличнойЧастиНовойПриемка.СписокВыбора);
	Если Объект.ВидДокументаНового="" тогда
		СобратьРеквизитыДокумента(Объект.ВидДокумента,Элементы.НовыеЗначенияРеквизитовИмяРеквизита.СписокВыбора);
	Иначе	
		СобратьРеквизитыДокумента(Объект.ВидДокументаНового,Элементы.НовыеЗначенияРеквизитовИмяРеквизита.СписокВыбора);
	КонецЕслИ;	
КонецПроцедуры


&НаКлиенте
Процедура ПеречитатьПараметры(Команда)
	лТекст=СтрЗаменить(Объект.УсловиеВыгрузки,"&"," &");
	лТекст=СтрЗаменить(лТекст," ",Символы.ПС);
	Объект.ПараметрыУсловияВыгрузки.Очистить();
	Для ш=1 по СтрЧислоСтрок(лТекст) цикл
		Если Лев(СтрПолучитьСтроку(лТекст,ш),1)="&" тогда
			новСтр=Объект.ПараметрыУсловияВыгрузки.Добавить();
			новСтр.ИмяПараметра=Сред(СтрПолучитьСтроку(лТекст,ш),2);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура ИспользоватьПодборПриИзменении(Элемент)
	объект.ПриемкаПоПодбору=?(объект.ИспользоватьПриемку И Объект.ИспользоватьПодбор,объект.ПриемкаПоПодбору, ложь);
	объект.ПриПриемкеЗапрашиватьТовар=?(объект.ИспользоватьПриемку И Объект.ИспользоватьПодбор И объект.ПриемкаПоПодбору,объект.ПриПриемкеЗапрашиватьТовар,Ложь);
	
	объект.ТабличнуюЧастьПриЗагрузкеПодбор=?(объект.ИспользоватьПодбор,объект.ТабличнуюЧастьПриЗагрузкеПодбор,0);
	объект.ПриСканированииТовараПодбор=?(объект.ИспользоватьПодбор,объект.ПриСканированииТовараПодбор,0);
	объект.ПриПревышенииЗаданияПодбор=?(объект.ИспользоватьПодбор,объект.ПриПревышенииЗаданияПодбор,0);
	объект.ПриПревышенииЛимитаПодбор=?(объект.ИспользоватьПодбор,объект.ПриПревышенииЛимитаПодбор,0);
	объект.ИспользованиеЯчеекПодбор=?(объект.ИспользоватьПодбор,объект.ИспользованиеЯчеекПодбор,0);
	
	ИспользованиеЯчеекПодборПриИзменении(Элементы.ИспользованиеЯчеекПодбор);
	объект.ИспользованиеСерийниковПодбор=?(объект.ИспользоватьПодбор,объект.ИспользованиеСерийниковПодбор,0);
	ИспользованиеСерийниковПодборПриИзменении(Элементы.ИспользованиеСерийниковПодбор);
	объект.ИспользованиеУпаковочныхЛистовПодбор=?(объект.ИспользоватьПодбор,объект.ИспользованиеУпаковочныхЛистовПодбор,0);
	объект.РучнойВводКоличестваПодбор=?(объект.ИспользоватьПодбор,объект.РучнойВводКоличестваПодбор,Ложь);
	объект.ПодтверждатьЭнтеромПодбор=?(объект.ИспользоватьПодбор,объект.ПодтверждатьЭнтеромПодбор,Ложь);
	объект.ОтсылатьГотовуюЗаписьНаСерверПодбор=?(объект.ИспользоватьПодбор,объект.ОтсылатьГотовуюЗаписьНаСерверПодбор,Ложь);
	объект.ПечатьЭтикеткиПриПодборе=?(объект.ИспользоватьПодбор,объект.ПечатьЭтикеткиПриПодборе,0);
	объект.ПриемкаПоПодбору=?(объект.ИспользоватьПодбор И объект.ИспользоватьПриемку,объект.ПриемкаПоПодбору,Ложь);
	объект.ПриПриемкеЗапрашиватьТовар=?(объект.ИспользоватьПодбор И объект.ИспользоватьПриемку И объект.ПриемкаПоПодбору,Объект.ПриПриемкеЗапрашиватьТовар,Ложь);
	
	Элементы.ИмяТабличнойЧастиНовойПодбор.ТолькоПросмотр=не объект.ИспользоватьПодбор;
	Элементы.ИмяТабличнойЧастиПодбор.ТолькоПросмотр=не объект.ИспользоватьПодбор;
	Элементы.ТабличнуюЧастьПриЗагрузкеПодбор.ТолькоПросмотр=не объект.ИспользоватьПодбор;
	Элементы.ПриСканированииТовараПодбор.ТолькоПросмотр=не объект.ИспользоватьПодбор;
	Элементы.ПриПревышенииЗаданияПодбор.ТолькоПросмотр=не объект.ИспользоватьПодбор;
	Элементы.ПриПревышенииЛимитаПодбор.ТолькоПросмотр=не объект.ИспользоватьПодбор;
	Элементы.ИспользованиеЯчеекПодбор.ТолькоПросмотр=не объект.ИспользоватьПодбор;
	Элементы.ИспользованиеСерийниковПодбор.ТолькоПросмотр=не объект.ИспользоватьПодбор;
	Элементы.ИспользованиеУпаковочныхЛистовПодбор.ТолькоПросмотр=не объект.ИспользоватьПодбор;
	Элементы.РучнойВводКоличестваПодбор.ТолькоПросмотр=не объект.ИспользоватьПодбор;
	Элементы.ПодтверждатьЭнтеромПодбор.ТолькоПросмотр=не объект.ИспользоватьПодбор;
	Элементы.ОтсылатьГотовуюЗаписьНаСерверПодбор.ТолькоПросмотр=не объект.ИспользоватьПодбор;
	Элементы.ПечатьЭтикеткиПриПодборе.ТолькоПросмотр=не объект.ИспользоватьПодбор;
	Элементы.ПриемкаПоПодбору.ТолькоПросмотр=не (объект.ИспользоватьПодбор И объект.ИспользоватьПриемку);
	Элементы.ПриПриемкеЗапрашиватьТовар.ТолькоПросмотр=не (объект.ИспользоватьПодбор И объект.ИспользоватьПриемку И объект.ПриемкаПоПодбору);
КонецПроцедуры
&НаКлиенте
Процедура ИспользованиеЯчеекПодборПриИзменении(Элемент)
	
	Если НЕ ПроверитьВозможностьАдресногоХранения("Подбор", Объект.ВидДокумента,  Объект.ИмяТабличнойЧастиПодбор, Объект.ИмяТабличнойЧастиПриемка) И Объект.ИспользованиеЯчеекПодбор > 0 Тогда
		Если Объект.ВидДокументаНового <> "" Тогда
			
			Если   НЕ  ПроверитьВозможностьАдресногоХранения("Подбор", Объект.ВидДокументаНового,  Объект.ИмяТабличнойЧастиНовойПодбор, Объект.ИмяТабличнойЧастиНовойПриемка) Тогда
				Предупреждение("Документ "+элементы.ВидДокументаНового.ТекстРедактирования+" не поддерживает адресное хранение. ",,"Отсутствуют реквизиты А.Х.");
				Объект.ИспользованиеЯчеекПодбор = 0;
			КонецЕсли;
			
		Иначе
			Предупреждение("Документ "+элементы.ВидДокумента.ТекстРедактирования+" не поддерживает адресное хранение. ",,"Отсутствуют реквизиты А.Х.");
			Объект.ИспользованиеЯчеекПодбор = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	Объект.УчитыватьЯчеекВЗаданииПодбор=Объект.УчитыватьЯчеекВЗаданииПодбор И объект.ИспользоватьПодбор и объект.ИспользованиеЯчеекПодбор<>0;
	Элементы.УчитыватьЯчеекВЗаданииПодбор.ТолькоПросмотр=не (объект.ИспользоватьПодбор И объект.ИспользованиеЯчеекПодбор<>0);
	
	Объект.ВыгрузкаЯчеекПодбор=?(Объект.ИспользованиеЯчеекПодбор=0,0,Объект.ВыгрузкаЯчеекПодбор);
	Элементы.ВыгрузкаЯчеекПодбор.ТолькоПросмотр=не (объект.ИспользоватьПодбор И объект.ИспользованиеЯчеекПодбор<>0);
	
	Если Объект.ИспользованиеЯчеекПодбор = 0 Тогда
		Объект.ЗагружатьCписокЯчеекССервераПодбор = 0;
		Элементы.ЗагружатьCписокЯчеекССервераПодбор.Доступность=ЛОЖЬ;
		Элементы.ВыгрузкаЯчеекПодбор.Доступность=ЛОЖЬ;
	Иначе
		Элементы.ЗагружатьCписокЯчеекССервераПодбор.Доступность=Истина;
		Элементы.ВыгрузкаЯчеекПодбор.Доступность=Истина;
	КонецЕсли;

	
	
КонецПроцедуры
&НаКлиенте
Процедура ИспользованиеСерийниковПодборПриИзменении(Элемент)
	Объект.УчитыватьСерийниковВЗаданииПодбор=Объект.УчитыватьСерийниковВЗаданииПодбор И объект.ИспользоватьПодбор и объект.ИспользованиеСерийниковПодбор<>0;
	Элементы.УчитыватьСерийниковВЗаданииПодбор.ТолькоПросмотр=не (объект.ИспользоватьПодбор И объект.ИспользованиеСерийниковПодбор<>0);
	Элементы.УникальныеСерийныеНомераПодбор.ТолькоПросмотр=не (объект.ИспользоватьПодбор И объект.ИспользованиеСерийниковПодбор<>0);
КонецПроцедуры
&НаКлиенте
Процедура ИспользоватьПриемкуПриИзменении(Элемент)
	объект.ПриемкаПоПодбору=?(объект.ИспользоватьПриемку И Объект.ИспользоватьПодбор,объект.ПриемкаПоПодбору,Ложь);
	объект.ПриПриемкеЗапрашиватьТовар=?(объект.ИспользоватьПриемку И Объект.ИспользоватьПодбор И объект.ПриемкаПоПодбору,объект.ПриПриемкеЗапрашиватьТовар,Ложь);
	
	объект.ТабличнуюЧастьПриЗагрузкеПриемка=?(объект.ИспользоватьПриемку,объект.ТабличнуюЧастьПриЗагрузкеПриемка,0);
	объект.ПриСканированииТовараПриемка=?(объект.ИспользоватьПриемку,объект.ПриСканированииТовараПриемка,0);
	объект.ПриПревышенииЗаданияПриемка=?(объект.ИспользоватьПриемку,объект.ПриПревышенииЗаданияПриемка,0);
	объект.ПриПревышенииЛимитаПриемка=?(объект.ИспользоватьПриемку,объект.ПриПревышенииЛимитаПриемка,0);
	объект.ИспользованиеЯчеекПриемка=?(объект.ИспользоватьПриемку,объект.ИспользованиеЯчеекПриемка,0);
	ИспользованиеЯчеекПриемкаПриИзменении(Элементы.ИспользованиеЯчеекПриемка);
	
	объект.ИспользованиеСерийниковПриемка=?(объект.ИспользоватьПриемку,объект.ИспользованиеСерийниковПриемка,0);
	ИспользованиеСерийниковПриемкаПриИзменении(Элементы.ИспользованиеСерийниковПриемка);
	объект.ИспользованиеУпаковочныхЛистовПриемка=?(объект.ИспользоватьПриемку,объект.ИспользованиеУпаковочныхЛистовПриемка,0);
	объект.РучнойВводКоличестваПриемка=?(объект.ИспользоватьПриемку,объект.РучнойВводКоличестваПриемка,Ложь);
	объект.ПодтверждатьЭнтеромПриемка=?(объект.ИспользоватьПриемку,объект.ПодтверждатьЭнтеромПриемка,Ложь);
	объект.ОтсылатьГотовуюЗаписьНаСерверПриемка=?(объект.ИспользоватьПриемку,объект.ОтсылатьГотовуюЗаписьНаСерверПриемка,Ложь);
	объект.ПечатьЭтикеткиПриПриемке=?(объект.ИспользоватьПриемку,объект.ПечатьЭтикеткиПриПриемке,0);
	объект.ПриемкаПоПодбору=?(объект.ИспользоватьПодбор И объект.ИспользоватьПриемку,объект.ПриемкаПоПодбору,Ложь);
	объект.ПриПриемкеЗапрашиватьТовар=?(объект.ИспользоватьПодбор И объект.ИспользоватьПриемку И объект.ПриемкаПоПодбору,Объект.ПриПриемкеЗапрашиватьТовар,Ложь);
	
	Элементы.ИмяТабличнойЧастиНовойПриемка.ТолькоПросмотр=не объект.ИспользоватьПриемку;
	Элементы.ИмяТабличнойЧастиПриемка.ТолькоПросмотр=не объект.ИспользоватьПриемку;
	Элементы.ТабличнуюЧастьПриЗагрузкеПриемка.ТолькоПросмотр=не объект.ИспользоватьПриемку;
	Элементы.ПриСканированииТовараПриемка.ТолькоПросмотр=не объект.ИспользоватьПриемку;
	Элементы.ПриПревышенииЗаданияПриемка.ТолькоПросмотр=не объект.ИспользоватьПриемку;
	Элементы.ПриПревышенииЛимитаПриемка.ТолькоПросмотр=не объект.ИспользоватьПриемку;
	Элементы.ИспользованиеЯчеекПриемка.ТолькоПросмотр=не объект.ИспользоватьПриемку;
	Элементы.ИспользованиеСерийниковПриемка.ТолькоПросмотр=не объект.ИспользоватьПриемку;
	Элементы.ИспользованиеУпаковочныхЛистовПриемка.ТолькоПросмотр=не объект.ИспользоватьПриемку;
	Элементы.РучнойВводКоличестваПриемка.ТолькоПросмотр=не объект.ИспользоватьПриемку;
	Элементы.ПодтверждатьЭнтеромПриемка.ТолькоПросмотр=не объект.ИспользоватьПриемку;
	Элементы.ОтсылатьГотовуюЗаписьНаСерверПриемка.ТолькоПросмотр=не объект.ИспользоватьПриемку;
	Элементы.ПечатьЭтикеткиПриПриемке.ТолькоПросмотр=не объект.ИспользоватьПриемку;
	Элементы.ПриемкаПоПодбору.ТолькоПросмотр=не (объект.ИспользоватьПодбор И объект.ИспользоватьПриемку);
	Элементы.ПриПриемкеЗапрашиватьТовар.ТолькоПросмотр=не (объект.ИспользоватьПодбор И объект.ИспользоватьПриемку И объект.ПриемкаПоПодбору);
КонецПроцедуры
&НаКлиенте
Процедура ИспользованиеЯчеекПриемкаПриИзменении(Элемент)
	
	Если НЕ ПроверитьВозможностьАдресногоХранения("Приемка", Объект.ВидДокумента,  Объект.ИмяТабличнойЧастиПодбор, Объект.ИмяТабличнойЧастиПриемка) И Объект.ИспользованиеЯчеекПодбор > 0 Тогда
	Если Объект.ВидДокументаНового <> "" Тогда
		
		Если   НЕ  ПроверитьВозможностьАдресногоХранения("Приемка", Объект.ВидДокументаНового,  Объект.ИмяТабличнойЧастиНовойПодбор, Объект.ИмяТабличнойЧастиНовойПриемка) Тогда
		Предупреждение("Документ "+элементы.ВидДокументаНового.ТекстРедактирования+" не поддерживает адресное хранение. ",,"Отсутствуют реквизиты А.Х.");
		Объект.ИспользованиеЯчеекПодбор = 0;
		КонецЕсли;
		
	Иначе
		Предупреждение("Документ "+элементы.ВидДокумента.ТекстРедактирования+" не поддерживает адресное хранение. ",,"Отсутствуют реквизиты А.Х.");
		Объект.ИспользованиеЯчеекПодбор = 0;
	КонецЕсли;
		
	КонецЕсли;
	
	Объект.УчитыватьЯчеекВЗаданииПриемка=Объект.УчитыватьЯчеекВЗаданииПриемка И объект.ИспользоватьПриемку и объект.ИспользованиеЯчеекПриемка<>0;
	Элементы.УчитыватьЯчеекВЗаданииПриемка.ТолькоПросмотр=не (объект.ИспользоватьПриемку И объект.ИспользованиеЯчеекПриемка<>0);
	
	Объект.ВыгрузкаЯчеекПриемка=?(Объект.ИспользованиеЯчеекПриемка=0,0,Объект.ВыгрузкаЯчеекПриемка);
	Элементы.ВыгрузкаЯчеекПриемка.ТолькоПросмотр=не (объект.ИспользоватьПриемку И объект.ИспользованиеЯчеекПриемка<>0);
		
	Если Объект.ИспользованиеЯчеекПриемка = 0 Тогда
		Объект.ЗагружатьCписокЯчеекССервераПриемка = 0;
		Элементы.ЗагружатьCписокЯчеекССервераПриемка.Доступность=ЛОЖЬ;
		Элементы.ВыгрузкаЯчеекПриемка.Доступность=ЛОЖЬ;
	Иначе
		Элементы.ЗагружатьCписокЯчеекССервераПриемка.Доступность=Истина;
		Элементы.ВыгрузкаЯчеекПриемка.Доступность=Истина;
	КонецЕсли;


	
КонецПроцедуры
&НаКлиенте
Процедура ИспользованиеСерийниковПриемкаПриИзменении(Элемент)
	Объект.УчитыватьСерийниковВЗаданииПриемка=Объект.УчитыватьСерийниковВЗаданииПриемка И объект.ИспользоватьПриемку и объект.ИспользованиеСерийниковПриемка<>0;
	Элементы.УчитыватьСерийниковВЗаданииПриемка.ТолькоПросмотр=не (объект.ИспользоватьПриемку И объект.ИспользованиеСерийниковПриемка<>0);
	Элементы.УникальныеСерийныеНомераПриемка.ТолькоПросмотр=не (объект.ИспользоватьПриемку И объект.ИспользованиеСерийниковПриемка<>0);
КонецПроцедуры

&НаКлиенте
Процедура ПриемкаПоПодборуПриИзменении(Элемент)
	объект.ПриПриемкеЗапрашиватьТовар=?(объект.ИспользоватьПодбор И объект.ИспользоватьПриемку И объект.ПриемкаПоПодбору,Объект.ПриПриемкеЗапрашиватьТовар,Ложь);
	Элементы.ПриПриемкеЗапрашиватьТовар.ТолькоПросмотр=не (объект.ИспользоватьПодбор И объект.ИспользоватьПриемку И объект.ПриемкаПоПодбору);
КонецПроцедуры
&НаКлиенте
Процедура ПриПриемкеЗапрашиватьТоварПриИзменении(Элемент)
	объект.ПоштучноеПеремещение=?(объект.ИспользоватьПодбор И объект.ИспользоватьПриемку И объект.ПриемкаПоПодбору,Объект.ПриПриемкеЗапрашиватьТовар и Не Объект.ПриПриемкеЗапрашиватьТовар,Ложь);
	Элементы.ПоштучноеПеремещение.ТолькоПросмотр=не (объект.ИспользоватьПодбор И объект.ИспользоватьПриемку И объект.ПриемкаПоПодбору и Не Объект.ПриПриемкеЗапрашиватьТовар);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаЯчеекПодборПриИзменении(Элемент)
	Если Объект.ВыгрузкаЯчеекПодбор = 0 Тогда
		Объект.ЗагружатьCписокЯчеекССервераПодбор = 0;
		Элементы.ЗагружатьCписокЯчеекССервераПодбор.Доступность=ЛОЖЬ
	Иначе
		Элементы.ЗагружатьCписокЯчеекССервераПодбор.Доступность=Истина;
	КонецЕсли;
	
		
	
КонецПроцедуры


&НаКлиенте
Процедура ВыгрузкаЯчеекПриемкаПриИзменении(Элемент)
	Если Объект.ВыгрузкаЯчеекПриемка = 0 Тогда
		Объект.ЗагружатьCписокЯчеекССервераПриемка = 0;
		Элементы.ЗагружатьCписокЯчеекССервераПриемка.Доступность=ЛОЖЬ
	Иначе
		Элементы.ЗагружатьCписокЯчеекССервераПриемка.Доступность=Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьВыгрузкиИзображенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Выбрать();

	Если Диалог.Каталог <> "" Тогда
		Объект.ПутьВыгрузкиИзображения = Диалог.Каталог+"\";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьВыгрузкиИзображенияПодборНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Выбрать();

	Если Диалог.Каталог <> "" Тогда
		Объект.ПутьВыгрузкиИзображенияПодбор = Диалог.Каталог+"\";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьФотофиксациюПодборПриИзменении(Элемент)
	
Если Объект.ИспользоватьФотофиксациюПодбор Тогда
	Элементы.ПутьВыгрузкиИзображенияПодбор.Доступность = ИСТИНА;
ИНАЧЕ
	Элементы.ПутьВыгрузкиИзображенияПодбор.Доступность = ЛОЖЬ;
КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПутьВыгрузкиИзображенияПриемкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Выбрать();

	Если Диалог.Каталог <> "" Тогда
		Объект.ПутьВыгрузкиИзображенияПриемка = Диалог.Каталог+"\";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьФотофиксациюПриемкаПриИзменении(Элемент)
	
Если Объект.ИспользоватьФотофиксациюПриемка Тогда
	Элементы.ПутьВыгрузкиИзображенияПриемка.Доступность = ИСТИНА;
ИНАЧЕ
	Элементы.ПутьВыгрузкиИзображенияПриемка.Доступность = ЛОЖЬ;
КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьАдресногоХранения(Вид, ШАблонДокумента, ИмяТЧПодбор, ИмяТчПриемка)
	
	
	Если ШАблонДокумента = "" Тогда
		Возврат Истина;
	КонецЕсли;

	МетаданныеТекущегоДокумента = Метаданные.документы[ШАблонДокумента];
	
	
	ЕстьРеквизитЗонаОтгрузкиШапка =  НЕ МетаданныеТекущегоДокумента.Реквизиты.Найти("ЗонаОтгрузки") = Неопределено; 
	ЕстьРеквизитЗонаХраненияШапка = НЕ МетаданныеТекущегоДокумента.Реквизиты.Найти("ЗонаХранения") = Неопределено;; 
	ЕстьРеквизитЯчейкаШапка =  НЕ МетаданныеТекущегоДокумента.Реквизиты.Найти("Ячейка") = Неопределено;
	ЕстьРеквизитЗонаДоставкиШапка = НЕ МетаданныеТекущегоДокумента.Реквизиты.Найти("ЗонаДоставки") = Неопределено; 
	
	Если Вид = "Подбор" И Объект.ИспользованиеЯчеекПодбор > 0 Тогда
		
		Если Объект.ИмяТабличнойЧастиПодбор <> "" Тогда
			ЕстьРеквизитЯчейкаТЧ = ?(МетаданныеТекущегоДокумента.табличныеЧасти[ИмяТЧПодбор].Реквизиты.Найти("Ячейка") = Неопределено, ЛОЖЬ, Истина);  
			ЕстьРеквизитЗонаХраненияТЧ = ?(МетаданныеТекущегоДокумента.табличныеЧасти[ИмяТЧПодбор].Реквизиты.Найти("ЗонаХранения") = Неопределено, ЛОЖЬ, Истина);
			ЕстьРеквизитЗонаОтгрузкиТЧ = ?(МетаданныеТекущегоДокумента.табличныеЧасти[ИмяТЧПодбор].Реквизиты.Найти("ЗонаОтгрузки") = Неопределено, ЛОЖЬ, Истина);
		Иначе		ЕстьРеквизитЯчейкаТЧ = ЛОЖЬ;
			ЕстьРеквизитЗонаХраненияТЧ = Истина;
			ЕстьРеквизитЗонаОтгрузкиТЧ = Истина;
		КонецЕсли;
		
	ИначеЕсли Вид = "Приемка" И  Объект.ИспользованиеЯчеекПриемка > 0 Тогда

		
		Если Объект.ИмяТабличнойЧастиПриемка <> "" Тогда
			
			ЕстьРеквизитЯчейкаТЧ = ?(МетаданныеТекущегоДокумента.табличныеЧасти[ИмяТчПриемка].Реквизиты.Найти("Ячейка") = Неопределено, ЛОЖЬ, Истина);  
			ЕстьРеквизитЗонаХраненияТЧ = ?(МетаданныеТекущегоДокумента.табличныеЧасти[ИмяТчПриемка].Реквизиты.Найти("ЗонаХранения") = Неопределено, ЛОЖЬ, Истина);
			ЕстьРеквизитЗонаОтгрузкиТЧ = ?(МетаданныеТекущегоДокумента.табличныеЧасти[ИмяТчПриемка].Реквизиты.Найти("ЗонаОтгрузки") = Неопределено, ЛОЖЬ, Истина);
		Иначе
			ЕстьРеквизитЯчейкаТЧ = Истина;
			ЕстьРеквизитЗонаХраненияТЧ = Истина;
			ЕстьРеквизитЗонаОтгрузкиТЧ = Истина;
		КонецЕсли;
		
	Иначе
		
		ЕстьРеквизитЯчейкаТЧ = Истина;
		ЕстьРеквизитЗонаХраненияТЧ = Истина;
		ЕстьРеквизитЗонаОтгрузкиТЧ = Истина;
		
	КонецЕсли;
	
	Если ЕстьРеквизитЗонаХраненияШапка ИЛИ ЕстьРеквизитЯчейкаШапка ИЛИ ЕстьРеквизитЯчейкаТЧ ИЛИ ЕстьРеквизитЗонаХраненияТЧ ИЛИ ЕстьРеквизитЗонаОтгрузкиТЧ ИЛИ ЕстьРеквизитЗонаОтгрузкиШапка ИЛИ ЕстьРеквизитЗонаДоставкиШапка Тогда	
	
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура НовыеЗначенияРеквизитовЗначениеРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ТИПЗНЧ(Элементы.НовыеЗначенияРеквизитов.ТекущиеДанные.ЗначениеРеквизита) = ТИП("СправочникСсылка.СкладскиеПомещения") Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ЗакрытиеВыбораПомещения", ЭтотОбъект),ПолучитьСписокПомещений(),Элементы.НовыеЗначенияРеквизитов,0);	
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПомещений() 
	
Запрос = Новый Запрос("ВЫБРАТЬ
|	СкладскиеПомещения.Ссылка КАК Ссылка
|ИЗ
|	Справочник.СкладскиеПомещения КАК СкладскиеПомещения");

СписокВозврата = Новый СписокЗначений;
СписокВозврата.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
Возврат СписокВозврата;
	
КонецФункции

&Наклиенте
Процедура ЗакрытиеВыбораПомещения(Результат, ДопПараметры) Экспорт
	
	Элементы.НовыеЗначенияРеквизитов.ТекущиеДанные.ЗначениеРеквизита = Результат.Значение;

КонецПроцедуры
