


Функция ШаблонURLclearreference(Запрос)
	
	 Ответ = Новый HTTPСервисОтвет(200);
	
    
	Пароль       = Запрос.Заголовки["Password"];  		
	//ДатаДень  = Запрос.Заголовки["DateDay"];
	//ДатаМесяц = Запрос.Заголовки["DateMonth"];
	//ДатаГод   = Запрос.Заголовки["DateYear"];
	
	result = "ok";

Попытка
	ДанныеСтрока      = мпОбменСервер.УдалитьИзмененияПоВладельцу(Пароль);
	
Исключение
		result = "error";
	ДанныеСтрока = мпОбщегоНазначения.ДанныеПереводимВСтроку(ОписаниеОшибки());
	Ответ.Заголовки.Вставить("texterror", ДанныеСтрока);
//ТекстДок = Новый ТекстовыйДокумент;
//ТекстДок.ДобавитьСтроку(ОписаниеОшибки());
//ТекстДок.Записать("C:\winsrv\piteyniysrv\111.txt");
	
КонецПопытки;	
	
	Ответ.Заголовки.Вставить("result",result);
	Ответ.УстановитьТелоИзСтроки(ДанныеСтрока);
	
	
	Возврат Ответ;
	
КонецФункции
